"""
Задание 3.
Определить количество различных подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените хеши и множества

рара:

рар
ра
ар
ара
р
а
"""

#Решение из лекции, вариант первый

import hashlib

s = input("Введите строчные латинские буквы: ")
r = set()               #множество

N = len(s)               #длина строки
for i in range(N):
    if i == 0:
        N = len(s) - 1
    else:
        N = len(s)
    for j in range(N, i, -1):
#        print(s[i:j])

        r.add(hashlib.sha1(s[i:j].encode('utf-8')).hexdigest())   #хеш-функция
#print(r)

print("Количество различных подстрок в строке '%s' равно %d" % (s, len(r)))