"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены
Используем операции % //

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""
import time


def rec_reverse(num):
    if num < 10:
        return num
    return str(num % 10) + str(rec_reverse(num // 10))


try:
    user_num = int(input('Введите число, теперь можно с нулем конце: '))
    print(f'Перевернутое число: {rec_reverse(user_num)}')
except ValueError:
    print('Вы ввели не число. Компьтер взорвется через 5')
    time.sleep(1)
    print('4')
    time.sleep(1)
    print('3')
    time.sleep(1)
    print('2')
    time.sleep(1)
    print('1')
    time.sleep(1)
    print('Активация взрыва запущена')
