"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Ряд строить программно - в самой же рекурсивной ф-ции
или даже обойтисть без создания ряда

Элемент в 2 раза меньше предыд и имеет противопол знак
"""


def rec_summ(num, num_count, num_summ):
    if num_count == 0:
        return f'Сумма: {num_summ}'
    else:
        num_count -= 1
        return rec_summ(num / -2, num_count, num_summ + num)


user_count = int(input('Введите количество элементов: '))
print(rec_summ(1, user_count, 0))
