"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


def revers_number(number_str):
    if len(number_str) == 1:
        return number_str
    else:
        return number_str[len(number_str) - 1] + revers_number(number_str[:(len(number_str) - 1)])


if __name__ == '__main__':
    usr_input = input('Введите число, которое требуется перевернуть: ')
    if usr_input.isdigit():
        print(f'Перевернутое число: {revers_number(usr_input)}')
    else:
        print('Ваш ввод не соответствует заданным требованиям')
