"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
def summa(num, my_list, result):
    if num == 0:
        return f'Их сумма - {result}'
    else:
        return summa(num - 1, my_list, result + my_list[num - 1])

my_list = [1, -0.5, 0.25, -0.125, -0.0625]
res = summa(int(input('Введите количество элементов: ')), my_list, 0)
print(res)



