"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

import random


def sum_calc(num: int) -> int:
    if num == 1:
        return 1

    return num + sum_calc(num - 1)


n = int(input('Введите число: '))
print(sum_calc(n) == n * (n + 1) / 2)
