"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def calculator():

    def right_symbol():
        symbol = input("Введите операцию (+, -, *, / или 0 для выхода): ")
        if symbol not in ['+', '-', '*', '/', '0']:
            print("Вы ввели неправильный знак. ")
            return right_symbol()
        return symbol
    sign = right_symbol()
    if sign == '0':
        return

    def number_one():
        number = input('Введите первое число: ')
        if number.isdigit() is False:
            print("Вы ввели не число")
            return number_one()
        return number
    one = number_one()

    def number_two():
        number = input('Введите второе число: ')
        if number.isdigit() is False:
            print("Вы ввели не число")
            return number_two()
        return number
    two = number_two()
    try:
        result = eval(one + sign + two)
        print(result)
    except ZeroDivisionError:
        print("На ноль делить нельзя.")
    finally:
        calculator()


calculator()

