"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""

allow_operations = ("+", "-", "*", "/")


def math():
    operation = input("Введите операцию (+, -, *, / или 0 для выхода): ")
    if operation == "0":
        print("Выход...")
        return

    if operation not in allow_operations:
        print("Неверная операция!")
        return math()

    one_num = input("Введите первое число: ")
    two_num = input("Введите второе число: ")

    if not one_num.isnumeric() or not two_num.isnumeric():
        print(f"Вы вместо числа ввели строку. Исправьтесь")
        return math()

    if operation == "+":
        res = int(one_num) + int(two_num)
        print(f"Ваш результат: {res}")
        return math()
    elif operation == "-":
        res = int(one_num) - int(two_num)
        print(f"Ваш результат: {res}")
        return math()
    elif operation == "*":
        res = int(one_num) * int(two_num)
        print(f"Ваш результат: {res}")
        return math()
    elif operation == "/":
        if int(two_num) == 0:
            print("На 0 делить нельзя!")
            return math()
        res = int(one_num) / int(two_num)
        print(f"Ваш результат: {res}")
        return math()


math()
