"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

from random import randint


def guess_number(rand_num=randint(0,100), trying=10):
    if trying == 0:
        return rand_num
    num = int(input('Введите число: '))
    if num > rand_num:
        print('Загаданное число меньше, повторите попытку', rand_num)
        return guess_number(rand_num, trying-1)
    elif num < rand_num:
        print('Загаданное число больше, повторите попытку', rand_num)
        return guess_number(rand_num, trying-1)
    else:
        return 'Вы отгадали'


print(guess_number())
