"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""
def operations():
    do = input('Введите операцию (+, -, *, / или 0 для выхода): ')
    if do == '0':
        exit()
    elif do == '+' or do == '-' or do == '*' or do == '/':
        a = int(input('Введите первое число: '))
        b = int(input('Введите второе число: '))
        if do == '+':
            print('Ваш результат: ', a + b)
            return operations()
        if do == '-':
            print('Ваш результат: ', a - b)
            return operations()
        if do == '*':
            print('Ваш результат: ', a * b)
            return operations()
        if do == '/':
            if b == 0:
                print('На нуль делить нельзя!')
                return operations()
            else:
                print('Ваш результат: ', a / b)
                return operations()
    else:
        print('Введена неверная операция!')
        return operations()


operations()




# while True:
#     a = int(input('Введите первое число: '))
#     b = int(input('Введите второе число: '))
#     k = True
#     do = input('Выберите действие: "+", "-", "*", "/" или "0" для выхода. ')
#     if do == '0' or do == '+' or do == '-' or do == '*' or do == '/':
#         k = False
#     while k == True:
#         print('Введена неверная операция!')
#         do = str(input('Выберите действие: "+", "-", "*", "/" или "0" для выхода. '))
#         if do == '0' or do == '+' or do == '-' or do == '*' or do == '/':
#             k = False
#     if do == '0':
#         break
#     elif do == '+':
#         res = a + b
#         print(f'Результат операции: {res}')
#     elif do == '-':
#         res = a - b
#         print(f'Результат операции: {res}')
#     elif do == '*':
#         res = a * b
#         print(f'Результат операции: {res}')
#     elif do == '/':
#         if b == 0:
#             print('Делить на ноль нельзя!')
#         else:
#             res = a / b
#             print(f'Результат операции: {res}')