"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

def summ(n):
    n = n - 1
    if n == 0:
        return 1
    else:
        if n % 2:
            result = -1/2**n  # каждое следующее число в ряду - это возведение в степень делителя.
        else:
            result = 1/2**n
        return result + summ(n)

try:
    number = int(input('Введите количество элементов: '))
except ValueError:
    print('Введены некорректные данные')
else:
    if 0 < number < 995:
        print(f'Количество элементов - {number}, их сумма - {summ(number)}')
    else:
        print('Введено недопустимое количество элементов')
