"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""

def action():
    """Функция, которая будет складывать, вычитать, умножать или делить
        два числа. Числа и знак операции вводятся пользователем

    """
    input_correct = True
    oper = input("Введите операцию (+, -, *, / или 0 для выхода):")
    if oper not in ["+", "-", "*", "/", "0"]:
        print("Некорректный ввод")
        input_correct = False

    if oper == "0":
        # Завершение рекурсии
        return

    if input_correct:
        try:
            a = float(input("Введите первое число:"))
            try:
                b = float(input("Введите второе число:"))
            except ValueError:
                print("Некорректный ввод")
                input_correct = False
        except ValueError:
            print("Некорректный ввод")
            input_correct = False

    if input_correct:
        if oper == "+":
            print("Ваш результат = ", a + b)
        elif oper == "-":
            print("Ваш результат = ", a - b)
        elif oper == "*":
            print("Ваш результат = ", a * b)
        else:
            if b != 0:
                print("Ваш результат = ", a / b)
            else:
                print("На ноль делить нельзя")

    action()


action()
