"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def res(nmax, n=1):
    if n == nmax:
        return n
    return n + res(nmax, n + 1)


if __name__ == '__main__':
    n = int(input('Введите число n: '))
    print(res(n) == n * (n + 1) / 2)
