"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""

def num_reversal(num,reversed_num=0):

    if len(num) == 0:
        print (f'перевернутое число: {reversed_num}')
        return
    else:
        digit = int(num[-1])
        reversed_num = 10*reversed_num+digit
        trimmed_num = num[:-1]
        num_reversal(trimmed_num,reversed_num)

user_num = str(3486)
print(f'изначальное число: {user_num}')
num_reversal(user_num)
