"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def summ_row(i, n, el, s_row):
    if i == el:
        print(f'Количество элементов - {el}, их сумма - {s_row}')
    elif i < el:
        return summ_row(i + 1, (n / 2) * -1, el, s_row + n)


el = int(input('Введите количество элементов ряда: '))

summ_row(0, 1, el, 0)
