"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

el_list_for_sum = []


def row(el_cnt, el=1):
    if el_cnt == 0:
        print('Сумма элементов равна: ' + str(sum(el_list_for_sum)))
    else:
        el_list_for_sum.append(el)
        el /= 2 * -1
        return row(el_cnt - 1, el)


row(3)
print(el_list_for_sum)
