"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def progression_sum(n, summ, count):
    if n == 0:
        return print(f'Сумма {count} элементов прогрессии : {summ}')
    else:
        return progression_sum(n - 1, summ + (- 1 / 2) ** (n - 1), count + 1)


progression_sum(int(input('Введите количество элеметов прогрессии: ')), 0, 0)
