"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def recur_calc(num, res):
    if num > 0:
        a = int(input('Введите число: '))
        res += a
        recur_calc(num - 1, res)
    else:
        print(res)


recur_calc(int(input('Введите целое число, сколько элементов складыавть: ')), 0)
