"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
import random

def hot_cold(n,  cnt = 10):
    """ Просит пользоватля отгадать  """
    if cnt > 0 : # считаем попытки
        a = int(input("Введите число от 0 до 100: \n"))

        if a == n: # если угадал
            print(f"Вы угадали! это число {n}!!! Игра окончена ")
            return exit()
        
        else:
            if a > n :
                print("Загаданное число меньше введенного")    
            else:
                print("Загаданное число больше введенного")   
            
            cnt -= 1
            hot_cold(n, cnt)
    else:
        return  print(f"Было загадано число {n}")
    return


def start_quiz():
    """ Начинаем угаывать """
    
    n = random.randint(0,100)
    hot_cold(n)
    return


if __name__ == '__main__':
    start_quiz() 
