"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
n = int(input('Введите количество элементов: '))
box = []


def find_sum_array(param, el=1.0):
    if param == 0:
        return sum(box)
    box.append(el)
    el = -(el / 2)
    param -= 1
    return find_sum_array(param, el)


print(f'Количество элементов: {n}, их сумма: {find_sum_array(n)}')
