"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def seq_sum(nat_num):
    if nat_num == 1:
        return 1
    else:
        return nat_num + seq_sum(nat_num - 1)


inp_num = int(input("Введите натуральное число: "))
if inp_num * (inp_num + 1) / 2 == seq_sum(inp_num):
    print("Равенство: 1+2+...+n = n(n+1)/2 подтверждается")
else:
    print("Равенство: 1+2+...+n = n(n+1)/2 НЕ подтверждается")
