"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def get_calc():
    """
    Функция выполняет складывание, вычитание, деление и умноедние двух чисел
    :return:
    """
    get_val = 0
    operation = input('Введите операция (+, -, *, / или 0 для выхода): ')
    if operation == '0':
        return print('Вы завершили программу')
    else:
        number_1 = input('Введите первое число: ')
        number_2 = input('Введите второе число: ')

        if number_2 == '0' and operation == '/':
            print('Деление на 0 невозможно')
            number_2 = input('Введите второе число: ')
        try:
            number_1 = int(number_1)
            number_2 = int(number_2)
            if operation == '+':
                get_val = number_1 + number_2
            elif operation == '-':
                get_val = number_1 - number_1
            elif operation == '*':
                get_val = number_1 * number_2
            elif operation == '/':
                get_val = number_1 / number_2
            print(get_val)
        except ValueError:
            print('Вы вместо числа ввели буквы. Исправтесь!')
    return get_calc()


get_calc()
