"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


def reverse_num(number):
    """
    Функция переворачивает число
    :param number:
    :return:
    """
    if len(number) == 1:
        return number
    else:
        return str(int(number) % 10) + reverse_num(str(int(number) // 10))


num = input('Введите число: ')
print(f'Перевернутое число: {reverse_num(num)}')
