"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def calculator():

    oper = input('Введите операцию или 0 для выхода')

    if oper == '0':
        return 'До свидания!'

    else:
        if oper not in '+-*/':
            print('Неверный ввод!')
            return calculator()
        else:
            try:
                num_1 = int(input('Введите целое число '))
                num_2 = int(input('Введите целое число '))
                if oper == '+':
                    print('Cумма = ', num_1 + num_2)
                    return calculator()
                elif oper == '-':
                    print('Разность = ', num_1 - num_2)
                    return calculator()
                elif oper == '*':
                    print('Произведение = ', num_1 * num_2)
                    return calculator()
                else:
                    try:
                        print('Частное = ', num_1 / num_2)
                        return calculator()
                    except ZeroDivisionError:
                        print('Делить на 0 нельзя!')
                        return calculator()
            except ValueError:
                print('Ошибка ввода!')
                return calculator()

print(calculator())