"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def my_function(n: int):
    if n == 1:
        return 1
    else:
        return 1 - my_function(n - 1) / 2


num_el = int(input('Введите количество элементов: '))
print(f'Количество элементов - {num_el}, их сумма - {my_function(num_el)}')
