"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""

def enter():
    num = input('Введите натуральное число: ')
    if not num.isdigit():
        print('Некорректный ввод.')
        return enter()
    return num


def reverse_num(num: int, res = ''):
    res += num[-1]
    if len(num) == 1:
        return res
    num = num[:-1]
    return reverse_num(num, res)

print(f'Развернутое число: {reverse_num(enter())}.')