"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


def rev_num(num):
    """
    Функция возвращает реверс числа

    num: число, которое требуется перевернуть
    """
    if len(str(num)) < 2:
        return num
    else:
        return f'{num % 10}{rev_num(num // 10)}'


print(f'Перевернутое число: {rev_num(int(input("Введите число: ")))}')