"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""
enter = int(input('Введите число, которое требуется перевернуть: '))
rev_number = []


def reversed_num(number):
    if number == 0:
        return ''.join(rev_number)
    rev_number.append(str(number % 10))
    return reversed_num(number // 10)


print(f'Перевернутое число: {reversed_num(enter)}')
