"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def math_op():
    math_operation = input("Введите операцию (+, -, *, / или 0 для выхода):")
    if math_operation == '0':
        print("Выход")
        #return math_op()
        exit()
    elif math_operation not in ("+-*/"):
        print("Укажите, пожалуйста, операцию из списака выше")
        return math_op()
    else:
        try:
            try:
                first_number = int(input("Введите первое число:"))
                second_number = int(input("Введите второе число:"))

                if math_operation == "+":
                    result = first_number + second_number
                    print(f"Ваш результат {result}")
                    return math_op()

                elif math_operation == "-":
                    result = first_number - second_number
                    print(f"Ваш результат {result}")
                    return math_op()

                elif math_operation == "*":
                    result = first_number * second_number
                    print(f"Ваш результат {result}")
                    return math_op()

                elif math_operation == "/":
                    result = first_number / second_number
                    print(f"Ваш результат {round(result)}")
                    return math_op()

            except ZeroDivisionError:
                print("На 0 делить нельзя")
                return math_op()


        except ValueError:
            print("Вы вместо числа ввели строку")
            return math_op()


math_op()
