"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def recur_calc(sign):
    global res
    if sign != '0' and sign != '+' and sign != '-' and sign != '*' and sign != '/':
            recur_calc(input('Введите операцию для входа: '))
    elif sign == '0' or sign == 0:
        print('Операция завершена')
    else:
        first_numb = input('Введите первое число: ')
        while True:
            if not first_numb.isnumeric():
                first_numb = input('Вы ввели не число, попробуйсте снова!')
            else:
                break

        second_numb = input('Введите второе число: ')
        while True:
            if not second_numb.isnumeric():
                second_numb = input('Вы ввели не число, попробуйсте снова!')
            elif sign == '/' and second_numb == '0':
                second_numb = input('Делить на 0 нельзя, попробуйсте снова!')
            else:
                break

        if sign == '+':
            res = int(first_numb) + int(second_numb)
        elif sign == '-':
            res = int(first_numb) - int(second_numb)
        elif sign == '*':
            res = int(first_numb) * int(second_numb)
        elif sign == '/':
            res = int(first_numb) / int(second_numb)

        print(int(res))
        recur_calc(input('Введите операцию для входа: '))


recur_calc(input('Введите операцию для входа: '))
