"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
выдолжна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def calculator():
    operation = input("Введите операцию (+, -, *, / или 0 для выхода):")
    if operation == "0":
        return
    if operation in "/+-*":
        try:
            fdigit = float(input("Введите первое число: "))
            sdigit = float(input("Введите второе число: "))
        except ValueError:
            print(
                "Вы вместо трехзначного числа ввели строку (((. Исправьтесь."
            )
            return calculator()
        if operation == "+":
            print(f"Ваш результат {fdigit + sdigit}")
        elif operation == "*":
            print(f"Ваш результат {fdigit * sdigit}")
        elif operation == "-":
            print(f"Ваш результат {fdigit - sdigit}")
        elif operation == "/":
            if sdigit == 0:
                print("Деление на 0 невозможно")
            else:
                print(f"Ваш результат {fdigit / sdigit}")
    else:
        print("Неправильный знак операции")
    calculator()


calculator()
