"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить два числа.
Числа и знак операции вводятся пользователем. После выполнения вычисления программа не должна завершаться,
а должна запрашивать новые данные для вычислений.
Завершение программы должно выполняться при вводе символа '0' в качестве знака операции.
Если пользователь вводит неверный знак (не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль, если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

!!!Решите через рекурсию. Решение через цикл не принимается.

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def calculator():  # функция calculator
    operation_type = input("Введите операцию (+, -, *, / или 0 для выхода): ")

    if operation_type == '0':
        return "Выход"  # ничего не возвращаем, просто выходим

    else:
        if operation_type in "+-*/":
            try:
                num_1 = int(input("Введите первое число: "))
                num_2 = int(input("Введите второе число: "))

                if operation_type == '+':
                    res = num_1 + num_2
                    print(f"Ваш результат: {res}")
                    return calculator()  # вызов функции calculator из тела самой функции

                elif operation_type == '-':
                    res = num_1 - num_2
                    print(f"Ваш результат: {res}")
                    return calculator()  # вызов функции calculator из тела самой функции

                elif operation_type == '*':
                    res = num_1 * num_2
                    print(f"Ваш результат: {res}")
                    return calculator()  # вызов функции calculator из тела самой функции

                elif operation_type == '/':
                    if num_2 != 0:
                        res = num_1 / num_2
                        print(f"Ваш результат: {res}")
                    else:
                        print("Ошибка. Деление на ноль невозможно")
                    return calculator()  # вызов функции calculator из тела самой функции

            except ValueError:
                print(
                    "Видимо было введено не число")
                return calculator()  # вызов функции calculator из тела самой функции

        else:
            print("Введен неверный символ, попробуйте еще раз")
            return calculator()  # вызов функции calculator из тела самой функции


calculator()
