"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_recur(n):
    if n == 1:
        return 1
    else:
        return 1 * (-0.5) ** (n - 1) + sum_recur(n - 1)


inp_str = input("Введите целое число > 0:")
while not inp_str.isdigit():
    print("Введено не число")
    inp_str = input("Введите целое число > 0:")

var_int = int(inp_str)
var_sum = sum_recur(var_int)

print(var_sum)
