"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
В ф-цию принимаются два элемент - это левая и правая части

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def check_cond(x, m):
    if x > 1:
        k, _ = check_cond(x-1, m)
        return k + x, k + x == m
    else:
        return 1, 1 == m


if __name__ == '__main__':
    n = 10
    print(check_cond(n, n*(n+1)/2)[1])
