"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


def inverse_number(number_list, new_number=[]):
    if len(number_list) == 0:
        print(f'Перевернутое число: {"".join(new_number)}')
        return

    last = number_list.pop()
    new_number.append(last)

    return inverse_number(number_list, new_number)


if __name__ == "__main__":
    number_list_data = [i for i in input("Введите число, которое требуется перевернуть: ")]
    inverse_number(number_list_data)
