"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


def reverse_value(num):
    num_size = len(str(num))
    one_dig = (num // 10 ** (num_size - 1))
    if num_size == 1:
        return one_dig
    return f'{reverse_value(num - one_dig * 10 ** (num_size - 1))}{one_dig}'


print(f'Перевернутое число: {reverse_value(int(input("Введите число, которое требуется перевернуть: ")))}')
