"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def calc(num_1, num_2, operation):
    num_1 = int(num_1)
    num_2 = int(num_2)
    if operation == '0':
        print('Программа завершена')
    else:
        if operation == '*' or '/' or '+' or '-':
            if operation == "+":
                result = num_1 + num_2
            elif operation == "-":
                result = num_1 - num_2
            elif operation == "/":
                result = num_1 / num_2
            elif operation == "*":
                result = num_1 * num_2
            print(f'Результат Вашего вычисления: {result}')
            num_3 = input("Введите первое число")
            num_4 = input("Введите второе число")
            oper = input("Что делаем с числами? Для выхода нажмите 0")
            calc(num_3, num_4, oper)
        else:
            oper_2 = input('Вы ввели не корретную операцию. Введите еще раз')
            calc(num_1, num_2, oper_2)


calc("2", "3", "+")

