"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""

from functools import reduce


def turn_over1(num: int):
    if not num // 10:
        return str(num % 10)
    a = num // 10
    return int(str(num % 10) + str(turn_over1(a)))


def turn_over2(num: int):
    return int(reduce(lambda full, b: full + str(b), [str(num % 10), '' if not (a := num // 10) else turn_over2(a)]))


if __name__ == '__main__':
    print(turn_over1(123))
    print(turn_over2(123))
