"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""

import operator
ops = {"+": operator.add, "-": operator.sub, "/": operator.truediv, "*": operator.mul}


def prompt_for_number(prompt, check_for_0):
    user_number = input(prompt)
    if user_number == '0' and check_for_0:
        print('На ноль делить нельзя!')
    else:
        try:
            user_number = int(user_number)
            return user_number
        except ValueError:
            print("Пожалуйста, введите число: ")
    return prompt_for_number(prompt, check_for_0)


def calc():
    user_operator = input('Введите операцию (+, -, *, / или 0 для выхода): ')
    if user_operator == '0':
        exit(0)
    elif user_operator not in ops.keys():
        print('Ошибка! Вы ввели не арифметический оператор.')
        return calc()
    else:
        user_number1 = prompt_for_number('Введите первое число: ', False)
        user_number2 = prompt_for_number('Введите второе число: ', user_operator == '/')
        res = ops[user_operator](user_number1, user_number2)
        print(res)
        return calc()


calc()
