#! /bin/python3
"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

from random import randint


def compare(psecret, ptry):
    if ptry == 0:
        return False
    else:
        num = int(input(f'Осталось попыток - {ptry}. Введите число: '))
        if num == psecret:
            return True
        elif num > secret:
            print('Неверно! Число слишком велико.')
        elif num < secret:
            print('Неверно! Число слишком мало.')
        return compare(psecret, ptry - 1)


secret = randint(0, 100)     # Генерируем случайное число
maxTry = 10                  # Максимальное число попыток
# print(secret)
print(f'Загадано число от 0 до 100 включительно. Попробуйте угадать за {maxTry} попыток')

if compare(secret, maxTry):
    print(f'Правильно! Было загадано число {secret}.')
else:
    print(f'Больше нет попыток, Вы не угадали. Было загадано число {secret}.')

