"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


class ReverseNum:

    def __init__(self):
        self.num_lst = list(input('Введите число: '))
        self.reversed_num_list = []

    def reverse(self):
        if len(self.num_lst):
            self.reversed_num_list.append(self.num_lst.pop())
            self.reverse()
        else:
            print(f'Обратный порядок цифр - {"".join(self.reversed_num_list)}')


reverse_num = ReverseNum()
reverse_num.reverse()