"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def get_sum(n, my_sum):
    if n > 0:
        my_sum += n
        n -= 1
        return get_sum(n, my_sum) # вот в этом месте return не было и в итоговом else неявно возвращала None,
        # долго тупил здесь
    else:
        return my_sum


if __name__ == '__main__':
    n = 5
    print(get_sum(n, 0)==int(n*(n+1)/2))
    # print(a)
    # print(b)
