"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


def rec_number_reverse(number, result=0):
    if number == 0:
        return print(f'Перевернутое число: {result}')

    else:
        result = (result * 10) + (number % 10)
        number //= 10
        return rec_number_reverse(number, result)


try:
    rec_number_reverse(int(input('Введите число, которое требуется перевернуть: ')))
except ValueError:
    print('Введено некорректное значение, завершение программы')