"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


def reverse_num(number, rv_number=''):
    try:
        number = int(number)
        if number == 0:
            return int(rv_number)
        rv_number += str((number % 10))
        return reverse_num(number // 10, str(rv_number))
    except ValueError:
        return reverse_num(input("Пожалуйста введите целое положительное число!: "))


print(reverse_num(input("Пожалуйста введите целое положительное число: ")))

