"""
2.	Посчитать четные и нечетные цифры введенного натурального числа.
Например, если введено число 34560, то у него 3 четные цифры
(4, 6 и 0) и 2 нечетные (3 и 5).

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
и смотреть является ли она четной или нечетной. При этом увеличиваем соответствующий счетчик
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число: 123
Количество четных и нечетных цифр в числе равно: (1, 2)
"""


def rec_digicalc(number, odd_digits=0, even_digits=0):
    digit = number % 10
    if digit % 2:
        odd_digits += 1
    else:
        even_digits += 1
    number = number // 10
    if number > 0:
        rec_digicalc(number, odd_digits, even_digits)
    else:
        print(f'Количество четных и нечетных цифр в числе равно: {even_digits}, {odd_digits}')
        return


rec_digicalc(int(input("Введите число: ")))
