"""
2.	Посчитать четные и нечетные цифры введенного натурального числа.
Например, если введено число 34560, то у него 3 четные цифры
(4, 6 и 0) и 2 нечетные (3 и 5).

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
и смотреть является ли она четной или нечетной. При этом увеличиваем соответствующий счетчик
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число: 123
Количество четных и нечетных цифр в числе равно: (1, 2)
"""


def count(number, even=0, odd=0):
    if number == 0:
        return print(f'Во веденном Вами числе четных: {even} и нечетных: {odd} чисел')
    else:
        num_one = number % 10
        if num_one % 2 == 0:
            even += 1
        else:
            odd += 1
        number = number // 10
        count(number, even, odd)


try:
    number = int(input("Введите число: "))
    count(number)
except ValueError:
    print(f"Вы ввели не число, пожалуйста, введите число ")
