"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""

# функции математических операций
def summator(a,b):
    return a + b

def differ(a,b):
    return a - b

def prod(a,b):
    return a*b

def division(a,b):
    if b == 0:
        return 'Деление на ноль. Введите делитель отличны от нуля'
    else:
        return a/b
    return



# решение через цикл

def loop_oper(flag = True):
    """ Вычисляет заданную операцию над двумя числами"""
    while flag:
        oper = {'+': summator, '-': differ, '*': prod, '/': division}
        op = input("Введите операцию (+, -, *, / или 0 для выхода): ")
        if op == '0' :
            break
        else:
            if not (op in oper.keys()):
                continue
            a = input("Введите первое число: \n")
            if a.isnumeric() == False:
                print('Укажите число ')
                continue
            b = input("Введите второе число: \n")
            if b.isnumeric() == False:
                print('Укажите число ')
                continue
            fn = oper.get(op)
            print(fn(float(a),float(b)))
    return

# рекурсия
def recursive():
    """ Реализация через рекурсию"""

    oper = {'+': summator, '-': differ, '*': prod, '/': division}
    op = input("Введите операцию (+, -, *, / или 0 для выхода): ")

    if op == '0':
        exit()
    if not (op in oper.keys()):
         recursive()
    a = input("Введите первое число: \n")
    if a.isnumeric() == False:
        print('Укажите число ')
        recursive()
    b = input("Введите второе число: \n")
    if b.isnumeric() == False:
        print('Укажите число ')
        recursive()
    fn = oper.get(op)
    print(fn(float(a),float(b)))
    recursive()
    return 


if __name__ == '__main__':

    #loop_oper()
    recursive()
