"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.
Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены
Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


def reverse(x, r=0):
    if x == 0:
        print(f'обратное число: {r}')
    else:
        y = x % 10
        r = (r * 10) + y
        x = x // 10
        reverse(x, r)


reverse(69)
reverse(345)
reverse(7543)
reverse(962468)