"""
5.	Вывести на экран коды и символы таблицы ASCII, начиная с символа
под номером 32 и заканчивая 127-м включительно.
Вывод выполнить в табличной форме: по десять пар "код-символ" в каждой строке.

Пример:
32 -   33 - ! 34 - " 35 - # 36 - $ 37 - % 38 - & 39 - ' 40 - ( 41 - )
42 - * 43 - + 44 - , 45 - - 46 - . 47 - / 48 - 0 49 - 1 50 - 2 51 - 3
52 - 4 53 - 5 54 - 6 55 - 7 56 - 8 57 - 9 58 - : 59 - ; 60 - < 61 - =
62 - > 63 - ? 64 - @ 65 - A 66 - B 67 - C 68 - D 69 - E 70 - F 71 - G
72 - H 73 - I 74 - J 75 - K 76 - L 77 - M 78 - N 79 - O 80 - P 81 - Q
82 - R 83 - S 84 - T 85 - U 86 - V 87 - W 88 - X 89 - Y 90 - Z 91 - [
92 - \ 93 - ] 94 - ^ 95 - _ 96 - ` 97 - a 98 - b 99 - c 100 - d 101 - e
102 - f 103 - g 104 - h 105 - i 106 - j 107 - k 108 - l 109 - m 110 - n 111 - o
112 - p 113 - q 114 - r 115 - s 116 - t 117 - u 118 - v 119 - w 120 - x 121 - y
122 - z 123 - { 124 - | 125 - } 126 - ~ 127 - 

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def asii(symbols, count=1):                                 # счетчик с изначальным значением в нуле
    number = symbols[0]                                     # первый номер из списка
    if len(symbols) == 1:                                   # условие завершения рекурсии
        return f'{number} - {chr(number)}'                  # вывод пары "код-символ"
    else:
        if count == 10:                                     # если уже 10 символов в строке
            print(f'{number} - {chr(number)}')              # выводим следующий с переводом строки
            count = 1                                       # возвращаем счетчик
        else:
            count += 1                                      # пополняем счетчик
            print(f'{number} - {chr(number)} ', end='')     # вывод значений в одну строку
        return asii(symbols[1:], count)                     # рекурсивный вызов ф-ии с увеличением левой границы


def print_symbols_from_asii(left, right):
    symbols_lst = [i for i in range(left, right+2)]         # создание списка номеров
    return asii(symbols_lst)                                # вызов функции вывода символов


print_symbols_from_asii(32, 127)                            # вызов функции с переданными ей границами поиска
