"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
def recur_method (numb, l=0, r=1):
    if l == r:
        print (f'Равенство: {l == r}')
    elif l < r:
        return recur_method(numb, l+1, numb*(numb+1)//2)
recur_method(int(input('Введите число: ')))