"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum(n: int):
    if n == 1:
        return 1
    elif n <= 0:
        return 'Число \'n\' должно быть натуральным!'
    else:
        if n % 2 == 1:
            return sum(n - 1) + 1 / 2 ** (n - 1)
        else:
            return sum(n - 1) - 1 / 2 ** (n - 1)

print(sum(5))
