"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

import math


def get_sum(max_count, now_count=1):
    if max_count == now_count:
        return 1
    return math.pow(-0.5, now_count) + get_sum(max_count, now_count + 1)


user_number = int(input('[?] Введите количество элементов: '))
print(f'[=] Количество элементов: {user_number}, их сумма: {get_sum(user_number)}')
