"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
import sys
sys.setrecursionlimit(10000)

def sum_n(n):
    if n == 1:
        return n
    return n+sum_n(n-1)


n = int(input('Введите число: '))
print(f'Сумма чисел от 1 до n равна {sum_n(n)}')
print(f'n(n+1)/2 = {n*(n+1)/2}')
if sum_n(n) == n*(n+1)/2:
    print('Равенство выполняется!')
else:
    print('Равенство не выполняетс!')
