"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def row_sum(num, a_i):
    if num == 1:
        return a_i
    return row_sum(num - 1, a_i * (-0.5)) + a_i


try:
    a = int(input('Введите количество элементов: '))
except ValueError:
    print('Ошибка ввода')
else:
    print(f'Сумма ряда = {row_sum(a, 1)}')
