"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def n_sum(n, ns=1, i=1):
    if n == 1:
        return ns
    else:
        return n_sum(n - 1, ns + i / -2, i / -2)


try:
    print(n_sum(int(input('Введите количество элементов:\n'))))
except ValueError:
    print('Необходимо указать количество элементов в числовом значении!')
