"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
import random


def guess(numb, val=0, n=10):
    if val == numb:
        return print(f"Ура вы отгадали, это число {numb}")
    elif n == 0:
        return print("Закончились попытки")
    else:
        n -= 1
        value = int(input("Введите число от 0 до 100: "))
        return guess(numb, value, n)


guess(random.randint(0, 100))
