"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_elem(n: int, a=0):
    if a != n * (n + 1) / 2:
        a = a + n + sum_elem(n - 1)
        return a
    return 0


if __name__ == '__main__':
    print(sum_elem(100))
