"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


def rec_turn(user_input, turn):
    if user_input == 0:  # условие завершения
        return turn
    else:  # иначе делаем и опять запускаем
        turn = turn * 10 + user_input % 10
        user_input = user_input // 10
        return rec_turn(user_input, turn)


u_input = input('Enter a number: \n')
if u_input.isnumeric():
    print('Result:', rec_turn(int(u_input), 0))
else:
    print('You must enter a number')
