"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

import sys


def check(n=1, x=0):
    if x + n == n * (n + 1) / 2:
        print(f'Для числа {n} равенство выполняется')
        return check(n+1, x+n)
    print(f'Для числа {n} равенство не выполняется')
    return check(n+1, x+n)


def cycle_check(n=1, x=0):
    while True:
        if n + x == n * (n + 1) / 2:
            print(f'Для числа {n} равенство выполняется')
            x += n
            n += 1
        else:
            print(f'Для числа {n} равенство не выполняется')


lim = int(input('Введите максимальную глубину рекурсии: '))
sys.setrecursionlimit(lim)
check()
cycle_check()


"""
При подсчёте рекурсией в определённый момент переполняется оперативная память, насколько я понял это неизбежно,
ведь в данном случае размер стека рекурсии может достичь предела доступной оперативной памяти раньше,
чем заданного лимита стека. В случае с циклом этого не происходит, т.к. мы не считаем рекурсивно сумму, а просто храним
предыдущее значение.
"""