"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


def mirror_number(target):
    if not target.isdigit():
        print('Введённое не является натуральным числом')
        return None
    target_number = int('1' + target)

    return rebuild_digits(target_number)[:-1]


def rebuild_digits(target_number):
    x, y = divmod(target_number, 10)
    if x == 0:
        return str(y)
    else:
        return str(y) + rebuild_digits(x)


print('Введите число, которое требуется перевернуть:')
print(f'Перевёрнутое число: {mirror_number(input())}')
