"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def rec_calc(math_op):
    while math_op not in ('+', '-', '*', '/', '0'):
        math_op = input("Введите операцию (+, -, *, / или 0 для выхода): ")
    if math_op == '0':
        return
    while True:
        try:
            first_number = int(input("Введите первое число: "))
            break
        except ValueError:
            print("Вы вместо трехзначного числа ввели строку (((. Исправьтесь")
    while True:
        try:
            second_number = int(input("Введите второе число: "))
            break
        except ValueError:
            print("Вы вместо трехзначного числа ввели строку (((. Исправьтесь")
    if second_number == 0 and math_op == '/':
        while second_number == 0:
            print("Делить на ноль нельзя, введите другое число!")
            while True:
                try:
                    second_number = int(input("Введите второе, отличное от ноля число: "))
                    break
                except ValueError:
                    print("Вы вместо трехзначного числа ввели строку (((. Исправьтесь")
    if math_op == '+':
        result = first_number + second_number
    elif math_op == '-':
        result = first_number - second_number
    elif math_op == '*':
        result = first_number * second_number
    else:
        result = first_number / second_number
    print("Ваш результат: ", result)
    rec_calc(input("Введите операцию (+, -, *, / или 0 для выхода): "))


rec_calc(input("Введите операцию (+, -, *, / или 0 для выхода): "))
