"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

def func(number, number2=0):
	if number2 == 0:
		number2 = int((number * (number + 1) / 2))
	if number == 0:
		print(f"n(n+1)/2 = {number2}")
		return number
	else:
		return number + func(number - 1, number2)
		
print(func(5))
