"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""

def str_reverse(in_str, in_index):
    v_rev = ''
    if in_index < len(in_str):
        v_rev = str_reverse(in_str, (in_index+1)) + in_str[in_index]
    return v_rev

if __name__ == '__main__':
    print('Enter value:')
    v_val = input()
    v_rev = str_reverse(v_val, 0)
    print('Reverse value: ' + v_rev)
