"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

def enter():
    n = input('Введите количество элементов: ')
    if not n.isdigit():
        print('Некорректный ввод.')
        return enter()
    return int(n)

def geom_progr(n: int, next = 1, res = 1):
    next = next / (-2)
    n -= 1
    res += next
    if n == 1:
        return res
    return geom_progr(n, next, res)

print(f'Сумма элементов - {geom_progr(enter())}.')