"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def recurs(n):
    if n == 1 and n:
        return 1
    return recurs(n - 1) / 2 * (-1 ** n)

x = sum([recurs(x) for x in range(1, 4)])
print(x)
