"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_natural(number: int) -> int:
    if number == 1:
        return number
    else:
        return sum_natural(number - 1) + number


n = 100
print(f' Сумма ряда натуральных чисел от 1 до {n} = {n}*({n}+1)/2: ',
      sum_natural(n) == n * (n + 1) / 2)
