"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


##########################################
def recu(num):
    if num == 1:
        return num
    else:
        return recu(num - 1) + num


############################################
try:
    num = int(input("Введите число: "))
    if recu(num) == num * (num + 1) / 2:
        print('Ok')
except ValueError:
    print("Invalid number")

###############################################
