"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

def proves(num: int):
    """Функция, доказывающая или проверяющая, что для множества
        натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2

    """

    if num <= 1:
        res = 1
    else:
        res = num + proves(num - 1)

    if res == num * (num + 1) / 2:
        print(f"Для n={num} выполняется")
    else:
        print(f"Для n={num} не выполняется!!!")

    return res


N = int(input("Введите n = "))
proves(N)
