"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.
Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.
Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0
Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""

## можно было и лучше написать конечно...

def my_func(val = input('Введите операцию (+, -, *, / или 0 для выхода): ')):
  if val == '0':
    return f'Завершение работы'
  elif val == '+' or val == '-' or val == '*' or val == '/':
    if val == '+':
      def get_sum(number_1 = int(input('Введите первое число: ')), number_2 = int(input('Введите второе число: '))):
        if number_2 == 0:
          return f'Ваш результат {number_1}'
        return get_sum(number_1 + 1, number_2 - 1)
      print(get_sum())
      return my_func(val = input('Введите операцию (+, -, *, / или 0 для выхода): '))
    elif val == '-':
      def get_sub(number_1 = int(input('Введите первое число: ')), number_2 = int(input('Введите второе число: '))):
        if number_2 == 0:
          return f'Ваш результат {number_1}'
        return get_sub(number_1 - 1, number_2 - 1)
      print(get_sub())
      return my_func(val = input('Введите операцию (+, -, *, / или 0 для выхода): '))
    elif val == '*':
      def get_mul(number_1 = int(input('Введите первое число: ')), number_2 = int(input('Введите второе число: '))):
        if number_1 == 1:
          return f'Ваш результат {number_2}'
        return get_mul(number_1 // number_1 , number_2 * number_1)
      print(get_mul())
      return my_func(val = input('Введите операцию (+, -, *, / или 0 для выхода): '))
    elif val == '/':
      def get_div(number_1 = int(input('Введите первое число: ')), number_2 = int(input('Введите второе число: '))):
        if number_2 == 1:
          return f'Ваш результат {number_1}'
        return get_div(number_1 / number_2 , number_2 // number_2)
      try:
        print(get_div())
      except ZeroDivisionError:
        print('Деление на 0')
      return my_func(val = input('Введите операцию (+, -, *, / или 0 для выхода): '))
  else:
    print(f'Вы вместо числа ввели строку. Исправьтесь.')
    try:
      return my_func(val = input('Введите операцию (+, -, *, / или 0 для выхода): '))
    except ValueError:
      print(f'Вы вместо числа ввели строку. Исправьтесь.')
      return my_func(val = input('Введите операцию (+, -, *, / или 0 для выхода): '))


print(my_func())