"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def is_a_digit(data):
    while not data.isdigit():
        print('Ошибка ввода. Пожалуйста, введите одно целое натуральное число.')
        data = input('Введите число: ')
    return data


def rec(a, b=1.0, c=0.0):
    if int(a) > 0:
        return rec((int(a) - 1), (b * -0.5), c + b)
    else:
        return c


user_input = is_a_digit(input('Введите количество элементов: '))
print(f'Количество элементов: {user_input}, их сумма: {rec(user_input)}.')
