"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

import random


def guess(num, variant, i):
    i = i - 1
    if i == 0:
        print('К сожалению, вы не угадали. Загаданное число:', num)
    elif variant > num:
        guess(num, int(input('Загаданное число меньше вашего варианта. Попробуйте еще раз! ')), i)
    elif variant < num:
        guess(num, int(input('Загаданное число больше вашего. Попробуйте еще раз! ')), i)
    elif variant == num:
        print('Поздравляем, это победа! Загаданное число:', num)


guess(random.randint(0, 100), int(input('Угадай число: ')), 10)
