"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_n(n, d, s):
    """

    :param n: количество элементов
    :param d: число ряда, при запуске установить 1
    :param s: сумма, при запуске установить 0
    :return:
    """
    if n == 0:
        return s
    elif n % 2 == 0:
        return sum_n(n - 1, d / 2, s + d * (-1))
    elif n % 2 != 0:
        return sum_n(n - 1, d / 2, s + d)

num = int (input("Введите количество элементов >>>"))
print(f"Количество элементов {num} сумма {sum_n(num, 1, 0)}")
