"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


def d(a=0, res ='', n = 1):
    if n == 0:
        return res
    if a == 0:
        a = int(input('число '))
        n = len(str(a)) -1
        res = res + str(a % 10)
        a = a // 10
        return d(a, res, n)
    res = res + str(a % 10)
    n = len(str(a)) -1
    a = a // 10
    return d(a, res, n)