"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

import random


def soothsayer(number, effort=0):
    if effort == 10:
        print('Ты проиграл!')
    else:
        user_number = (int(input(f'Попытка {effort + 1} из 10. Отгадай число: ')))
        if user_number == number:
            print('Ты победил!')
        elif user_number < number:
            print(f'Твоё число меньше.')
            soothsayer(number, effort + 1)
        elif user_number > number:
            print(f'Твоё число больше.')
            soothsayer(number, effort + 1)


rand_num = random.randint(1, 100)

soothsayer(rand_num)
