"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
def rec_sum(elem, quan, res = 0, begin = 0):
    if quan == 0:
        return print('Количество элементов - ', begin, ' их сумма - ', res)
    return rec_sum(elem / -2, quan - 1, res + elem, begin + 1)


a = int(input('Введите первый эелемент ряда чисел: '))
b = int(input('Введите количество элементов, которое необходимо суммировать: '))
rec_sum(a, b)