"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def get_number():
    while True:
        try:
            number_1 = int(input('Введите первое число: '))
            number_2 = int(input('Введите второе число: '))
            return number_1, number_2
        except ValueError:
            print('Вы ввели не число. Исправтесь.')


def calculator():
    action = input('Введите операцию (+, -, *, / или 0 для выхода): ')
    if action == '0':
        return print('Программа завершена.')
    elif action == '+' or action == '-' or action == '*' or action == '/':
        number_1, number_2 = get_number()
        if action == '+':
            print(f'Ваш результат {number_1 + number_2}')
        if action == '-':
            print(f'Ваш результат {number_1 - number_2}')
        if action == '*':
            print(f'Ваш результат {number_1 * number_2}')
        if action == '/':
            try:
                print(f'Ваш результат {number_1 / number_2}')
            except ZeroDivisionError:
                print('Делитель не может быть равен нулю. Исправтесь.')
        return calculator()
    else:
        print('Вы ввели не верный символ. Исправтесь.')
        return calculator()

calculator()
