"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
def sumList(x, i = 0):
    if i >= len(x):
        return 0
    return x[i] + sumList(x,i + 1)



arr = [int(i) for i in input('Введите количество элементов через пробел ').split()]
print(f' Сумма данных элементов: {sumList(arr)}')