"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""
def calculatian ():
    sign_value = input('Введите опреацию (+, -, *, / или "0" для выхода) ')
    while sign_value not in ('+', '-', '*', '/','0'):
        print('Введден не верный символ операции. Попробуйте снова ')
    if sign_value == '0':
        print('Завершение программы')
        return
    else:
        try:
            first_value = int(input('Введите первое число: '))
            second_value = int(input('Введите второе число: '))
            if sign_value == '+':
                print(f'При сумме =  {first_value + second_value}')
            elif sign_value == '-':
                print(f'При вычитании = {first_value - second_value}')
            elif sign_value == '*':
                print(f'При умножении = {first_value * second_value}')
            elif sign_value == '/':
                print(f'При делении = {first_value / second_value}')
        except ValueError:
            print('Введено не верное числовое значение')
        except ZeroDivisionError:
            print('Деление на 0 == невозможно')
        calculatian()

calculatian()