"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""
<<<<<<< Updated upstream
=======
def reverse_number(count='', numb=(input('Enter number: '))):
    if len(numb) == 1:
        count += numb
        return count
    else:   
        count += numb[-1]
        return reverse_number(count, numb[:-1])

print(reverse_number())



>>>>>>> Stashed changes
