"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def recurs(var_char=None):
    if var_char is None:
        var_char = input("Введите операцию (+, -, *, / или 0 для выхода): ")
    if var_char == '0':
        return
    var_str = input("Введите первое число: ")
    while not var_str.isdigit():
        print("Введено не число")
        var_str = input("Введите первое число: ")
    var_num1 = float(var_str)

    var_str = input("Введите второе число: ")
    while not var_str.isdigit():
        print("Введено не число")
        var_str = input("Введите второе число: ")
    var_num2 = float(var_str)

    if var_char == "+":
        print(f"Ваш результат {var_num1 + var_num2}")
    elif var_char == "-":
        print(f"Ваш результат {var_num1 - var_num2}")
    elif var_char == "*":
        print(f"Ваш результат {var_num1 * var_num2}")
    elif var_char == "/":
        try:
            print(f"Ваш результат {var_num1 / var_num2}")
        except ZeroDivisionError:
            print("Деление на 0!")
    else:
        print("Неизвестная операция")
        recurs()
    var_char = input("Введите операцию (+, -, *, / или 0 для выхода): ")
    recurs(var_char)


recurs()
