"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""
import sys

sys.setrecursionlimit(10000)

def rev(num):
    tmp = num % 10
    if num // 10 != 0:
        return f'{str(tmp)} {rev(num // 10)}'
    else:
        return f'{str(tmp)}'

number = int(input("Введите число и я его разверну: "))
print(rev(number))
