"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def summ_of_elements (n, idx=0, result=0):
    if idx == n:
        print(f'Количество элментов: {n}, их сумма: {result}')
    else:
        result +=(-0.5)**idx
        idx +=1
        summ_of_elements(n, idx, result)


summ_of_elements(n = int(input('Введите количество элементов: ')))