"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


def reverse(current_number):
    var_int = int(current_number)
    if len(current_number) == 1:
        return current_number
    item = var_int % 10
    var_int = var_int // 10
    return str(item) + reverse(str(var_int))


inp_str = input("Введите число:")
while not inp_str.isdigit():
    print("Введено не число")
    inp_str = input("Введите число:")

var_reverse = reverse(inp_str)
print(f'Реверс = {var_reverse}')
