"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""

new_number = []


def revers(number_list):
    if len(number_list) == 0:
        print(''.join(new_number))
        return
    n = number_list.pop()
    new_number.append(n)
    return revers(number_list)


some_list = [i for i in input("Ведите целое число: ")]
revers(some_list)

