"""
2.	Посчитать четные и нечетные цифры введенного натурального числа.
Например, если введено число 34560, то у него 3 четные цифры
(4, 6 и 0) и 2 нечетные (3 и 5).

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
и смотреть является ли она четной или нечетной. При этом увеличиваем соответствующий счетчик
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число: 123
Количество четных и нечетных цифр в числе равно: (1, 2)
"""
def count_dig(n, even=0, noteven=0):
   if n==0:
       return (f'В числе -  {even} четных и  {noteven} нечетных цифр')
   else:
        dig=n%10
        n=n//10
        if dig%2 == 0:
            even+=1
            return count_dig(n, even, noteven);
        else:
            noteven+=1
        return count_dig(n, even, noteven);
#(f'В числе {n} -  {len(lsteven)} четных и  {len(lstnoteven)} нечетных цифр')
   # count_dig(n//10)
print(count_dig(5623));