"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

import random


def game(number=random.randint(0, 100), moves=10):
    if moves == 0:
        return print(f'Вы проиграли, загаданное число {number}')
    user_num = int(input('Введите ваше число: '))
    if user_num < number:
        print('Ваше число меньше')
    if user_num > number:
        print('Ваше число больше')
    if user_num == number:
        print('Вы победили')
        exit()
    game(number, moves-1)


game()