"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def summa(n, k=1):
    print('abs(k) = : ', abs(k), 'len: ', len(str(abs(k))))
    if len(str(abs(k))) == n + 2:
        return 0
    else:
        return k + summa(n, k * (-0.5))


# при увеличении кол-ва элементов, растет степень, у каждого из них увеличивается кол-во знаков после запятой
# условие выхода из рекурсии: n + 2  - по сути степень числа, где +2 это 0 и .
# не очень красиво, но работает

print(summa(int(input('Введите количество элементов: '))))

print(summa(1))
print(summa(3))
print(summa(10))
