"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def rec(n):
    if n == 0:
        return n
    else:
        return n + rec(n - 1)


def sum(n):
    res = n * (n + 1) / 2
    return int(res)


if __name__ == '__main__':
    if rec(15) == sum(15):
        print('Проверка пройдена!')
    if rec(33) == sum(33):
        print('Проверка пройдена!')
    if rec(133) == sum(133):
        print('Проверка пройдена!')
