"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_series(n: int):
    """Находит сумму n элементов ряда 1/(-2**(i-1)), где i от 1 до n"""

    # Проверим на бессмысленные вычисления
    if n <=0:
        return 0

    # Выход из рекурсии, сумма одного элемента = 1
    if n <= 1:
        return 1

    res = 1 / ((-2) ** (n-1))

    return res + sum_series(n-1)


N = int(input("Введите количество элементов: "))
print(f"Количество элементов {N}, их сумма: {sum_series(N)}")
