"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def summa(a, b):
    if b > 0:
        return sum(a + 1, b - 1)
    else:
        return a


def subs(a, b):
    if b > 0:
        return subs(a - 1, b - 1)
    else:
        return a


def mult(a, b):
    if b > 1:
        return a + mult(a, b - 1)
    else:
        return a


def div(a, b, answer=0):
    if a >= b:
        return div(a - b, b, answer=answer + 1)
    else:
        return answer


def operation():
    z = input('Введите операцию (+, -, *, / или 0 для выхода) и числа в формате "*,2,3": ')
    if z != '0':
        try:
            a = int(z.split(',')[1])
            b = int(z.split(',')[2])
            z = z.split(',')[0]
            if z == '+':
                return f'{print(summa(a, b))} {operation()}'
            elif z == '-':
                print(f'{print(subs(a, b))} {operation()}')
            elif z == '*':
                print(f'{print(mult(a, b))} {operation()}')
            elif z == '/':
                print(f'{print(div(a, b))} {operation()}')
            else:
                return 'Неправильный знак операции'
        except IndexError:
            return f'{print("Проверьте ввод")} {operation()}'
    else:
        return 'Конец программы!'


print(operation())

"""
z = input('Введите операцию (+, -, *, / или 0 для выхода) и числа в формате "*,2,3": ')

a = z.split(',')[1]
b = z.split(',')[2]
z = z.split(',')[0]

print(a,b,z)
"""

# Не совсем понимаю почему выводятся None values
