"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


def obr_number(number, number_two=0):
    if number == 0:
        return print(f'Обратное число {number_two}')
    else:
        num_one = number % 10
        number_two = (number_two * 10) + num_one
        number = number // 10
        obr_number(number, number_two)


try:
    number = int(input("Введите число: "))
    obr_number(number)
except ValueError:
    print(f"Вы ввели не число, пожалуйста, введите число ")
