"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов: 3, их сумма: 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Каждый очередной элемент в 2 раза меньше предыдущего и имеет противоположный знак
"""


def sum_n(n, start=1.0):
    if n > 1:
        return start + sum_n(n - 1, 0 - start/2)
    return start


if __name__ == '__main__':
    m = int(input('Введите количество элементов: '))
    s = sum_n(m)
    print(f'Количество элементов: {m}, их сумма: {s}')

