"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


def number():
    """ Запрос числа """
    try:
        return int(input('Введите число, которое требуется перевернуть: '))
    except ValueError:
        print('Вы ввели не число.')
        return numbers()


def revers_number(x, y=0):
    """ Реверс числа. """
    if x == 0:
        print(f'Перевернутое число: {y}')
    else:
        y = y * 10 + x % 10
        x = x // 10
        return revers_number(x, y)


x = number()
revers_number(x)
