"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def proof1(n, sum_n=0, i=0):
    # Функция ведет подсчет суммы чисел, i счетчик.
    # Вывод результата в виде кортежа чисел (сумма, результат по формуле)
    if n == 0:
        return sum_n, i*(i+1)/2
    sum_n += n
    i += 1
    return proof1(n-1, sum_n, i)


def proof(max_n=50, n=1, str_n='', sum_n=0):
    # Функция - демострация.
    # Функция поочередно складывает числа. Выводит порядок сложения чисел; * результат по формуле
    str_n = f"{str_n}+{n}"
    sum_n += n
    str_print = f"{str_n} = {sum_n} * {n*(n+1)/2}"
    if len(str_print) > 30:
        str_print = f"{str_n[0:28]} ... +{n} = {sum_n} * {n*(n+1)/2}"
    print(str_print)
    if n == max_n or input("Проверяем? да - Enter") != '':
        return 'ok'
    return proof(max_n, n+1, str_n, sum_n)


print(proof1(16))
print(proof(16))
