"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def equation_proof(n, n_init=0):
    if not n_init:
        n_init = n
    if not (n - 1):
        return f'{int(n_init*(n+1)/2)} = {n_init}({n_init}+1)/2 = 1'
    else:
        return f'{equation_proof(n - 1, n_init)}+{n}'


print(equation_proof(4))
