"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
                                                   2 -1   0.5  - 0.25
                                                   8 -4  2   -1  0.5
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
def sum_rev(a, n):
    if n == 1:
        return a
    else:
        n -= 1
        return a - (sum_rev(a, n)/2)


a = int(input('Введите натуральное число, последовательность которого хотите получить: _'))
n = int(input('Введите количество элементов последовательности, которые необходимо сложить: _'))
print(f'Сумма необходимых элементов равна:  {sum_rev(a, n)}')