"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def summ_number(n: int) -> int:
    i = 1
    summ = 0
    while n >= i:
        summ = i + summ_number(i - 1)
        i += 1
    a = summ
    b = int(n * (n + 1) / 2)
    if a == b:
        print('для множества натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2')
    else:
        print('для множества натуральных чисел не выполняется равенство: 1+2+...+n = n(n+1)/2')
    return summ


n = 5
summ_number(n)



