"""
2.	Посчитать четные и нечетные цифры введенного натурального числа.
Например, если введено число 34560, то у него 3 четные цифры
(4, 6 и 0) и 2 нечетные (3 и 5).

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
и смотреть является ли она четной или нечетной. При этом увеличиваем соответствующий счетчик
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число: 123
Количество четных и нечетных цифр в числе равно: (1, 2)
"""


def counting(num, count_1=0, count_2=0):
    if len(str(num)) == 0:
        print(f'{count_1} {count_2}')
    else:
        num_2 = int(num) % 10
        if num_2 % 2 == 0:
            count_1 += 1
            num = str(num[:-1])
            counting(num, count_1, count_2)
        else:
            count_2 += 1
            num = str(num[:-1])
            counting(num, count_1, count_2)


counting('12345788')

