"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def check_1(number):
    if number == 1:
        return 1
    else:
        return number + check_1(number - 1)


n = 123
print(check_1(n) == n * (n + 1) / 2)
