"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


def num_reverse(num):
    """Функция рекурсивно реверсирует число (делает обратный порядок цифр в числе)

    :param num: Числол, которое нужно развернуть
    :return: Возвращает реверсивное число
    """
    digit = num % 10 * 10 ** (len(str(num)) - 1)
    num = int((num - num % 10) / 10)
    if num == 0:
        return digit
    digit += num_reverse(num)
    return digit


def num_print(num):
    """Исключительно для вывода результата

    :param num: Число для реверса
    :return: Вывод в терминал
    """
    print(f"Число {num} - реверс: {num_reverse(num)}")


#################################
num_print(123)
num_print(3486)
num_print(123456789)
