"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def calc():
    operation = input('Введите операцию (+, -, *, / или 0 для выхода): ')
    if operation not in ['+', '-', '*', '/', '0']:
        print('Вы ввели недопустимый знак операции, попробуйте еще раз.')
        return calc()
    if operation == '0':
        return print('Программа завершена')
    try:
        x = float(input('Введите первое число: '))
        y = float(input('Введите второе число: '))
    except ValueError as err:
        print('Вы ввели строку вместо числа.', err)
        return calc()
    finally:
        if y == 0:
            print('На ноль делить нельзя')
            return calc()
        if operation == '+':
            print(f'Сумма введенных чисел равна: {x + y}')
        elif operation == '-':
            print(f'Разность введенных чисел равна: {x - y}')
        if operation == '*':
            print(f'Произведение введенных чисел равно: {x * y}')
        elif operation == '/':
            print(f'Частное введенных чисел равно: {round((x / y), 2)}')
        return calc()


calc()
