"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

from random import randint

def guess(x = randint(0, 100), count = 10):
    y = int(input('Введите число от 0 до 100: '))
    if count == 0 or x == y:
        print(f'Игра закончена. Загаданное число {x}')
    else:
        count -= 1
        if y < x:
            print(f'Осталось ходов {count}.Ваше число меньше загаданного')
        else:
            print(f'Осталось ходов {count}.Ваше число больше загаданного')
        return guess(x, count)


guess()

