"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def check_function(n, x=0, y=1):
    if x == y:
        print(f'Равенство верно')
    elif x < y:
        return check_function(n, x + 1, n * (n + 1) / 2)


if __name__ == '__main__':
    check_function(int(input('Введите число: ')))
