"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


# не понял идею задачи

#####################################################
def turner(item):
    rest_numb, numeral = divmod(item, 10)
    if rest_numb == 0:
        return str(numeral)
    else:
        return str(numeral) + str(turner(rest_numb))


#####################################################
what_to_turn = int(input('Введите число, которое требуется перевернуть: '))
print(f"{turner(what_to_turn)}")
#####################################################
