"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def recursive_calc():
	def oper():
		operation = input("Введите операцию ")
		if operation not in ["+","-","*","/"]:
			print ("действие не найдено")
			return(oper())
		return(operation)
	
	
	def first_num():
		first_number = input("Введите первое число ")
		#функция isint
		#if int(first_number) == False:#first_number not in ["+","-","*","/"]:
		#	print ("Нужно именно число!")
		#	return(first_num())
		return(int(first_number))
	
	
	def second_num():
		second_number = input("Введите второе число ")
		#if int(second_number) == False:#second_number not in ["+","-","*","/"]:
		#	print ("Нужно именно число!")
		#	return(second_num())
		return(int(second_number))
	
	
	my_oper = oper()
	my_first_num = first_num()
	my_second_num = second_num()
	
	#switch case
	if my_oper == "+":
		res = my_first_num+my_second_num
	if my_oper == "-":
		res = my_first_num-my_second_num
	if my_oper == "*":
		res = my_first_num*my_second_num
	if my_oper == "/":
		res = my_first_num/my_second_num
	
	print("Ваш результат "+str(res))

	return recursive_calc()

print(recursive_calc())

