"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def calc_func():
    operation = input('Введите операцию (+, -, *, / или 0 для выхода): ')
    operation = operation.replace(' ', '')
    if operation not in ("+", "-", "*", "/", "0"):
        print('Вы ввлели недопустимую операцию, ознакомьтесь с инструкцией и исправьтесь')
        return calc_func()
    elif operation == "0":
        return print('Пользователь вышел из программы')
    else:
        try:
            a = float(input('Введите первое число: '))
            b = float(input('Введите второе число: '))
        except ValueError:
            print('Вы вместо числа ввели строку. Исправьтесь')
            return calc_func()
    if operation == "+":
        print(f'Ваш результат: {a+b}')
        return calc_func()
    elif operation == "-":
        print(f'Ваш результат: {a-b}')
        return calc_func()
    elif operation == "*":
        print(f'Ваш результат: {a-b}')
        return calc_func()
    elif operation == "/":
        try:
            print(f'Ваш результат: {a/b}')
        except ZeroDivisionError:
            print('Вы хотите делить на ноль! Исправьтесь')
            return calc_func()
        return calc_func()


calc_func()
