"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


def inverse_number(number=None):
    if number is None:
        number = int(input('Введите число, которое требуется перевернуть: '))
    if len(str(number)) == 1:
        print('Перевернутое число: ', end='')
        return number
    return int(str(number % 10) + str(inverse_number(number // 10)))


""" если оставить int, то нули вначале перевернутого числа исчезают. Если их нужно оставить - убираем int"""

print(inverse_number())
