"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


# ((-1)**(i))*(1/(2**i)) i - [0,n)
def task4(n):
    if n == 0:
        return 0
    else:
        return ((-1)**(n-1))*(1/(2**(n-1))) + task4(n-1)


print(f'Сумма 1о элементов: {task4(1)}')
print(f'Сумма 2х элементов: {task4(2)}')
print(f'Сумма 3х элементов: {task4(3)}')
print(f'Сумма 4х элементов: {task4(4)}')
