"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""

# на самом деле [::-1], но пусть будет как в задании)
repl_list = []

def repl(nums):
    nums = str(nums)
    if len(nums) == 1:
        repl_list.insert(0, nums)
        return "Числа закончились"
    else:
        repl_list.insert(0, nums[0])
        rep = nums.replace(nums[0], '')
        return repl(rep)

repl(123)
print(''.join(repl_list))