"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

import random


def puzzle(target, attempt=1):
    shot = int(input(f" Попытка № {attempt}. Введите число: "))
    if shot == target:
        print(f'Поздравляю, вы отгадали секретное число! Потрачено {attempt} попыток')
        return
    elif attempt > 9:
        print(f'Вы израсходовали все попытки. Число {target} не угадано!')
        return
    elif shot > target:
        print("Введённое число больше загаданного")
    else:
        print("Введённое число меньше загаданного")
    puzzle(target, attempt + 1)


input("Попробуйте отгадать случайное целое число от 0 до 100.\nВ вашем распоряжении 10 попыток.\nНажмите ввод <-")
puzzle(random.randint(0, 100))
