"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


#####################################################################
def do_it(num, tot):
    if num >= 1:
        print(f"input: {num} {tot}")
        return do_it(num - 1, tot / 2 * -1)
    else:
        return tot


#####################################################################
try:
    cnt = int(input("Введите количество элементов: "))
except ValueError:
    print("Invalid number")

xxx = do_it(cnt, 1)
print(f"Totally: {xxx}")
#####################################################################
