"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def mathematics():
    first_number = int(input("Введите первое число: "))
    second_number = int(input("Введите второе число: "))
    sign = input("Введите знак операции: ")
    if sign == "0":
        math_result = "Завершаем."
        print(math_result)
    else:
        if sign == "+":
            math_result = first_number + second_number
            print(math_result)
        elif sign == "-":
            math_result = first_number - second_number
            print(math_result)
        elif sign == "/":
            math_result = first_number - second_number
            if second_number == 0:
                math_result = "nope"
            print(math_result)
        elif sign == "*":
            math_result = first_number * second_number
            print(math_result)
        elif sign != "+" or sign != "-" or sign != "/" or sign != "*" or sign != "0":
            math_result = ("Вы ввели неверный знак. Пожалуйста, во имя Омниссии, исправьтесь")
            print(math_result)
        mathematics()


mathematics()