"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_el(n: int) -> float:
    itm = 1
    result = 0
    while n > 0:
        result += itm
        itm = -1 * itm / 2
        n -= 1
        sum_el(n)
    return result


num = int(input('Введите число: '))
print(sum_el(num))
