"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
import random


def guess(random_number, count=10):
    count -= 1
    ans = int(input('Введите целое число от 0 до 100: '))
    if ans == random_number:
        print('Вы отгадали!')
    elif count == 0:
        print(f'Попытки закончились! Загаданное число - {random_number}')
    else:
        print('Загаданное число меньше!') if ans > random_number else print('Загаданное число больше!')
        guess(random_number, count)


guess(random.randint(0, 100))