"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_elem(result=1, n=input('Введите количество элементов: ')):
    try:
        n = int(n)
        if n <= 0:
            print('Вы ввели недопустимое количество элементов! Попробуйте ещё раз')
            return sum_elem(result=1, n=input('Введите количество элементов: '))
        elif n == 1:
            return print(result)
        return sum_elem(result+(-0.5)**(n-1), n-1)
    except ValueError:
        print('Количество элементов должно быть положительным, целым числом!')
        return sum_elem(result=1, n=input('Введите количество элементов: '))


sum_elem()
