"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75(?)

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_elem(n: int) -> int:
    return (1 / ((-2) ** (n - 1)) if n > 1 else 0) + sum_elem(n-1) if n else 1


if __name__ == '__main__':
    a = int(input('Введите количество элементов: '))
    print(f'Количество элементов - {a}, их сумма - {sum_elem(a)}')
