from decimal import *
"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def input_str():                                        # функция ввода элементов
    n = int(input('Введите количество элементов: '))
    row = input().split()                               # ряд введенных элементов
    return sum_numbers(row, n)


def sum_numbers(row, n, summ=0):                        # функция нахождения суммы
    if len(row) == 0:                                   # условие завершения рекурсии
        return f'Количество элементов - {n}, их сумма - {summ}'
    else:
        summ += Decimal(row[0])                         # пополнение счетчика суммы
        return sum_numbers(row[1:n], n, summ)           # рекурсивный вызов ф-ии нахождения суммы


print(input_str())