"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def prove(n, y=0, sum1=0):
    if n == 0:
        sum2 = y * (y + 1) / 2
        return print(f"Сумма {sum1} формула {sum2}")
    else:
        y += 1
        sum1 = sum1 + n
        n -= 1
        return prove(n, y, sum1)


prove(4)
