"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


def recursive_num(num, string):
    if num > 0:
        number = num % 10
        string += str(number)
        recursive_num(num // 10, string)
    else:
        print(string)
        return


try:
    number_from_input = int(input('Введите число, которое требуется перевернуть:'))
    recursive_num(number_from_input, '')
except ValueError:
    print('Вы ввели не число!')
