"""
2.	Посчитать четные и нечетные цифры введенного натурального числа.
Например, если введено число 34560, то у него 3 четные цифры
(4, 6 и 0) и 2 нечетные (3 и 5).

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
и смотреть является ли она четной или нечетной. При этом увеличиваем соответствующий счетчик
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число: 123
Количество четных и нечетных цифр в числе равно: (1, 2)
"""

chet: int = 0
nechet: int = 0


def counter(i: str):
    global chet, nechet
    n = int(i[0])
    if n % 2 == 0:
        chet += 1
    else:
        nechet += 1
    if len(i) == 1:
        pass
    else:
        counter(i[1:])


try:
    user_n = int(input('Введите число: '))
    counter(str(user_n))
    print('Количество четных и нечетных цифр в числе равно: ({}, {})'.format(chet, nechet))
except ValueError:
    print('введена строка !')
