"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def hard_func(numb, n = 1.0):
    if numb == 1:
        return n
    return hard_func(numb - 1, (-n) / 2) + n

if __name__ == '__main__':
    a = 3
    print(hard_func(a))