"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
import random


def game(z, i):
    x = int(input("отгадайте число"))
    if x > 100 or x < 0:
        return "введите 0 до 100"
    if i > 10:
        return "ваши попытки закончились загаданное число ", z
    else:
        if x == z:
            return "вы угадали"

        elif x < z:
            print("ваше число меньше загаданного")
        else:
            print("ваше число больше загаданного")
        return game(z, i + 1)


z = random.randint(0, 100)
print(game(z, i=0))