"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
import random


def game_ugadaika(num, n=9):
    user_answer = int(input('Попробуйте отгадать число: '))
    if n == 0:
        return f'Вы проиграли. У вас не осталось попыток. Правильный отве: {num}'
    elif user_answer == num:
        return f'Поздравляю вы отгадали!'
    else:
        if user_answer > num:
            print('Загаданное число меньше')
        else:
            print('Загаданное число больше')
        return game_ugadaika(num, n - 1)


number = random.randint(0, 100)
# print(number)
print(game_ugadaika(number))
