"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def series_sum(number, item):
    """
    Возвращает сумму n элементов ряда чисел: 1 -0.5 0.25 -0.125 ...

    num: кол-во элементов ряда
    """
    number -= 1
    if number == 0:
        return item
    else:
        return item + series_sum(number, (item / -2))


print(f'Сумма равна = {series_sum(int(input("Введите кол-во элементов: ")), 1)}')

