"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def rec_calc():
    request = input("Enter '+', '-', '*', '/' to calculate. Or enter '0' to exit: \n")
    operation = '+-*/'
    if request == '0':  # условие завершения
        print('The program is stopped')
    else:  # иначе делаем и опять запускаем
        if request in operation:
            val_1 = int(input('Enter first value: '))
            val_2 = int(input('Enter second value: '))

            if request == '+':
                print(f'Result: {val_1 + val_2}')
                rec_calc()
            elif request == '-':
                print(f'Result: {val_1 - val_2}')
                rec_calc()
            elif request == '*':
                print(f'Result: {val_1 * val_2}')
                rec_calc()
            elif request == '/':
                if val_2 != 0:
                    print(f'Result: {val_1 / val_2}')
                    rec_calc()
                else:
                    print('Division by zero is not possible. Try again')
                    rec_calc()
            else:
                print('Error. Check the entered value')
                return rec_calc()
        else:
            print('Error. Check the entered operation')
            return rec_calc()

rec_calc()
