"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def check(n: int):
    if n == 1:
        return True
    else:
        return (check(n - 1)) and (sum(range(1,n+1)) == n * (n + 1) / 2)


print(check(50))
