"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def row_sum(number):
    if number == 1:
        return 1
    return row_sum(number - 1) + number


try:
    a = int(input('Введите число: '))
except ValueError:
    print('Ошибка ввода')
else:
    print(f'Сумма, вычисленная по формуле = {(a * (a + 1) / 2):.0f}\nСумма ряда, вычисленная рекурсивно = {row_sum(a)}')
