"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3 1.5 -075
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_elements(n, element=1, sum_numb=0):
    if n == 0:
        print(sum_numb)
        return
    sum_numb += element
    sum_elements(n - 1, element / -2, sum_numb)
    return


sum_elements(int(input("Введите количество элементов: ")))
