"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

def rec_sum(n, s_num = [1]):
    """ Считает сумму n элементов ряда """
    if n > 1 :
        s_num.append(s_num[-1] / (-2))
        n -= 1
        return rec_sum(n, s_num)
    else:
        return sum(s_num)

    return

def user_pol():
    """ Взаимодействие с пользователем. Вывод результатов"""
    n = int(input("Введите количество элементов ряда \n"))

    print('Количество элементов: ', n, ', Их сумма: ', rec_sum(n))
    return


if __name__ == '__main__':
    user_pol()