"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


from random import randint


def guess(number, attempts):
    if attempts == 0:
        print("Слишком много попыток, это было число ", number)
        return -1
    n = int(input("> "))
    if n == number:
        print("Да!")
        return 0
    print("Меньше..." if n > number else "Больше...")
    return guess(number, attempts-1)


print("Угадайте целое число от 0 до 100")
guess(randint(0, 100), 10)
