"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def get_num1():
    try:
        return float(input("Введите первое число >>>"))
    except ValueError:
        return 'str'


def get_num2():
    try:
        return float(input("Введите второе число >>>"))
    except ValueError:
        return 'str'


def rec_calc(char):
    if char == '0':
        return
    elif char == '+':
        num1 = get_num1()
        if num1 == 'str':
            rec_calc(input("Введите операцию (+, -, *, / или 0 для выхода) >>>"))
        num2 = get_num2()
        if num2 == 'str':
            rec_calc(input("Введите операцию (+, -, *, / или 0 для выхода) >>>"))
        print(f"{num1} + {num2} = {num1 + num2}")
    elif char == '-':
        num1 = get_num1()
        if num1 == 'str':
            rec_calc(input("Введите операцию (+, -, *, / или 0 для выхода) >>>"))
        num2 = get_num2()
        if num2 == 'str':
            rec_calc(input("Введите операцию (+, -, *, / или 0 для выхода) >>>"))
        print(f"{num1} - {num2} = {num1 - num2}")
    elif char == '*':
        num1 = get_num1()
        if num1 == 'str':
            rec_calc(input("Введите операцию (+, -, *, / или 0 для выхода) >>>"))
        num2 = get_num2()
        if num2 == 'str':
            rec_calc(input("Введите операцию (+, -, *, / или 0 для выхода) >>>"))
        print(f"{num1} * {num2} = {num1 * num2}")
    elif char == '/':
        num1 = get_num1()
        if num1 == 'str':
            rec_calc(input("Введите операцию (+, -, *, / или 0 для выхода) >>>"))
        num2 = get_num2()
        if num2 == 'str':
            rec_calc(input("Введите операцию (+, -, *, / или 0 для выхода) >>>"))
        elif num2 == float(0):
            print("На 0 делить нельзя")
            rec_calc(input("Введите операцию (+, -, *, / или 0 для выхода) >>>"))
        print(f"{num1} / {num2} = {num1 / num2}")
    else:
        print("(не '0', '+', '-', '*', '/'),")
        rec_calc(input("Введите операцию (+, -, *, / или 0 для выхода) >>>"))
    rec_calc(input("Введите операцию (+, -, *, / или 0 для выхода) >>>"))


rec_calc(input("Введите операцию (+, -, *, / или 0 для выхода >>>"))
