"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def decay(n, cnt=0, num=1.0, total=0.0):
    if cnt == n:
        print(f'Количество элементов : {n} их сумма : {total}')
    elif cnt < n:
        print(f' n = {n}, cnt = {cnt}, num = {num}, total = {total}')
        return decay(n, cnt + 1, num / 2 * -1, total+num)


decay(int(input('Введите количество элементов: ')))
