"""
2.	Посчитать четные и нечетные цифры введенного натурального числа.
Например, если введено число 34560, то у него 3 четные цифры
(4, 6 и 0) и 2 нечетные (3 и 5).

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
и смотреть является ли она четной или нечетной. При этом увеличиваем соответствующий счетчик
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число: 123
Количество четных и нечетных цифр в числе равно: (1, 2)
"""


def my_func(numb, even=0, odd=0):
    if numb == '':
        return print(f"Количество четных и нечетных цифр в числе равно: ({even}, {odd})")
    else:
        numb_str = str(numb)
        search_numb = int(numb_str[0]) % 2
        if search_numb > 0:
            odd += 1
            return my_func(numb_str[1:], even, odd)
        else:
            even += 1
            return my_func(numb_str[1:], even, odd)


# Проверку на нечисло вводить не стал так как в задании не написано

my_func(int(input("Введите число: ")))
