"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""
def natural_input():
    __natural = input('Введите число натуральное число: ')
    try:
        int(__natural)
        return __natural
    except:
        print('Вы ввели не число')
        return natural_input()

def reverse_number(number, reverse=''):
    if len(number) == 0:
        print(f'Перевернутое число: {reverse}')
    else:
        reverse_number(number[:(len(number)-1)],reverse+(number[len(number)-1]))

reverse_number(natural_input())