"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def trm(n, sum_n=0):
    if n == 0:
        return sum_n
    else:
        m = n
        return trm(n - 1, sum_n + m)


def dok(k):
    if trm(k) == k * (k+1) / 2:
        return True
    else:
        return False


print(dok(5))

