"""
2.	Посчитать четные и нечетные цифры введенного натурального числа.
Например, если введено число 34560, то у него 3 четные цифры
(4, 6 и 0) и 2 нечетные (3 и 5).

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
и смотреть является ли она четной или нечетной. При этом увеличиваем соответствующий счетчик
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число: 123
Количество четных и нечетных цифр в числе равно: (1, 2)
"""

def chet_nechet(n, i, j):
    if n == 0:
        return i, j
    else:
        if n % 2 == 0:
            return chet_nechet(n // 10, i + 1, j)
        else:
            return chet_nechet(n // 10, i, j + 1)


num = int(input('Введите число: '))
print('Количество четных и нечетных цифр в числе равно: ', chet_nechet(num, 0, 0))