"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


def reverse_number(input_number, reversed_number=0):
    if input_number == 0:
        return reversed_number
    else:
        reversed_number = (reversed_number * 10) + (input_number % 10)
        input_number = input_number // 10
        return reverse_number(input_number, reversed_number)


if __name__ == '__main__':
    try:
        user_number = int(input('Введите число: '))
        print(f'Перевернутое число = {reverse_number(user_number)}')
    except:
        print('Ошибка. Введено не натуральное число.')
