"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


def reserse_number(num: int):
    """Формирует из введенного числа обратное по порядку входящих в него цифр"""

    if num // 10 > 0:
        # Цифры еще есть, продолжаем рекурсию
        res = reserse_number(num // 10)
    else:
        # Последняя цифра
        res = ""

    # Возвращаем в обратном порядке
    res = str(num % 10) + res

    return res


print("Перевернутое число: ", reserse_number(int(input("Введите число: "))))
