"""
2.	Посчитать четные и нечетные цифры введенного натурального числа.
Например, если введено число 34560, то у него 3 четные цифры
(4, 6 и 0) и 2 нечетные (3 и 5).

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
и смотреть является ли она четной или нечетной. При этом увеличиваем соответствующий счетчик
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число: 123
Количество четных и нечетных цифр в числе равно: (1, 2)
"""


def digit_counter(num, even, odd):
    if num < 10:
        if (num % 10) % 2 == 1:
            even += 1
        else:
            odd += 1
        return print(f'Всего в числе {even} нечётных цифр и {odd} чётных.')
    else:
        if (num % 10) % 2 == 1:
            even += 1
        else:
            odd += 1
        return digit_counter(num // 10, even, odd)


digit_counter(int(input('Введите число: ')), 0, 0)
