"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


def input_str():
    reverse_str = ''
    numbers = input('Введите число, которое требуется перевернуть: ')
    return reverse(numbers, reverse_str)


def reverse(numbers, reverse_str):
    if len(numbers) == 0:                               # условие завершения рекурсии
        return f'Перевернутое число: {reverse_str}'     # вывод перевернутой строки
    else:
        reverse_str += numbers[-1]                      # запись символа в конец новой строки
        return reverse(numbers[:-1], reverse_str)       # рекурсивный вызов ф-ии (не включая правую границу
                                                        # исходной строки)


print(input_str())