"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""

#import re

def calc ():
    num = input('Введите выражение или 0 для выхода: ')
    if num == '0':
       return 'Конец'
    else:
        # for i in num:  # list_= re.split('(\W)', num)
        #     if not i.isdigit() and  i not in ['+', '-', '*', '/']:
        #         print ('Выражение некорректно')
        try:
            print (f'Результат: {eval(num)}')
        except ZeroDivisionError:
            print ('Делить на 0 в поле вещественных чисел нельзя!')
        except SyntaxError:
            print ('Невыполнимое арифметическое действие')
        except NameError:
            print('Выражение некорректно')
    return calc()
calc()
