def calcul():
    """
    Функция не принимат значений на вход. Внутри она содержит фунции приема и валидации чисел
    num1() и num2(), а также фунцию action() ввода арифметической операции или, для окончания работы 0.
    """


    def num1():
        '''
        Ввод и валидация числа, должен быть int
        '''
        try:
            x = input('Введите первое число=>')
            return int(x)
        except:
            print('Вы ошиблись и  ввели не число.')
            return num1()


    def num2():
        '''
           Ввод и валидация числа, должен быть int
        '''
        try:
            y = input('Введите второе число=>')
            return int(y)
        except:
            print('Вы ошиблись и  ввели не число.')
            return num2()


    def action():
        '''
           Ввод и валидация операции, должена быть из указанных в списке, если 0 , то окончание работы.
        '''
        oper = input('Введите операцию ( +, -, *, / или 0 для выхода=>')
        if oper == '0':
            print('Вы ввели 0 и вышли из программы')
            return 'stop'
        elif '+-*/'.find(oper) == -1:
            print('Вы ошиблись, поддерживаемые оперции + , - , * и /.')
            action()
        else:
            return oper


    def calc(x, y, oper):
        '''
           Функция принимает значения x, y b oper т.е. перво и второе число и вид арифметической операции между ними.
        '''
        if oper == '+':
            res = x + y
            print(f'Сумма {x} и {y} составит {res}.')
        elif oper == '-':
            res = x - y
            print(f'Разность {x} и {y} составит {res}.')
        elif oper == '*':
            res = x * y
            print(f'Произведение {x} и {y} составит {res}.')
        elif oper == '/':
            res = x / y
            print(f'Результат деления  {x} на {y} составит {res}.')

    x = num1()  # Получаем первое число
    y = num2()  # Получаем второе число
    work = action()  # Получаем вид арифметической операции
    if work == 'stop':  # Проверяем, если stop то, прекращение работы.
        return
    else:
        calc(x, y, work)  # Передаем данные в фунцию для расчета.
    calcul()  # Запуск с началаи до тех пор , пока не будет введен 0 (wokr !=0).


calcul()
