"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""

def just_calc():

    opers = ['+', '-', '*', '/']

    user_oper = input('Введите операцию (+, -, *, / или 0 для выхода): ')
    if user_oper == '0':
        return True
    if list(set(user_oper) & set(opers)) == []:
        print('Некорректная операция')
        return just_calc()

    try:
        user_fisrt_numb = int(input('Введите первое число: '))
        user_second_numb = int(input('Введите второе число: '))
    except ValueError:
        print('Вы вместо трехзначного числа ввели строку (((. Исправьтесь')
        return just_calc()

    if user_oper == '+':
        output = user_fisrt_numb + user_second_numb
        print('= ', output)
    elif user_oper == '-':
        output = user_fisrt_numb - user_second_numb
        print('= ', output)
    elif user_oper == '*':
        output = user_fisrt_numb * user_second_numb
        print('= ', output)
    elif user_oper == '/':
        output = user_fisrt_numb / user_second_numb
        print('= ', output)

    print('Ещё один круг')
    return just_calc()

if __name__ == '__main__':
    print('Hi!')
    just_calc()
    print('Bay!')

