"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
import random


# Не уверен, что это правильный подход, за комменты, как решить без такого кол-ва переменных буду благодарен
def guess(answer, first, num, count):
    if first:
        num = random.randint(0, 100)
        count = 0
        first = False
    if answer == num:
        return print('Поздравляем с победой!!')
    elif count == 10:
        return print('Вы исчерпали свои попытки.')
    else:
        if answer > num:
            print('Бери меньше)')
        else:
            print('Бери больше)')
        count += 1
        return guess(int(input(f'Осталось {10 - count} попыток, твоя следующая догадка? ')), first, num, count)


guess(int(input('Я загадал число от 0 до 100, попробуй его угадать за 10 попыток, твоя первая догадка: ')), True, 0,
      0)
