"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def rec_calculator():
    operation = input('Введите операцию (+, -, *, / или 0 для выхода): ')

    if operation == '0':
        print('Выход из программы')

    else:
        if operation in '+-*/':
            try:
                nuber_1 = int(input('Введите первое чиисло: '))
                nuber_2 = int(input('Введите второе чиисло: '))

                if operation == '+':
                    result = nuber_1 + nuber_2
                    print(f'Сумма = {result}')

                elif operation == '-':
                    result = nuber_1 - nuber_2
                    print(f'Разница = {result}')

                elif operation == '*':
                    result = nuber_1 * nuber_2
                    print(f'Произведение = {result}')

                elif operation == '/':
                    if nuber_2 == 0:
                        print('ОШИБКА!: Деление на 0')
                    else:
                        result = nuber_1 / nuber_2
                        print(f'Частное = {result}')

                else:
                    print(f'ОШИБКА!: Непредвиденная ситуация')

            except ValueError:
                print('Вы вместо трехзначного числа ввели строку (((. Исправьтесь')

        else:
            print('Введена некорректная операция')

        return rec_calculator()


rec_calculator()
