"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""

def calc():
	try:
		a = float(input('Введите первое число: '))
		b = float(input('Введите второе число: '))
		sign = input('Введите операцию или 0 для выхода: ')	
	except ValueError:
		print('Необходимо ввести число \n')
		return calc()
		
	if sign == '0':
		return
	else: 			
		if sign == '+':
			print(f"Ваш результат {a + b}")
			return calc() 
		elif sign == '-':
			print(f"Ваш результат {a - b}")
			return calc()
		elif sign == '*':
			print(f"Ваш результат {a * b}")
			return calc()		
		elif sign == '/':
			if b == 0:
				print('Деление на ноль запрещено')
				return calc()
			else:
				print(f"Ваш результат {a / b}")
				return calc()
		else:
			print("Допускаются операции + - * / или 0 для выхода")
			return calc()
		
		
calc()	
