"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def addition(num1, num2):
    return num1 + num2


def subtraction(num1, num2):
    return num1 - num2


def multiplication(num1, num2):
    return num1 * num2


def division(num1, num2):
    return num1 / num2


def calc():
    user_num_1 = input('Введите первое число')
    user_num_2 = input('Введите второе число')
    user_op = input('Введите операцию (+, -, *, / или 0 для выхода)')

    if ((user_num_1.isdigit()) and (user_num_2.isdigit())) != True:
        print('введите число')
    else:
        if user_op == '+':
            print(addition(user_num_1, user_num_2))
        elif user_op == '-':
            print(subtraction(user_num_1, user_num_2))
        elif user_op == '*':
            print(multiplication(user_num_1, user_num_2))
        elif user_op == '/':
            if user_num_2 == 0:
                print('введен 0 в качестве делителя')
            else:
                print(division(user_num_1, user_num_2))
        elif user_op == '0':
            print('выход')
        else:
            print('неизвестная операция')
    if user_op != '0': calc()
    return


calc()
