"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def rec_calc(operation):
    if operation == '0':
        print('Работа завершена')
        return
    if operation in '+-*/':
        try:
            num1 = float(input('Введите число первое число: '))
            num2 = float(input('Введите число второе число: '))
            if operation == '/' and num2 == 0:
                raise ZeroDivisionError
        except ValueError:
            print('Ошибка ввода.')
            rec_calc(operation)
            return
        except ZeroDivisionError:
            print('Ошибка ввода. На ноль делить нельзя.')
            rec_calc(operation)
            return
        else:
            if operation == '+':
                print(f'{num1} + {num2} = {num1 + num2}')
            elif operation == '-':
                print(f'{num1} - {num2} = {num1 - num2}')
            elif operation == '*':
                print(f'{num1} * {num2} = {num1 * num2}')
            elif operation == '/':
                print(f'{num1} / {num2} = {num1 / num2}')

    operation = input('Введите операцию (+, -, *, / или 0 для выхода): ')
    if operation not in '+-*/0':
        print('Ошибка ввода')
    rec_calc(operation)


rec_calc('start')
