"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def set_check(n, left=0, right=1):
    if left == right:
        print(f'Равенство верно')
    elif left < right:
        return set_check(n, left + 1, n * (n + 1) // 2)


user_input = int(input('Введите число: '))
set_check(user_input)
