"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def my_function(num, count, summary=0):
    count = int(count) - 1
    if count == 0:
        print(summary)
    else:
        summary = summary + num[count]
        my_function(num, count, summary)


my_function([1, -0.5, 0.25, -0.125], "3")

