"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum(x, deep):
    '''
    Функция принимает два значения х, число начиная с которого, пойдет отсчет
    и depp, это глубина рекурсии
    '''
    if deep == 1:
        return x
    y = x / -2
    return x + sum(y, deep - 1)


x = int(input('Введите глубину рекурсии=>'))
print('Сумма равна : ', sum(1, x))
