"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

import random


def guess(num=random.randint(0, 100), count=1) -> str:
    user_number = int(input(f'Попытка номер {count}. Введите число: '))
    if user_number > num:
        print('Ваше число больше загаданного!')
    if user_number < num:
        print('Ваше число меньше загаданного!')
    count += 1
    return (guess(num, count) if count <= 10 else 'Попытки закончились!') if user_number != num else 'Вы угадали!'


if __name__ == '__main__':
    print(guess())
