"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


def reverse_number(my_list, rev_num=None):
    if rev_num is None:
        rev_num = []
    if len(my_list) == 0:
        new_num = ''.join(rev_num)
        return new_num
    else:
        rev_num.append(my_list.pop())
        return reverse_number(my_list, rev_num)


print(reverse_number(list(input('Введите номер, который требуется перевернуть '))))
