"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
import random

n = random.randint(0, 100)


def fun(i=0):
    if i == 5:
        print(f'Количество попыток исчерпано! Было загадано число {n}.')
        return
    user_number = int(input('Введите число:   '))
    if n == user_number:
        print(f'Вы угадали, загаданное число - {n}')
    elif n < user_number:
        print(f'Заданное число меньше, чем то, что вы написали.')
        fun(i+1)
    else:
        print(f'Заданное число больше, чем то, что вы написали.')
        fun(i+1)


fun()

