"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_number(a):
    if a == 1:
        return 1
    return a + sum_number(a-1)


n = int(input('Введите натуральное число: '))

if sum_number(n) == n*(n+1)/2:
    print('Верно')
else:
    print('Не верно')
