"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.
 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

n = int(input('Введите значение n:   '))


def fun(i):
    if i == 0:
        return 0
    return i + fun(i-1)


m = int(n * (n + 1) / 2)
print(f'Значение функции 1+2+...+n, где n = {n} равно {fun(n)}. '
      f'Что также равно функции n(n+1)/2 - {m}. Равенство выполняется!')