"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""

def calcula_tor():
    sign = input('Enter sign *, /, +, - or 0 to exit: ')
    if sign == '0':
        print(f'exit')
        return calcula_tor()
    elif sign not in ("+", "-", "*", "/", "0"):
        print('Wrong value. Please, enter correct value')
        return calcula_tor()
    else:
        try:
            numb1 = float(input('Enter 1-st number: '))
            numb2 = float(input('Enter 2-nd number: '))
        except ValueError:
            print('Вы вместо числа ввели строку (((. Исправьтесь')
            return calcula_tor()
    if sign == '*':
        print(f'Result: {numb1 * numb2}')
        return calcula_tor()
    elif sign == '/':
        print(f'Result: {numb1 / numb2}')
        return calcula_tor() 
    elif sign == '+':
        print(f'Result: {numb1 + numb2}')
        return calcula_tor()
    elif sign == '-':
        print(f'Result: {numb1 - numb2}')
        return calcula_tor()
    
print(calcula_tor())
