"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""

def revers(num_string):

    if len(num_string) == 1:
        return num_string[-1]
    else:
        return num_string[-1] + revers(num_string[:-1])


number = input('Введите число, которое требуется перевернуть: ')

if number.isdigit():
    print(f'Перевернутое число: {revers(number)}')
else:
    print(f'Введены некорректные данные')

