"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


num = 12
def guess(num,iter = 0):
    user_num = int(input('Введите число'))
    if user_num == num:
        return print( "Вы угадали")
    if iter == 9:
        return print("У вас закончились попытки")
    if user_num > num:
        print( "Вы ввели слишком большое число")
        iter += 1
        return guess(num, iter)
    if user_num < num:
        print ('Вы ввели слишком маленько число')
        iter += 1
        return guess(num,iter)


guess(12)