"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_num(n):
    if n == 1:
        return 1
    return n + sum_num(n-1)


def form(n):
    return n * (n + 1) / 2


num = 5
print(sum_num(num) == form(num))
