"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

def sum_rec(n):
    if n == 1:
        return 1
    return n + sum_rec(n-1)

def sum_f(n):
    return int(n * (n+1) /2)

print( f"Для n = 5 Сумма рассчитанная рекурсией - {sum_rec(5)}, формулой - {sum_f(5)}")
print (f"Для n = 10 Сумма рассчитанная рекурсией - {sum_rec(10)}, формулой - {sum_f(10)}")
print (f"Для n = 15 Сумма рассчитанная рекурсией - {sum_rec(15)}, формулой - {sum_f(15)}")