"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""
def rec_numb(numb,res = []):
    numb = list(numb)
    if numb == []:
        res = ''.join(res)
        return print('Перевернутое число: ', res)
    res.append(numb[-1])
    return rec_numb(numb[:-1], res)


a = input('Введите число, которое требуется перевернуть: ')
rec_numb(a)