"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
from random import randint, seed


def task6(n, i=1):
    if i > 10:
        return f'Вы не справились! Загаданное число - {n}'

    cur_n = int(input(f'Попытка №{i}. Введите число: '))
    if cur_n < n:
        print('Не верно, загаданное число больше!')
        # return task6(n, i + 1)
    elif cur_n > n:
        print('Не верно, загаданное число меньше!')
        # return task6(n, i+1)
    else:
        return f'Вы угадали за {i} ходов!'
    return task6(n, i+1)


seed()
r = randint(0, 100)
print(task6(r))
