"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""

reverse=''


def reverser(i: str):
    global reverse
    n = int(i[-1])
    reverse = reverse + str(n)
    if len(i) == 1:
        pass
    else:
        reverser(i[:-1])


try:
    user_n = int(input('Введите число, которое требуется перевернуть: '))
    reverser(str(user_n))
    print(reverse)
except ValueError:
    print('введена строка !')