"""
2.	Посчитать четные и нечетные цифры введенного натурального числа.
Например, если введено число 34560, то у него 3 четные цифры
(4, 6 и 0) и 2 нечетные (3 и 5).

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
и смотреть является ли она четной или нечетной. При этом увеличиваем соответствующий счетчик
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число: 123
Количество четных и нечетных цифр в числе равно: (1, 2)
"""

def chet_nechet(x, cht =0, ncht=0):
    '''
    :param x: переворачиваемое число int
    :param cht: счетчик четных цифр
    :param ncht: счетчик нечетных цифр
    '''
    i = 0
    try:
        x = str(x)
    except:
        x = x
    if int(x[i]) % 2 == 0:
        cht += 1
    else:
        ncht += 1
    if len(x) == 1:
        print(f'В введеном вами числе {cht} четные и {ncht} нечетных цифры')
        return 12
    else:
        chet_nechet(int(x[i + 1:]), cht, ncht)


print(chet_nechet(1115222))
