"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


# Вспомогательная функция для получения данных от пользователя
def get_data_from_user():
    def get_num(name='первое'):
        while True:
            try:
                ans = float(input(f'Введите {str(name)} число: '))
            except ValueError:
                print('Вы ввели не число!')
                ans = None
            if type(ans) == float:
                return ans

    op = None
    while op not in ('+', '-', '*', '/', '0'):
        op = input('Введите арифметическую операцию (+ - * /) или 0 для выхода: ')
    if op == '0':
        return op, None, None
    num1 = get_num('первое')
    while True:
        num2 = get_num('второе')
        if op == '/' and num2 == 0:
            print('На 0 делить нельзя!')
        else:
            return op, num1, num2


# Рекурсия
def my_calc(op, num1, num2):
    if op == '+':
        print(f'Ваш результат: {num1 + num2}')
    elif op == '-':
        print(f'Ваш результат: {num1 - num2}')
    elif op == '*':
        print(f'Ваш результат: {num1 * num2}')
    elif op == '/':
        print(f'Ваш результат: {num1 / num2}')
    else:
        return
    (a1, a2, a3) = get_data_from_user()
    return my_calc(a1, a2, a3)


(arg1, arg2, arg3) = get_data_from_user()
my_calc(arg1, arg2, arg3)
