"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""


def canculator():
    res = 0
    a = int(input("Введите первое число"))
    if type(a) != int:
        print("Вы ввели число. Исправьтесь")
    b = int(input("Введите второе число"))
    if type(b) != int:
        print("Вы ввели число.Исправьтесь")
    oper = input("Введите операцию (+, -, *, / или 0 для выхода)")
    if oper == "0":
        print("Вы вышли из программы")
    elif oper not in ('0', '+', '-', '*', '/'):
        print('неверный знак')
        return canculator()
    elif oper == '/' and b == 0:
        print('Division by ZERO')
        return canculator()
    else:
        if oper == "+":
            res = a + b
        if oper == "-":
            res = (a-b)
        if oper == "*":
            res = a * b
        if oper == "/":
            res = (a/b)
        print(f'Текущий результат равен :{res}')
    return(canculator())


canculator()
