"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_range(a):
    if not a:
        return 0
    elif a % 2 == 0:
        return sum_range(a - 1) - 1 / 2 ** (a - 1)
    else:
        return sum_range(a - 1) + 1 / 2 ** (a - 1)


n = int(input('Введите количество элементов: '))
print(f'Количество элементов - {n}, их сумма = {sum_range(n)}')

