"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
def equation_check(n, sum, i):
    if n == 0:
        return f'Сумма введенных чисел: {sum}, ' \
               f'результат равенства n * (n + 1) / 2 = {i * (i + 1) / 2}'
    else:
        return equation_check(n - 1, sum + n, i + 1)

print(equation_check(int(input('Введите любое число n = ')), 0, 0))
