"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
from random import randint


def guess_number_game(num_game, i):
    """
    Игра угадайка.
    Программа генерирует случейное число в диапазоне от 0 до 100,
    пользователь пытается отгадать загаданное число за 10 попыток!

    num_game: загаданное число
    i: кол-во попыток
    """

    # За основу брал идеальные условия, когда пользователь послушный и вводит то, что его просят
    num_user = int(input('Введите число от 0 до 100: '))
    if num_user == num_game:
        print(f'Правильно это число {num_game}!')
    elif i == 0:
        print(f'Вы не молодец, правильное число -  {num_game}!')
    else:
        if num_user > num_game:
            print(f'Введенное число БОЛЬШЕ загаданного\n' + '-'*35 + '\n')
        else:
            print(f'Введенное число МЕНЬШЕ загаданного\n' + '-'*35 + '\n')
        return guess_number_game(num_game, i-1)


guess_number_game(randint(0, 101), 10)
