"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
import random

def guess_number(i_try, i_rand_num):
    if i_try < 1:
        return

    l_user_num = int(input('Введите число: '))

    if l_user_num == i_rand_num:
        print('Ура! Вы отгадали число!')
        return

    if(l_user_num < i_rand_num):
        print('Введенное число меньше загадонного.')
    else:
        print('Введенное число больше загадонного.')

    return guess_number(i_try-1, i_rand_num)


g_rand_num = random.randint(0, 100)
guess_number(10, g_rand_num)
