"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
Рекурсия вам нужна для решения левой части выражения.
Полученный результат нужно просто сравнить с результатом в правой.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
В ф-цию принимаются два элемент - это левая и правая части

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def nsum(num, result):

    result += num
    num -= 1
    if num == 0:
        return result

    return nsum(num, result)


try:
    number = int(input("Введите число для которого мы будем проверять истинность данного выражения: "))
except ValueError:
    print("Некорректное число")
    exit()

yes_no = {True: "Да", False: "Нет"}

checker = (int(number*(number + 1)/2) == nsum(number, 0))

print(f" Верно ли выражение? {yes_no[checker]}")
