"""
2.	Посчитать четные и нечетные цифры введенного натурального числа.
Например, если введено число 34560, то у него 3 четные цифры
(4, 6 и 0) и 2 нечетные (3 и 5).

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
и смотреть является ли она четной или нечетной. При этом увеличиваем соответствующий счетчик
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число: 123
Количество четных и нечетных цифр в числе равно: (1, 2)
"""

# Решил сделать задание с использованием списка. Надеюсь это не снизит оценку)
def counter(list, even=0, odd=0):
    if len(list) ==0:
        return even, odd
    else:
        a = list.pop(0)
        if a % 2 == 0:
            even += 1
            return counter(list, even,odd)
        else:
            if a % 2 == 1:
                odd += 1
                return counter(list, even, odd)

list = [5,6,7,5,9,7]
print(counter(list))


