"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


def rec(num):
    mul = pow(10, len(str(num)) - 1)
    if len(str(num)) == 1:
        return num
    else:
        dig = num % 10
        return dig * mul + rec(num // 10)


if __name__ == '__main__':
    while True:
        num = input('Введите число: ')
        if num.isdigit():
            num = int(num)
            break
        else:
            print('Повторите попытку')

    print(f'Перевернутое число: {rec(num)}')
