"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_numb(start, stop):
    """
    Функция возвращает сумму от 1+2+...+n

    start: Начало отчета == 1
    stop: Конец ряда чисел == n
    """
    if start == stop:
        return start
    else:
        return start + sum_numb(start + 1, stop)


n = int(input('Введите n: '))
if sum_numb(1, n) == n*(n+1)/2:
    print(f'1+2+...+n = n(n+1)/2 - равенство выполняется!')
else:
    print(f'1+2+...+n = n(n+1)/2 - равенство НЕ выполняется!')
