"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


def reverse(string):
    if len(string) == 1:
        return int(string) // (10 ** (len(string) - 1))
    return str(reverse(string[1:])) + str(int(string) // (10 ** (len(string) - 1)))


while True:
    data = input('Введите число, которое требуется перевернуть: ')
    if data.isdigit():
        break
    else:
        print('Введите число!!!')

print(f'Перевернутое число: {reverse(data)}')
