"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Ряд строить программно - в самой же рекурсивной ф-ции
или даже обойтисть без создания ряда

Элемент в 2 раза меньше предыд и имеет противопол знак
"""


def func(count, summ=0, start=1, size=0):
    if size == 0:
        size = count
    if count == 0:
        return f'Количество элементов - {size}, их сумма -  {summ}'
    else:
        summ += start
        return func(count - 1, summ, start / 2 * (-1), size)


print(func(int(input('Введите количество элементов: '))))
