"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_elem(number, res=1, summ=1):
    if number < 2:
        return summ
    else:
        number -= 1
        res = res / -2
        summ = summ + res
        return sum_elem(number, res, summ)


try:
    numbers = int(input('Введите количество элементов: '))
    if numbers == 0:
        print('Сколько элементов такая и сумма)))')
    else:
        print(f'Количество элементов - {numbers}, их сумма - {sum_elem(numbers)}')
except ValueError:
    print('Вы ввели не число. Исправтесь')
