"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, /
- условие завершения рекурсии - введена операция 0

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""

def task_1():
    """
        Функция производит математическое действие, выбранное пользователем.
        o - exit.
        # есть недоработки, исключаются try / exept ValueError
    """
    symbols = ['+', '-', '*', '/', 'o']
    znak = input('enter operator from list [+, -, /, *], or "o" for finish - ')
    if znak not in symbols:
        print(f'data error!')
        task_1()
    elif znak.lower() == 'o':
        print('finish')
    else:
        a = int(input('chislo 1 - '))
        b = int(input('chislo 2 - '))
        if znak == '+':
            print(f'{a}{znak}{b}={a + b}')
        elif znak == '-':
            print(f'{a}{znak}{b}={a - b}')
        elif znak == '*':
            print(f'{a}{znak}{b}={a * b}')
        elif znak == '/':
            if b == 0:
                print(f'Data error, devision by zero!')
            else:
                print(f'{a}{znak}{b}={a / b}')
        task_1()


task_1()