"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


def inverted_num(a: str) -> None:  # Не знаю почему этот TypeHint в пайчарм нон говорит заполнить
    return print(a[::-1])


def rec_num(a:int) -> int:
    if a < 10:
        return a
    return int(str(a % 10) + str(rec_num(a // 10)))


inverted_num('15646')
print(rec_num(456487))
