"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


def inverted_i(i, n=0):
    if i == 0:
        return f'Перевернутое число: {n // 10}'
    else:
        n = (n + (i % 10)) * 10
        i = i // 10
        return inverted_i(i, n)


print(inverted_i(int(input('Введите число, которое требуется перевернуть: '))))
