"""
Задание 4.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""

# Решение 1 сложность константная

auth_dic = {'Mikeman': 'a150575',
            'Vovan': 'v123456',
            'mafiya': 'm123456',
            'katrin2002': 'k20022002',
            'hromoy': 'h987654'
            }

user = input('Введите Ваш логин: _') # константная
user_passw = input('Введите Ваш пароль: _ ') # константная
# print(auth_dic[user])

if auth_dic[user] == user_passw: # константная
    print(f'Здравствуйте, {user} ! Авторизация прошла успешно!') # константная
else:
    print(f'Вход запрещен! Неверный пароль для пользователя {user}') # константная

# Решение 2 сложность линейная
auth_list = [['Mikeman', 'a150575'],
            ['Vovan', 'v123456'],
            ['mafiya' ,'m123456'],
            ['katrin2002', 'k20022002'],
            ['hromoy', 'h987654']]
user_list = []
user = input('Введите Ваш логин: _') # константная
user_list.append(user) # константная
user_passw = input('Введите Ваш пароль: _ ') # константная
user_list.append(user_passw) # константная
if user_list in auth_list: # линейная
    print(f'Здравствуйте, {user} ! Авторизация прошла успешно!') # константная
else:
    print(f'Вход запрещен! Неверный пароль для пользователя {user}') # константная
