"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
from random import randrange, randint, random

new_list = [randrange(1, 100, randint(1, 5)) for i in range(10)]

print(new_list)

# вариант 1


def search_min(my_list):
    x = 0
    for i in range(len(my_list)):
        if my_list[i] < my_list[x]:
            x = i
    print(my_list[x])


search_min(new_list)

# вариант 2

n_min = min(el for el in new_list)
print(n_min)

# вариант 3

n_min = (sorted(new_list)[0])
print(n_min)

# вариант 4

n_min = min(new_list)
print(n_min)
