"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.
Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections
Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235
Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34
Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога
Предприятия, с прибылью ниже среднего значения: Копыта
"""

import collections
defdict = collections.defaultdict(list)
count = int(input('Введите количество предприятий для расчета прибыли:'))
count_2 = count
while count > 0:
    name = input('Введите название предприятия:')
    profit = [int(input(f'Введите прибыль данного предприятия за {b+1} квартал:')) for b in range(4)]
    defdict[name] = sum(profit)
    count -= 1

middle_all = sum(defdict.values())/count_2
defdict1 = defdict
more_middle = []
middle = []
less_middle = []

for a in defdict:
    if defdict[a] > middle_all:
        more_middle.append(a)
    elif defdict[a] < middle_all:
        less_middle.append(a)
    else:
        middle.append(a)

print(f'Предприятия, с прибылью выше среднего значения: {more_middle}\nПредприятия, с прибылью равной среднему значению: {middle}\nПредприятия, с прибылью выше среднего значения: {less_middle}')
