"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя. """


def calc():
    operand = input("Введите операцию (+, -, *, / или 0 для выхода): ")

    if operand == '0':
        return print("Вы вышли из калькулятора")

    if operand in "+-*/":
        try:
            num1 = int(input("Введите первое число "))
            num2 = int(input("Введите второе число "))
            if operand == "+":
                print(f"Результат сложения {int(num1) + int(num2)}")
                return calc()
            if operand == "-":
                print(f"Результат вычитания {int(num1) - int(num2)}")
                return calc()
            if operand == "*":
                print(f"Результат умножения {int(num1) * int(num2)}")
                return calc()
            if operand == "/":
                if num2 == int(0):
                    print("На ноль делить нельзя к сожалению =( а ведь так хочется!")
                    return calc()
                print(f"Результат деления {int(num1) / int(num2)}")
                return calc()
        except:
            print("Нужно ввести цифру! Попробуйте еще раз ")
            return calc()

    print("Введен неверный символ, попробуйте еще раз")
    return calc()


calc()
