"""
Определить количество различных подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.
"""

import hashlib

string = input("Введите строку из латинских букв ")
stop = len(string)  # Сохраняем в переменную длину строки введенного пользователем
m = set()  # Создаём переменную m в виде множества для хранения уникальных хэшей
# Запускаем цикл для накопления в наш "контейнер" уникальных значений хэша
start = 0  # Задаем значение ноль для начала цикла
while start < len(string):  # Пока start меньше длины строки
    if start == 0:  # Если start равен нулю то мы уменьшаем длинну на минус 1
        stop -= 1  # чтобы первый срез был от 0 до предпоследнего символа строки
    else:
        stop = len(string)  # В дальнейшем весь цикл будет начинатся от 1 до последнего символа строки
    while start < stop:  # Начинается цикл в цикле
        # Добавляем в "контейнер" уникальные значения. С помощью sha256
        m.add(hashlib.sha256(string[start:stop].encode('utf-8')).hexdigest())
        stop -= 1  # Уменьшаем на минус 1 последний символ строки
    start += 1  # Прибавляем на плюс 1 первый символ строки
print(f"Количество подстрок в строке равно - {len(m)}")
