"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""

from collections import namedtuple, deque

count_comp = int(input("Введите кол-во предприятий "))
collect_comp = []
profit = []
dec_obj = deque(profit)
top_comp = ''
top_profit = 0
res = namedtuple('Company', ['name', 'profit'])
i = 0
while count_comp > i:
    company = res(
        name=input("Введите имя предприятия "),
        profit=input("Введите через пробел прибыль данного предприятия "
                     "за каждый квартал(Всего 4 квартала) "))
    collect_comp.append(company)
    dec_obj.appendleft(sum([int(n) for n in company.profit.split()]))
    if i == 0:  # При первой итерации присваиваем первую топ компанию, чтобы потом сравнивать с другими компаниями
        top_comp = collect_comp[i].name
        top_profit = dec_obj[i]
    if dec_obj[0] > top_profit:  # Новую компанию сравниваем с топовой компанией по доходу
        top_comp = collect_comp[i].name
        top_profit = dec_obj[0]
    i += 1
print(f"Средняя годовая прибыль всех предприятий {sum(dec_obj) / count_comp}")
print(f"Предприятие, с самым большим доходом - {top_comp} и его прибыль - {top_profit}")
k = 0
above_avg = []  # Список с компаниями выше среднего дохода
below_avg = []  # Список с компаниями ниже среднего дохода
while k < count_comp:  # Цикл распределяющий компании по среднему доходу
    s = sum([int(n) for n in collect_comp[k].profit.split()])
    d = sum(dec_obj) / count_comp
    if s > d:
        above_avg.append(collect_comp[k].name)
    if s < d:
        below_avg.append(collect_comp[k].name)
    if s == d:
        print("Одно предприятие попало в среднее значение! Вот это совпадение!")
    k += 1
print(f"Предприятия, с прибылью выше среднего значения {above_avg}")
print(f"Предприятия, с прибылью ниже среднего значения {below_avg}")
