"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def rec_method(num, s=0, m=1):
    if s == m:
        print(f"Равенство: {s == m}")

    elif s < m:
        return rec_method(num, s+1, num * (num +1) // 2)

try:
    NUMB = int(input("Введите число: "))
    rec_method(NUMB)
except ValueError:
    print("Вы ввели строку.")