"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""
from collections import defaultdict

defdict = defaultdict(list)
count = int(input('Введите количество предприятий для расчета прибыли: '))
summ = 0

for i in range(count):
    name = input('Введите название предприятия: ')
    cash = input('Через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 квартала): ').split()
    for j in cash:
        defdict[name].append(int(j))
    summ += sum(defdict[name])

print(defdict)
print(f'Средняя годовая прибыль всех предприятий: {summ / count}')
avr = defaultdict(str)
for i in defdict:
    if sum(defdict[i]) < summ / count:
        avr['less'] += f'{i} '
    elif sum(defdict[i]) > summ / count:
        avr['more'] += f'{i} '
print(f'Предприятия, с прибылью выше среднего значения: {avr["more"]}')
print(f'Предприятия, с прибылью ниже среднего значения: {avr["less"]}')
