"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
from random import randint


def min_test1(test_list):
    min_el = test_list[0]
    for i in range(1, len(test_list)):
        for j in range(i, len(test_list)):
            if test_list[i] < min_el:
                min_el = test_list[i]
    print(min_el)


def min_test2(test_list):
    print(min(test_list))


list_test = [randint(1, 100) for i in range(20)]
min_test1(list_test)
min_test2(list_test)
print(list_test)
