"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
from  random import  randint

#O(n^2)

def algoritm_1(lst_1):

    for a in lst_1:
        flag = True
        for b in lst_1:
            if a > b:
                flag = False
        if flag:
            return a

#O(n)

def algoritm_2(lst_1):

    min_num = lst_1[0]
    for a in lst_1:
        for b in lst_1:
            if b < min_num:
                min_num = b
    return min_num




lst = [randint(0, 100) for i in range(5)]
print(lst)

print(algoritm_1(lst))
print(algoritm_2(lst))