"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

##############################################################################################

from random import randint


def search_min1(lst_m):
    for el1 in lst_m:
        min_el = True
        for el2 in lst_m:
            if el1 > el2:
                min_el = False
        if min_el:
            return el1


def search_min2(lst_m):
    min_el = lst_m[0]
    for i in range(1, len(lst_m)):
        if lst_m[i] < min_el:
            min_el = lst_m[i]
    return min_el


num_list = [randint(0, 50) for i in range(10)]

print(num_list)
print("min =", search_min1(num_list))
print("min =", search_min2(num_list))

##############################################################################################

