"""
Задание 4.

Для этой задачи:
1) придумайте 2-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""

users_password = {
    'user1': '123',
    'user2': '234',
    'user3': 'qwe'
}

users_access = {
    'user1': True,
    'user2': True,
    'user3': False
}

user_name_input = input('введите имя пользователя ')

# Решение 1 - сложность O(1)
def password_access_check(user_name):
    if users_access.get(user_name) == False:
        print('ваша учетная запись не активирована')
    elif user_name not in users_password:
        print('вы не зарегистрированы')
    else:
        users_password_input = input('введите пароль ')
        if users_password.get(user_name_input) == users_password_input:
            print('доступ разрешен')
        else:
            print('вы ввели неправильный пароль')


# Решение 2 сложность - O(n)
def password_access_check2(user_name):
    count = 0
    for i in users_password:
        if i == user_name:
            if users_access.get(user_name) == True:
                users_password_input = input('введите пароль ')
                if users_password_input == users_password.get(user_name):
                    print('доступ разрешен')
                    break
                else:
                    print('Вы ввели неверный пароль')
                    break
            else:
                print('ваша учетная запись не активирована')
                break
        else:
            count += 1
        if count == len(users_password):
            print('вы не зарегистрированы')

"""
Предпочтительнее использовать решение 1, ввиду его меньшей сложности,
кроме того данное решение реализовано без использования цикла.
"""


while user_name_input:
    password_access_check1(user_name_input)
    password_access_check2(user_name_input)
    user_name_input = input('введите имя пользователя ')