"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через списковое включение.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

def min_search1(lst):
    min_number = lst[0]
    for i in lst:
        for n in lst:
            if n < i and n < min_number:
                min_number = n
    return min_number


def min_search2(lst):
    min_number = lst[0]
    for i in lst:
        if i < min_number:
            min_number = i
    return min_number

a = [x for x in range(-3, 3)]

print(min_search1(a))
print(min_search2(a))


