"""
1.	Написать программу, которая будет складывать, вычитать, умножать или делить
два числа. Числа и знак операции вводятся пользователем. После выполнения
вычисления программа не должна завершаться, а должна запрашивать новые данные
для вычислений. Завершение программы должно выполняться при вводе символа '0'
в качестве знака операции. Если пользователь вводит неверный знак
(не '0', '+', '-', '*', '/'), то программа должна сообщать ему об ошибке и
снова запрашивать знак операции.

Также сообщать пользователю о невозможности деления на ноль,
если он ввел 0 в качестве делителя.

Подсказка:
Вариант исполнения:
- условие рекурсивного вызова - введена операция +, -, *, / - ШАГ РЕКУРСИИ
- условие завершения рекурсии - введена операция 0 - БАЗОВЫЙ СЛУЧАЙ

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите операцию (+, -, *, / или 0 для выхода): +
Введите первое число: 214
Введите второе число: 234
Ваш результат 448
Введите операцию (+, -, *, / или 0 для выхода): -
Введите первое число: вп
Вы вместо трехзначного числа ввели строку (((. Исправьтесь
Введите операцию (+, -, *, / или 0 для выхода):
"""

def calculator():
    try:
        operand = input('введите знак операции ')
        number_one = int(input('введите первое число '))
        number_two = int(input('введите второе число '))
    except ValueError:
        print('некорректный ввод чисел, введите данные снова')
        calculator()

    if operand not in ['*', '/', '-', '+', '0']:
        print('некорректный ввод операции, введите данные снова ')
        calculator()
    elif operand == '/' and number_two == 0:
        print('деление на ноль! введите данные снова')
        calculator()
    elif operand == '0':
        return

    try:
        if operand == '*':
            print(number_one * number_two)
            calculator()
        elif operand == '/':
            print(number_one / number_two)
            calculator()
        elif operand == '-':
            print(number_one - number_two)
            calculator()
        elif operand == '+':
            print(number_one + number_two)
            calculator()
    except ZeroDivisionError:
        return

calculator()