"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""
from collections import defaultdict

defdict = defaultdict(list)
count = int(input('Введите количество предприятий: '))
sum_profit = 0

for company in range(count):
    name = input('Введите название предприятия: ')
    profit = [int(x) for x in input('Через пробел введите прибыль данного предприятия \
за каждый квартал: ').split(' ')]
    average = sum(profit)/4
    profit.append(average)
    defdict[name] = profit
    sum_profit += average

average_all = sum_profit/count
below = []
higher = []
for company in defdict:
    if defdict[company][-1] < average_all:
        below.append(company)
    else:
        higher.append(company)
print()
print(f'Средняя прибыль за год для всех компаний: {average_all}')
print('Компании, прибыль которых ниже средней: ', ','.join(below))
print('Компании, прибыль которых выше средней: ', ','.join(higher))
