"""
2.	Написать программу сложения и умножения двух шестнадцатеричных чисел.
При этом каждое число представляется как массив, элементы которого это цифры числа.
Например, пользователь ввёл A2 и C4F. Сохранить их как [‘A’, ‘2’] и [‘C’, ‘4’, ‘F’] соответственно.
Сумма чисел из примера: [‘C’, ‘F’, ‘1’], произведение - [‘7’, ‘C’, ‘9’, ‘F’, ‘E’].

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections
Также попробуйте решить задачу вообще без collections и применить только ваши знания по ООП
(в частности по перегрузке методов)
"""
from collections import namedtuple

hex_num = namedtuple('hex', ['x', 'y'])
h = hex_num(x=(list(input('Введите первое шестнацатеричное число: '))), y=(list(input('Введите первое шестнацатеричное число: '))))
print(h)
a = ''.join(h.x)
b = ''.join(h.y)

sum_hex = int(a, 16) + int(b, 16)
sum_hex = hex(sum_hex)
sum_lst = list(str(sum_hex[2:]))
print('Сумма введенных шестнадцатеричных чисел равна: ', sum_lst)

mul_hex = int(a, 16) * int(b, 16)
mul_hex = hex(mul_hex)
mul_lst = list(str(mul_hex[2:]))
print('Произведение введенных шестнадцатеричных чисел равно: ', mul_lst)