"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.
Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75
Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

def f(n, a):
    if n <= 1:
        return a
    elif n % 2 == 0:
        if a == 1:
            return a - f(n - 1, a / 2)
        else:
            return f(n - 1, a/2) - a
    elif n % 2 == 1:
        return f(n - 1, a/2) + a
print(f(3, 1))