"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.
Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
from random import randint
def f(r, n):
    if n > 0:
        try:
            p = int(input('Угадайте число:'))
        except ValueError:
            print('Ошибка! Введите число.')
            return f(r, n)
        if p == r:
            return 'Вы победили!'
        elif p > r:
            print('Вы ввели большое число!')
            return f(r,n - 1)
        elif p < r:
            print('Вы ввели маленькое число!')
            return f(r, n - 1)
        else:
            return 'Введите пожалуйста число.'

    else:
        return f'Попытки закончились. Загаданое число: {r}'




print(f(randint(0,100), 10))