"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.
 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
def f(n):
    def ff(n):
        if n < 1:
            return n
        else:
            return n + ff(n - 1)
    if ff(n) == n * (n + 1) / 2:
        return 'Для множества натуральных чисел равенство выполняется.'
    else:
        return 'Для множества натуральных чисел равенство не выполняется.'

print(f(7))