"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
  Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple

qty = int(input("Введите количество предприятий для расчета прибыли: "))
orgs = []
for idx in range(qty):
    Org = namedtuple('Fin_report',
                     'name quarter_1 quarter_2 quarter_3 quarter_4 year')
    org_name = input("Введите название предприятия: ")
    org_profit = input("через пробел введите прибыль данного предприятия\n"
                       "за каждый квартал(Всего 4 квартала): ")
    org = Org(org_name, *org_profit.split(), sum(map(int, org_profit.split())))
    orgs.append(org)
    print(org)
midle_profit = sum(org.year for org in orgs) / len(orgs)
print(f"Средняя годовая прибыль всех предприятий: {midle_profit}")
print("Предприятия, с прибылью выше среднего значения: ")
print(*(org.name for org in orgs if org.year >= midle_profit))
print("Предприятия, с прибылью ниже среднего значения: ")
print(*(org.name for org in orgs if org.year < midle_profit))
