"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

# Решение из лекций!!
from random import randint
# первый вариант O(n^2)
def list_min_n2(st):
    for i in st:
        is_min = True
        for j in st:
            if i > j:
                is_min = False
        if is_min:
            return i

#Второй вариант O(n)

def list_min_n(st):
    min_value = st[0]
    for i in st:
        if i < min_value:
            min_value = i
    return min_value

st1 = [randint(0,100) for i in range(15)]

# дополнительное творчество; решение со встроенной функцией, сложность константная O(1)

import random
def my_min(list):
    return min(list)

my_list = [random.randrange(1, 50, 1) for i in range(10)]

print(st1)
print(list_min_n2(st1))
print(list_min_n(st1))
print ("Случайный список: " +  str(my_list))
print("Минимум: " + str(my_min(my_list)))