"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

lst = [x*2 for x in range(100)]

def find_low(lst):
    low = lst.pop()
    for x in lst:
        for y in lst:
            if y == x:
                continue
            elif y < x and y < low:
                low = y
                break
            elif x < low:
                low = x
    return low

low = find_low(lst)
print(low)

def find_low_2():
    lst.sort()
    return lst[0]
print(low)