"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль
"""
from hashlib import sha256


def rec_pass(pass_, login_):
    salt = sha256(login_.encode('utf-8')).hexdigest()
    re_u_pass = input('Введите пароль еще раз для проверки: ')
    re_u_pass = sha256(re_u_pass.encode('utf-8')).hexdigest() + salt
    if pass_ == re_u_pass:
        return print('Вы ввели правильный пароль')
    else:
        print('Вы ввели неправильный пароль будете вводить, пока не совпадет')
        print(re_u_pass)
        rec_pass(pass_, login_)


u_login = input('Введите логин: ')
u_pass = input('Введите пароль: ')
u_pass = sha256(u_pass.encode('utf-8')).hexdigest() + sha256(u_login.encode('utf-8')).hexdigest()
print(u_pass)
rec_pass(u_pass, u_login)

