"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль
"""

from uuid import uuid4
import hashlib

salt = uuid4().hex

passwd = input('Введите пароль: ')
passwd_hash = hashlib.sha256(salt.encode() + passwd.encode('utf-8')).hexdigest() + salt

passwd_2 = input('Введите пароль ещё раз: ')

if hashlib.sha256(salt.encode() + passwd_2.encode('utf-8')).hexdigest() + salt == passwd_hash:
    print('Пароль подтверждён.')
else:
    print('Пароли не совпадают.')
