"""
Задание 3.
Определить количество различных подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените хеши и множества

рара:

рар
ра
ар
ара
р
а
"""

def substrings(a):
    length = len(a)
    return [(a[i:j + 1]) for i in range(length) for j in range(i, length)]
    
print(set(substrings('рара')))

