"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль
"""
import hashlib as hl


def pswd_hash(pswd):
    obj = hl.pbkdf2_hmac(
        hash_name='sha256',
        password=pswd.encode(),
        salt=b'secret',
        iterations=100000
    )
    return obj


user_pswd1 = input('Введите пароль: ')
user_pswd2 = input('Подтвердите пароль: ')

print('Пароли совпадают') \
    if pswd_hash(user_pswd1) == pswd_hash(user_pswd2) \
    else print('Пароли не совпадают')

