"""
Задание 3.
Определить количество различных подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените хеши и множества

рара:

рар
ра
ар
ара
р
а
"""

l = input("Введите строку: ")


def my_func(l, res=set()):
    if len(l) == 0:
        return
    k = 0
    for i in range(len(l)):
        res.add(hash(l[1:i + 1]))
        k = i + 1
    my_func(l[1:k], res)
    return res


result = my_func(l)
print("Количество подстрок: " + str(len(result)))
