"""
Задание 1.

Докажите, что словари обрабатываются быстрее, чем списки.

Реализуйте две функции, в первой нужно заполнить элементами список, во второй-словарь
Сделайте замеры времени выполнения каждой из функций

Подсказка: для замеров воспользуйтесь модулем time (см. примеры урока 1)

Примечание: eсли вы уже знаете, что такое декоратор и как его реализовать,
то реализуйте ф-цию-декоратор и пусть она считает время
И примените ее к двум своим функциям.
"""

def measure(func):
    import time
    def m_time():
        t_1 = time.time()
        func()
        t_2 = time.time()
        print(t_2 - t_1)
    return m_time

@measure
def fill_list():
    a = []
    for el in range(3):
         el = input('Введите число: ')
         a.append(el)
    print(a)
@measure
def fill_dict():
    d = {}
    for k in range(3):
        k = input('Введите ключ: ')
        v = input('Введите значение: ')
        d[k] = v
    print(d)
fill_list()
fill_dict()

