"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль
"""

from hashlib import sha256

while True:
    user_login = input('Введите логин: ')
    pass_hash = sha256(user_login.encode("utf-8") + input('Введите пароль: ').encode("utf-8")).hexdigest()
    print(f'В базе данных хранится строка: {pass_hash}')
    if sha256(user_login.encode("utf-8") +
              input('Введите пароль еще раз для проверки: ').encode("utf-8")).hexdigest() == pass_hash:
        print('Вы ввели правильный пароль.')
        break
    else:
        print(f'Вы ввели неправильный пароль. Попробуйте ещё раз.\n')
