import hashlib
"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль
"""

#############################################

'''Я не делаю проверку на корректность ввода или повтор вопросов если пользователь ввел что-тио не так
    Думаю задаие в другм, потому реализовал конкретно сам процес хеширования и проверки пароля'''
def hesh_password():
    password = input('Введите пароль')
    salt = input('Введите сид фразу')
    my_hesh = hashlib.sha256(password.encode()+salt.encode())
    print(f'Хеш вашего паролья: {my_hesh.hexdigest()}')

    check_pass = input('Введите пароль еще раз для проверки:')
    check_salt = input('Введите сид фразу')
    my_hesh_checker = hashlib.sha256(check_pass.encode() + check_salt.encode())

    if my_hesh.hexdigest() == my_hesh_checker.hexdigest():
        print('Вы ввели правильный пароль!')
    else:
        print('Пароли не совпадают')


hesh_password()
