"""
Задание 1.

Реализуйте заполнение списка и словаря, сделайте замеры и сделайте выводы, обоснуйте результат.
Сделайте несколько операций с каждым из объектов, сделайте замеры и сделайте выводы, обоснуйте результат.

Подсказка: для замеров воспользуйтесь модулем time (см. примеры урока 1)

Примечание: eсли вы уже знаете, что такое декоратор и как его реализовать,
то реализуйте ф-цию-декоратор и пусть она считает время
И примените ее к двум своим функциям.
"""
import time


start = time.time()
lst = []
for i in range(1000):
    lst.append(i)
end = time.time()
print('list test =>>>', end-start)

start = time.time()
dict = {}
for i in range(1000):
    dict[i] = i
end = time.time()
print('dict test =>>>', end - start)
