"""
Задание 3.
Определить количество различных подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените хеши и множества

рара:

рар
ра
ар
ара
р
а
"""
import hashlib

s = input("Введите строку из маленьких латинских букв: ")
count = set()
N = len(s)
for i in range(N):
    for j in range(N, i, -1):
        print(s[i:j])
        count.add(hashlib.sha1(s[i:j].encode('utf-8')).hexdigest())
print(f"Количество уникальных подстрок равно: {len(count)}, хеши: {count}")
