"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль
"""
from hashlib import sha256


def password(text):
    raw_pass = input(f'{text}')
    salt = raw_pass[::-2]
    hash_pass = sha256(raw_pass.encode('utf-8')+salt.encode('utf-8')).hexdigest()
    return hash_pass


first_pass = password('Введите пароль: ')
print(f'В базе данных хранится строка: {first_pass}')
second_pass = password('Снова введите пароль: ')
if second_pass == first_pass:
    print('Вы ввели верный пароль!!!')
else:
    print('Вы ввели неверный пароль!')
