"""
Задание 4.
Реализуйте скрипт "Кэширование веб-страниц"

Функция должна принимать url-адрес и проверять
есть ли в кэше соответствующая страница, если нет, то вносит ее в кэш

Подсказка: задачу решите обязательно с применением 'соленого' хеширования
Можете условжнить задачу, реализовав ее через ООП
"""
import hashlib

cache = {}  # хранилище для хешей url и соответствующих данных для конкретного url
url_salt = {}  # хранилище для url и соли
"""
1. Получая от пользователя url, приложение (функция generate_key(url))проверяет в url_salt, создавалась ли на основе 
этого url соль. если нет - генерирует соль, сохраняет ее, солит и хеширует введенный url и возвращает его. 
2. Далее проверяем (функция get_cache(key)), содержится ли уже в cache такой хешированный url и соответствующие
данные. Если да, то возвращаем кэшированные данные. Если нет - эмулируем получение данных и кэшируем их.
Соответственно при повторном вводу url мы уже имеем в кэше его соленый хеш и данные и возвращаем данные напрямую из
кэша, не получая их из удаленного источник (сервера).
"""


def generate_key(url):
    """Генерирует соленый хеш для url"""
    salt = url_salt.get(url)  # проверяем, если ли в хранилище соль для такого url
    if salt is None:
        salt = url[::-1]  # создаем соль на основе перевернутого среза
        url_salt[url] = salt  # записываем соль в хранилище
    salt_url = hashlib.sha256(url.encode() + salt.encode()).hexdigest()  # солим url
    return salt_url


def get_cache(key):
    """Возвращает данные из кэша, если они есть в кэш для данного url. Если нет - возвращает None"""
    if key in cache.keys():
        return cache.get(key)
    return None


def get_data(url):
    """Эмулирует получение данных по введенному url, если он не содержится в кэш к этому моменту"""
    return {'data': 'some data'}


def set_cache(key, data):
    """Записывает в кэш url и полученные данные"""
    cache[key] = data


def app():
    """Точка входа в приложение"""
    while True:
        url = input('Введите url: ')  # запрашиваем url
        key = generate_key(url)  # хешируем соленый url
        stored_data = get_cache(key)  # запрашиваем данные по полученому хеш в кэше
        if stored_data is None:  # если данных в кэш нет:
            received_data = get_data(url)  # "идем за данными по url"
            set_cache(key, received_data)  # записываем полученные данные к кэш
            print('Данные по этому url отсутствуют в кэш и будут добавлены. Введите url еще раз')
        else:
            print(stored_data)  # получаем данные из кэш
            print(url_salt, cache)  # выводим хранилище для соли и кэш


if __name__ == '__main__':
    app()
