"""
Задание 1.

Реализуйте заполнение списка и словаря, сделайте замеры и сделайте выводы, обоснуйте результат.
Сделайте несколько операций с каждым из объектов, сделайте замеры и сделайте выводы, обоснуйте результат.

Подсказка: для замеров воспользуйтесь модулем time (см. примеры урока 1)

Примечание: eсли вы уже знаете, что такое декоратор и как его реализовать,
то реализуйте ф-цию-декоратор и пусть она считает время
И примените ее к двум своим функциям.
"""

import time

t1 = time.time()
lst = []
for el in range(100000):
    lst.append(el)
t2 = time.time()

print(t2 - t1) # -> 0.019988536834716797

t3 = time.time()
dictionary = {a: a for a in range(100000)}
t4 = time.time()

print(t4 - t3) # -> 0.01301264762878418

"""
Без понятия почему словарь заполнятеся быстрей?
По логике ему нужно дополнительно выделять память на создание хэш-таблицы.
"""
