"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль
"""

"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль

Допускаются любые усложения задания - валидация, подключение к БД, передача данных в файл
"""

from hashlib import sha256
from uuid import uuid4

def passwd():
    salt = uuid4().hex
    passwd = input('Введите пароль: ')
    return hash_passwd(salt, passwd)


def hash_passwd(salt, passwd_repeat):
    res_1 = sha256(salt.encode() + passwd_repeat.encode()).hexdigest()
    print(f'В базе данных хранится строка: {res_1}')
    passwd = input('Введите пароль еще раз для проверки: ')
    res_2 = sha256(salt.encode() + passwd.encode()).hexdigest()
    print(f'В базе данных хранится строка: {res_2}')
    if res_1 == res_2:
        print('Вы ввели правильный пароль!')
    else:
        print('Вы ввели НЕВЕРНЫЙ пароль!')


passwd()










