"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль
"""
import hashlib
from uuid import uuid4


def get_pass(pass_user):
    """ Создание хеша пароля """
    return hashlib.sha256(salt.encode() + pass_user.encode()).hexdigest()


def chek_pass_repeat(user_pass, repeat_pass):
    """Проверка повторного ввода пароля через сравнение хешей"""
    if user_pass == get_pass(repeat_pass):
        return print(f'Вы ввели правильный пароль')
    else:
        return print(f'Вы ввели неправильный пароль')


salt = uuid4().hex
new_pass = input('Введите пароль: ')
hash_pass = get_pass(new_pass)
print(f'В базе данных хранится строка: {hash_pass}')
chek_pass = input('Введите пароль еще раз для проверки: ')
chek_pass_repeat(hash_pass, chek_pass)
