"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль
"""

import hashlib


password = input('Ввведите пароль: ')
salt = b'super password'
res = hashlib.sha256(password.encode('utf-8') + salt).hexdigest()
print(f'В базе данных храниться строка: {res}')
check_password = input('Введите пароль еще раз для проверки: ')
check_res = hashlib.sha256(check_password.encode('utf-8') + salt).hexdigest()
if check_password == password:
	print('Вы ввели верный пароль')
	print(check_res)
else:
	print('Вы ввели неправильный пароль')
