"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль
"""

from hashlib import sha256
from uuid import uuid4

salt = uuid4().hex
print(salt)


def hash_pass(password):
    return sha256(salt.encode() + password.encode()).hexdigest() + '/' + salt


passwd = input('Введите пароль: ')
h_pass = hash_pass(passwd)
print(f'В базе данных хранится строка: {h_pass}')

check_pass = input('Введите пароль еще раз: ')
h_pass_ch = hash_pass(check_pass)

if h_pass == h_pass_ch:
    print('Введен правильный пароль ')
else:
    print('Пароли не совпадают')
