"""
Задание 3.
Определить количество различных подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.

Подсказка: примените хеши и множества

рара:

рар
ра
ар
ара
р
а
"""


test_str = 'papa'
l = len(test_str)
print(f'Количество подстрок в строке "{test_str}": '
      f'{len(set([test_str[b:b + a] for a in range(1, l) for b in range(l + 1 - a)]))}')
