"""
Задание 3.
Определить количество различных подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.
"""
# импорт hashlib хэш-библиотеки Python для хеширования строк
import hashlib
from collections import Counter

'''
рара -исходная строка

рар -1я подстрока
ра  -2я подстрока
р   -3я подстрока
а   -4я подстрока
ар  -5я подстрока
ара -6я подстрока
'''

'''
Сохраняем хэши всех подстрок в множество.
Экономия на размере хранимых данных (для длинных строк) и скорость доступа 
вместе с уникальностью элементов, которые даёт множество, сделают решение 
коротким и эффективным.
'''

# Вариат 1
s = input("Введите строку из маленьких латинских букв: ")  # исходная строка
r = set()  # множество для отсечения дублей, чтобы были уникальные хеши

N = len(s)
for i in range(N):
    if i == 0:
        N = len(s) - 1
    else:
        N = len(s)
    for j in range(N, i, -1):
        '''
        возвращается как строковый объект двойной длины, содержащий только
        шестнадцатеричные цифры. Это может использоваться для безопасного
        обмена значениями в электронной почте или других недвоичных средах.
        digest() - набор байтов
        hexdigest() - строка
        '''
        r.add(hashlib.sha1(s[i:j].encode('utf-8')).hexdigest())
        # вызов из хеш-библиотеки хеш-функции sha1, кодирование объекта в
        # байты в указанной кодировке и преобразование в строку (hexdigest)

print(f"Количество различных подстрок в строке {s} равно {len(r)}")

# Вариат 2
result_set = set()
for sym in range(len(s)):
    last_str = s[sym:]
    for length in range(1, len(last_str) + 1):
        sub_str = s[sym:sym + length]
        if s != sub_str:
            hash_sub_str = hash(sub_str)
            result_set.add(hash_sub_str)

print(len(result_set))

print(f"Количество различных подстрок в строке {s} равно {len(r)}")
