"""
Задание 1.

Реализуйте заполнение списка и словаря, сделайте замеры и сделайте выводы, обоснуйте результат.
Сделайте несколько операций с каждым из объектов, сделайте замеры и сделайте выводы, обоснуйте результат.

Подсказка: для замеров воспользуйтесь модулем time (см. примеры урока 1)

Примечание: eсли вы уже знаете, что такое декоратор и как его реализовать,
то реализуйте ф-цию-декоратор и пусть она считает время
И примените ее к двум своим функциям.
"""

import time
def fill_list(n):
    start = time.time()
    list = [i for i in range(1, n)]
    spent_time = time.time() - start
    return spent_time


def fill_dict(n):
    start = time.time()
    dict = {x: x for x in range(n)}
    spent_time = time.time() - start
    return spent_time



print(fill_list(1000000))
print(fill_dict(1000000))

# Списки заполняются медленнее, чем словари. Так происходит из-за того, что сложность операции со словарями константная,
# а для списков линейная O(n)
