"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль
"""

from hashlib import sha256

passwd = input("Введите пароль: ")
db = []

def pswd(passwd, db):
    salt = 'kuku'
    cache = sha256(passwd.encode() + salt.encode()).hexdigest()
    if db == []:
        db.append(cache)
        return db
    else:
        if cache == db[0]:
            print("Вы ввели правильный пароль ")
        else:
            print("Вы ввели неправильный пароль ")

pswd(passwd, db)

passwd = input("Введите пароль еще раз ")
pswd(passwd, db)
