"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль
"""

import hashlib

login = input('Введите логин: ')
sault = hashlib.sha256(b'login').hexdigest()
password = input('Введите пароль: ')
password_hash = hashlib.sha256(password.encode() + sault.encode()).hexdigest() + ':' + sault
print(f'В базе данных хранится строка: {password_hash}')
password_2 = input('Введите пароль еще раз для проверки: ')
password_2_hash = hashlib.sha256(password_2.encode() + sault.encode()).hexdigest() + ':' + sault
if password_hash == password_2_hash:
    print('Вы ввели правильный пароль')
else:
    print('Вы ввели неправильный пароль')