"""
Задание 1.

Реализуйте заполнение списка и словаря, сделайте замеры и сделайте выводы, обоснуйте результат.
Сделайте несколько операций с каждым из объектов, сделайте замеры и сделайте выводы, обоснуйте результат.

Подсказка: для замеров воспользуйтесь модулем time (см. примеры урока 1)

Примечание: eсли вы уже знаете, что такое декоратор и как его реализовать,
то реализуйте ф-цию-декоратор и пусть она считает время
И примените ее к двум своим функциям.
"""
import time


def li():
    start_val = time.time()
    list = []
    for i in range(14000):
        list.append(i)
    end_val = time.time()
    return list, end_val - start_val


print(li())


def di():
    start_val = time.time()
    dict = {}


    for i in range(14000):

            dict[i] = i
    end_val = time.time()
    return dict, end_val - start_val
print(di())