"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль
"""
import hashlib

user_pass = input('введите пароль \n').encode()
hash_pass = hashlib.sha3_256(user_pass).hexdigest()
# print(hash_pass) #a03ab19b866fc585b5cb1812a2f63ca861e7e7643ee5d43fd7106b623725fd67
user_pass = input('введите пароль \n').encode()
user_hash_pass = hashlib.sha3_256(user_pass).hexdigest()
if user_hash_pass == hash_pass:
    print('Пароль верен')
else:
    print('Пароль неверен')