"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль
"""
########################################################################################################################

import hashlib


def password():
    user_password = input('Введите пароль: ')
    salt = hashlib.sha256(b'Hakuna_Matata').hexdigest()
    result = hashlib.sha256(salt.encode() + user_password.encode()).hexdigest() + ':' + salt
    print(result)
    user_password_2 = input('Ещё раз введите пароль: ')
    result_2 = hashlib.sha256(salt.encode() + user_password_2.encode()).hexdigest() + ':' + salt
    if result_2 == result:
        print("Пароль верный.")
    return


password()





