"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль
"""

import hashlib


def check_password():
    user_pass = input('Введите пароль: ')
    salt = 'salt'
    pass_hash = hashlib.sha256(user_pass.encode() + salt.encode()).hexdigest()
    check_pass = input('Введите пароль еще раз: ')
    if pass_hash == hashlib.sha256(check_pass.encode() + salt.encode()).hexdigest():
        print('Вы ввели правильный пароль')
    else:
        print('Вы ввели неправильный пароль')


check_password()
