"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль
"""
from hashlib import sha256


salt = 'Machpella'
hash_obj = sha256(input('Введите пароль: ').encode('utf-8') + salt.encode('utf-8'))
result_hash = hash_obj.hexdigest()
print(f'В базе данных хранится строка: {result_hash}')

while True:
    enter = input('Введите пароль еще раз для проверки: ')
    enter_obj = sha256(enter.encode('utf-8') + salt.encode('utf-8'))
    result_enter = enter_obj.hexdigest()

    if result_hash == result_enter:
        print('Вы ввели верный пароль!')
        break
    else:
        print('Пароль неверный, повторите ввод')
