"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль
"""


import hashlib
from uuid import uuid4


# Для примера алгоритма хранения и сравнения пароля будет использоваться соль из модуля uuid
# (что для примера достаточно)
salt = uuid4().hex


def hashing_pass(password):
    """Функция для хеширования пароля с использованием соли

    :param password: Пароль пользователя
    :return: Возвращает посоленный и захешированный пароль
    """
    global salt
    return hashlib.sha3_256(salt.encode() + password.encode()).hexdigest()


#########################################
pswrd = input("Введите пароль: ")
pswrd_hash = hashing_pass(pswrd)
print(f"В «БД» записан хеш пароля: {pswrd_hash}")

pswrd = input("Введите пароль еще раз: ")
if hashing_pass(pswrd) == pswrd_hash:
    print("Вы ввели правильный пароль!")
else:
    print("Не правильно!")
