"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль
"""
from uuid import uuid1
import hashlib

salt = uuid1().hex

new_paswd = input('Введите пароль')
paswd_obj = hashlib.sha256(salt.encode() + new_paswd.encode()).hexdigest()
check_passwd = input('Введите пароль повторно')
check_hash = hashlib.sha256(salt.encode() + check_passwd.encode()).hexdigest()
if paswd_obj == check_hash:
    print('Пароль совпадает')
else:
    print('Пароль не верный')
