"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль
"""

import hashlib


def pas_hash(pas_str):
    salt = "salt"
    res = hashlib.sha256(salt.encode() + pas_str.encode('utf-8')).hexdigest()
    return res


pas1 = input("Введите пароль: ")
print(f"В базе данных хранится строка: {pas_hash(pas1)}")
pas2 = input("Введите пароль еще раз для проверки: ")
if pas_hash(pas2) == pas_hash(pas1):
    print("Вы ввели правильный пароль")
else:
    print("Вы ввели неправильный пароль")

# надо бы хеш присваивать переменной и потом сравнивать но раз все происходит
# в одном запуске то для экономии я сравнил результаты возвращения функции хеширования
