"""
Задание 2.
Ваша программа должна запрашивать пароль
Для этого пароля вам нужно получить хеш, используя функцию sha256
Для генерации хеша обязательно нужно использовать криптографическую соль
Обязательно выведите созданный хеш

Далее программа должна запросить пароль повторно
Вам нужно проверить, совпадает ли пароль с исходным
Для проверки необходимо сравнить хеши паролей

ПРИМЕР:
Введите пароль: 123
В базе данных хранится строка: 555a3581d37993843efd4eba1921f1dcaeeafeb855965535d77c55782349444b
Введите пароль еще раз для проверки: 123
Вы ввели правильный пароль
"""

import hashlib
from uuid import uuid4

salt = uuid4().hex
password_1 = input('Введите пароль ')
hash_obj_sha1 = hashlib.sha256(password_1.encode() + salt.encode())
hash_obj_sha2 = hashlib.sha256((input('Введите пароль еще раз, для проверки ')).encode() + salt.encode())

if hash_obj_sha1.hexdigest() == hash_obj_sha2.hexdigest():
    print("Пароль принят")
else:
    print("Пароли отличаются")
