"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

from random import randint


def guess(n, s, g_n):
    if g_n == n:
        return f'Поздравляю, Вы победили! Число угадано верно!'
    elif s == 1:
        return f'К сожалению, Вы проиграли! Загаданное число {n}'
    else:
        s -= 1
        if g_n < n:
            g_n = int(input(f'Вы ввели слишком маленькое число! У Вас {s} попыток, попробуйте снова: _'))
        elif g_n > n:
            g_n = int(input(f'Вы ввели слишком большое число! У Вас {s} попыток, попробуйте снова: _'))
        elif g_n == n:
            return f'Поздравляю, Вы победили! Число угадано верно!'

    return guess(n, s, g_n)


s = 10
n = randint(1, 100)
g_n = int(input(f'Введите натуральное число от 1 до 100 у Вас {s} попыток: _'))
print(guess(n, s, g_n))