"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple


factory_number = int(input("Введите количество предприятий для расчета прибыли: "))
Factory = namedtuple('Factory', 'y_profit')
factory_dict = {}


def avr_profit(fact_dict):
    s = 0
    for el in fact_dict.values():
        s = s + el.y_profit
    return s / len(fact_dict)


for i in range(factory_number):
    name = input("Введите название предприятия: ")
    year_profit = input("через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 квартала): ")
    year_profit = sum([int(el) for el in year_profit.split()])
    factory_dict[name] = Factory(year_profit)

all_avg = avr_profit(factory_dict)
print('Средняя годовая прибыль всех предприятий: ', all_avg)

print('Предприятия, с прибылью выше среднего значения: ', end='')
print(' '.join([k for k, v in factory_dict.items() if v.y_profit > all_avg]))
print('Предприятия, с прибылью ниже среднего значения: ', end='')
print(' '.join([k for k, v in factory_dict.items() if v.y_profit < all_avg]))

