"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def f_sum(n, summ=0):
    if n == 0:
        return summ
    else:
        return f_sum(n - 1, summ + n)


def input_n1():
    n1 = None
    while type(n1) is not int:
        try:
            n1 = int(input('Введите число элементов для ряда чисел: '))
        except ValueError:
            print('ошибка ввода')
    return n1


n1 = input_n1()
sum_2 = n1 * (n1 + 1) / 2

if sum_2 == f_sum(n1):
    print('Равенство доказано')
else:
    print('Равенство не доказано')
