"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
import random


def check_number(n1, i=9):
    if i == 0:
        print(f'число {n1} не угадано')
        return
    else:
        a = input_n()
        if n1 == a:
            print(f'число {n1} угадано!!!')
            return n1
        elif n1 > a:
            print(f'Не угадал. Загаданное число больше. Пробуй еще. Осталось {i} попыток!!!')
        else:
            print(f'Не угадал. Загаданное число меньше. Пробуй еще. Осталось {i} попыток!!!')
    return check_number(n1, i - 1)


def input_n():
    a = None
    while type(a) is not int:
        try:
            a = int(input('Введите число: '))
        except ValueError:
            print('ошибка ввода')
    return a


n = random.randint(1, 100)
print(n)

check_number(n)
