"""
2. Отсортируйте по возрастанию методом слияния одномерный вещественный массив,
заданный случайными числами на промежутке [0; 50). Выведите на экран исходный
и отсортированный массивы.

Пример:
Введите число элементов: 5
Исходный - [46.11436617832828, 41.62921998361278, 18.45859540989644, 12.128870723745806, 8.025098788570562]
Отсортированный - [8.025098788570562, 12.128870723745806, 18.45859540989644, 41.62921998361278, 46.11436617832828]
"""
from random import triangular


def merge_sort(lst_obj):
    if len(lst_obj) > 1:
        center = len(lst_obj) // 2
        left = lst_obj[:center]
        right = lst_obj[center:]

        merge_sort(left)
        merge_sort(right)

        # перестали делить
        # выполняем слияние
        i, j, k = 0, 0, 0

        while i < len(left) and j < len(right):
            if left[i] < right[j]:
                lst_obj[k] = left[i]
                i += 1
            else:
                lst_obj[k] = right[j]
                j += 1
            k += 1

        while i < len(left):
            lst_obj[k] = left[i]
            i += 1
            k += 1

        while j < len(right):
            lst_obj[k] = right[j]
            j += 1
            k += 1
        return lst_obj


x = input('Введите целое число - количество элементов массива: _')
while not x.isdecimal():
    x = input('Вы ошиблись! Введите целое число - количество элементов массива: _')

my_list = [triangular(0, 50) for i in range(int(x))]
print(f' Исходный список: {my_list}')
merge_sort(my_list)
print(f' Отсортированный список: {my_list}')

"""
 Исходный список: [23.391238009671536, 35.70797362524285, 29.852706849001866, 31.115880512993524, 20.732849500436192, 29.801982073566, 40.63751703791736]
 Отсортированный список: [20.732849500436192, 23.391238009671536, 29.801982073566, 29.852706849001866, 31.115880512993524, 35.70797362524285, 40.63751703791736]
 """
