"""
Задание 2.
Реализуйте два алгоритма.
Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.
Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.
Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""


# первый способ
def min_1():
    a = [i for i in range(1, 15)]
    a.sort()
    for i in a[1:]:
        a.remove(i)
    return a[0]
print(min_1())

#  второй способ
def min_2():
    b = [i for i in range(1, 15)]
    t=b[0]
    for i in b:
        if i<t:
            t=i
    return t
print(min_2())

# привести решение к О(1) не получилось


