"""
Задание 3 *.
Сделать профилировку для скриптов с рекурсией и сделать описание,
можно ли так профилировать и есть ли 'подводные камни' в профилировании?
Придумать как это решить!
Есть очень простое решение!
"""
from memory_profiler import profile


def recursive(a):
    global even, odd
    if a == 0:
        return
    if a % 2 == 0:
        even += 1
    else:
        odd += 1
    a = a // 10
    recursive(a)


@profile(precision=4)
def recursive_wrapper(a):
    return recursive(a)


a = int(input('Введите длинное число:   '))

even = 0
odd = 0

recursive_wrapper(a)
print(f"Четных: {even}, нечетных: {odd}")

"""
Чтобы профилировать рекурсию надо создать новую функцию, через которую вызывать рекурсию и уже на нее навешивать
profile.

Если делать профилирование без этого, то профилировщик будет запускаться то количество раз, 
какое будет запускаться рекурсия...
"""

