"""
Задание 3 *.
Сделать профилировку для скриптов с рекурсией и сделать описание,
можно ли так профилировать и есть ли 'подводные камни' в профилировании?
Придумать как это решить!
Есть очень простое решение!
"""
from memory_profiler import profile

'''
Решение - использовать обертку, чтобы profile не вызывался 100500 раз. Сначала мы получаем результаты из рекурсии,
потом мы функцией выводим результат другой функции
результаты с рекурсией и без у меня получились одинаковые
'''
@profile
def fac(i):
    def factorial(n):
        if n == 0:
            return 1
        else:
            return n * factorial(n - 1)
    return factorial(i)


@profile
def fac_1(n):
    factorial = 1
    while n > 1:
        factorial *= n
        n -= 1
    return factorial

print(fac(100))
print(fac_1(100))