"""
Задание 2.
Предложите фундаментальные варианты оптимизации памяти
 и доказать (наглядно, кодом, если получится) их эффективность

Например, один из вариантов, использование генераторов
"""

"""
Фундаментальные способы оптимизировать память (помимо генераторов и рассмотренных вещей): 
1. Использование словарей int-int вместе со словарями int-object (где объект - хешированная строка). Это позволяет опти-
мизировать память, прогоняя поиск по int-int и залезая в другие словари только при необходимости. Как я понял, это помо-
гает при работе с огромными массивами данных. 
2. С методом выше и отдельно от него помогает реализация работы с большим кол-вом данных не чисто кодом, а 
взаимодействуя с БД. 
3. Использование сторонних библиотек (например Numpy для работы с большими числами), уже оптимизированных под задачи.
4. Использование Cython, написание функций на C с объявлением статических типов, что будет работать сильно быстрее.
"""
