"""
Задание 3 *.
Сделать профилировку для скриптов с рекурсией и сделать описание,
можно ли так профилировать и есть ли 'подводные камни' в профилировании?
Придумать как это решить!
Есть очень простое решение!
"""
from memory_profiler import profile


@profile
def check_memory(number):
    def factorial(n):
        if n == 0:
            return 1
        else:
            return factorial(n - 1) * n
    print(f'Факториал числа - {number} равен {factorial(number)}')


check_memory(900)

"""
Так как профилировка перед рекурсией будет постоянно вызываться. Оборачиваем рекурсию в функцию, для которой и будем 
делать замеры.
"""
