""""
Задание 3 *.
Сделайте профилировку для скриптов с рекурсией и сделать,
можно так профилировать и есть ли 'подводные камни' в профилировании
"""

'''
Рекурсия Аккермана. 
При анализе рекурсии с помощью профилирования несколько раз делаются одни и те же замеры.
Особенно это заметно когда реккурсия вызывает сама себя. Не совсем читабельно.
'''

from memory_profiler import profile


@profile
def akk(a, b):
    if a == 0:
        b = b + 1
        return b
    elif a > 0 and b == 0:
        return akk(a - 1, 1)
    else:
        return akk(a - 1, akk(a - 1, 1))


if __name__ == "__main__":
    akk(5, 4)
