"""
Задание 2.
Предложите фундаментальные варианты оптимизации памяти
 и доказать (наглядно, кодом, если получится) их эффективность

Например, один из вариантов, использование генераторов
"""

# import extension

"""
Хотел как пример привести использования си в питоне, но к сожалению по быстрому это сделать не получилось, а времени, к
сожалению, очень мало. Не получилось портировать библиотеку, как будет время обязательно займусь, интересно ж
А так вариант как минимум задания переменных через куски кода в си, так и вполне себе написание кода и описание
различных структур естественно будет лучше в си, ведь там можно контролировать все это самому. Думал написать по 
быстрому функцию для заполнения массива интов допустим, но значит пока отложу это
А так в целом даже простенький хелоу ворлд интересно как заработал бы. Ему придет указатель сразу строкой или как. И 
обратное посмотреть тоже было бы крайне любобытно
"""