"""
Задание 3 *.
Сделать профилировку для скриптов с рекурсией и сделать,
можно так профилировать и есть ли 'подводные камни'
"""

from memory_profiler import profile


@profile
def reverse(x, r=0):
    if x == 0:
        print(f'обратное число: {r}')
    else:
        y = x % 10
        r = (r * 10) + y
        x = x // 10
        reverse(x, r)


reverse(962468)

'''
Понятно, что вызов профилировщик вызывается при каждом рекурсивном вызове, соответственно его использование 
в данном случае будет не совсем корректно. Как обойти эту проблему в рамках данного профилировщика не совсем понятно. 

'''