"""
Задание 2.*
Предложить еще какие-либо варианты (механизмы, подходы, библиотеки, идеи)
для оптимизации памяти и
доказать!!! (наглядно, кодом) их эффективность (на примере профилировщика)
"""
"""
Задание 2.
Предложите фундаментальные варианты оптимизации памяти
 и доказать (наглядно, кодом, если получится) их эффективность

Например, один из вариантов, использование генераторов
"""
"""
Использование внешних файлов. 

Разбиение задачи на функции с локальными переменными. Тогда после завершения каждой из них память будет атоматически 
подчищаться гарбедж коллектором.

Использование генераторов
"""



