"""
Задание 2.
Предложите фундаментальные варианты оптимизации памяти
 и доказать (наглядно, кодом, если получится) их эффективность

Например, один из вариантов, использование генераторов
"""
"""
Нашел следующие советы:

При наличие больших словарей экономить память поможет использование БД,
для сохранения скорости правельно проиндексировать таблицу.

Для работы с файлами использовать 'with'

Для сборки мусора в ручную мы можем использовать функцию gc.collect() модуля gc.
Существует два способа выполнения сборки мусора вручную:
сборка мусора на основе времени или события(Буду использовать возможно когда-нибудь потом.))))

"""