"""
Задание 3 *.
Сделать профилировку для скриптов с рекурсией и сделать описание,
можно ли так профилировать и есть ли 'подводные камни' в профилировании?
Придумать как это решить!
Есть очень простое решение!
"""
import memory_profiler as mp


def task3(n):
    if n == 0:
        return ''
    else:
        st = str(n % 10)
        return st + task3(n // 10)


@mp.profile()
def t(n):
    return task3(n)


if __name__ == '__main__':
    print(f'432 - {t(432)}')

"""
При профилировании рекурсивных алгоритмов через декоратор выводятся данные о каждом вызове функции рекурсии.
В результате получаем сложно анализируемую простыню.
Как вариант можно внести вызов рекурсии в дополнительную функцию и профилировать уже ее.
"""