"""
Задание 3 *.
Сделать профилировку для скриптов с рекурсией и сделать описание,
можно ли так профилировать и есть ли 'подводные камни' в профилировании?
Придумать как это решить!
Есть очень простое решение!
"""
from memory_profiler import profile


def reverse_num(num):
    if num < 10:
        return num
    else:
        print(num % 10, end='')
        return reverse_num(num // 10)


@profile()
def new_reverse_num(num):
    return reverse_num(num)


print(new_reverse_num(3486))

'''
ВЫВОД: делать профилировку для скриптов с рекурсией можно.
из подводных камней:
1. если делать профилировку сразу на рекурсивную функцию, то результат профилировки
будет после каждого вызова функции (т.е. большое количество результирующих таблиц
'''
