"""
Задание 3 *.
Сделать профилировку для скриптов с рекурсией и сделать описание,
можно ли так профилировать и есть ли 'подводные камни' в профилировании?
Придумать как это решить!
Есть очень простое решение!
"""

"""
Для профилирования скриптов с рекурсией необходимо создать отдельную
функцию, которая будет входной точкой, и производить замеры для нее.
Если производить замеры для самой рекурсивной функции, то они будут 
производиться при каждом ее вызове
"""

from memory_profiler import profile


def fibonacci(n):
    if n <= 1:
        return n
    else:
        return fibonacci(n - 1) + fibonacci(n - 2)


@profile()
def wrapper(n):
    return fibonacci(n)


n = int(input("Введите номер члена последовательности: "))
print(f"Последовательность Фибоначчи: {fibonacci(n)}")

wrapper(n)
