"""
Задание 3 *.
Сделать профилировку для скриптов с рекурсией и сделать,
можно так профилировать и есть ли 'подводные камни'
"""
from memory_profiler import profile, memory_usage
from time import process_time


@profile
def sum_number(a):
    if a == 1:
        return 1
    return a + sum_number(a-1)


print(sum_number(10))

"""
Как и ожидалось, подводные камни есть, profile срабатывает на каждый вызов функции в рекурсии.
Так профилировать нет смысла, т.к. нет общей картины работы функции.
Вероятно рекурсию стоит профилировать через срез времени и памяти, причем без помощи декоратора,
т.к. декоратор также будет вызываться по количеству вызовов рекурсии.
"""

t1 = process_time()
m1 = memory_usage()

print(sum_number(10))

t2 = process_time()
m2 = memory_usage()
print(f'Выполнение заняло {t2 - t1} сек и {m2[0] - m1[0]} MiB.')
