"""
Задание 2.
Предложите фундаментальные варианты оптимизации памяти
 и доказать (наглядно, кодом, если получится) их эффективность

Например, один из вариантов, использование генераторов
"""
from sys import getsizeof as gs

print(gs(hex(1234)))
print(gs(bin(1234)))
print(gs(1234))

"""
ничего стоящего не придумал...
думал над типами данных, какие эффективнее использовать, и получилось, что для их храниения
лучше использовать десятичную систему и никуда их не преобразовывать. На втором месте шестнадцатиричная система.
Для проверки использовал из модуля sys функцию getsizeof, которая возвращает размер объекта (в байтах) 
30 - шестнадцатиричная система
38 - двоичная
14 - десятичная

"""