"""
Задание 3 *.
Сделать профилировку для скриптов с рекурсией и сделать описание,
можно ли так профилировать и есть ли 'подводные камни' в профилировании?
Придумать как это решить!
Есть очень простое решение!
"""

from memory_profiler import profile


######################################################
def fact(n):
    if n == 1:
        return 1
    else:
        return n * fact(n - 1)


######################################################
@profile
def call_fact(n):
    return fact(n)


######################################################
print(f"totally {call_fact(777)}")

######################################################
'''

Не понял в чём подвох...

'''
