"""
Задание 3 *.
Сделать профилировку для скриптов с рекурсией и сделать описание,
можно ли так профилировать и есть ли 'подводные камни' в профилировании?
Придумать как это решить!
Есть очень простое решение!
"""

from memory_profiler import profile

@profile
def my_decorator(func):
    def wrapper():
        func()
    return wrapper


def countDown(start, indent=0):
    print('-'*indent, '>', start)
    start = start - 1
    indent = indent + 1
    if start >= 0:
        # Рекурсивный вызов 'countDown', в которой
        # происходит печать строки, но только уже с
        # другими значениями, которые вычисляются выше
        countDown(start, indent)

my_decorator(countDown(5, 2))
'''При профилировании функций с рекурсией выводится каждая итерация в отдельную таблицу,
для того  что бы так не получалось необходимо использовать функцию оберткукк
Результат с использованием обертки(декоратора)
-- > 5
--- > 4
---- > 3
----- > 2
------ > 1
------- > 0
Filename: C:\учеба\Алгоритмы и структуры данных\6урок\Урок 6. Практическое задание\Урок 6. Практическое задание\task_3.py

Line #    Mem usage    Increment  Occurences   Line Contents
============================================================
    11     19.1 MiB     19.1 MiB           1   @profile
    12                                         def my_decorator(func):
    13     19.1 MiB      0.0 MiB           1       def wrapper():
    14                                                 print("До вызова функции.")
    15                                                 func()
    16                                                 print("После вызова функции.")
    17     19.1 MiB      0.0 MiB           1       return wrapper
'''