"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""
import random

div_number = random.randint(0,100)
trying = int(input('Угадайте загаданное число от 0 до 100: '))
def divine_number(div_number, trying, count = 1):
    if count == 10:
        print('Вы израсходовали все 10 попыток')
        return
    if trying > div_number:
        trying = int(input('Ваше число больше, чем загаданное. Повторите попытку: '))
        count += 1
    elif trying < div_number:
        trying = int(input('Ваше число меньше, чем загаданное. Повторите попытку: '))
        count += 1
    elif trying == div_number:
        print('Вы угадали загаданное число.')
        return
    return divine_number(div_number, trying, count)

divine_number(div_number, trying)