"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все цифры извлечены
Используем операции % //

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""
number = int(input('Введите число, которое требуется перевернуть: '))

def inverted(number, inv_num = ''):
    if number == 0:
        return int(inv_num)
    num = str(number % 10)
    inv_num += num
    number = number // 10
    return inverted(number, inv_num)

print(inverted(number))