"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

def summ(n, number=1, sum_n=0):
    sum_n += number
    number += 1
    if number == n:
        sum_n += number
        return sum_n == n*(n + 1)/2
    else:
        return summ(n, number, sum_n)

print(summ(999))