"""
Задание 5.*

Приведен наивный алгоритм нахождения i-го по счёту
простого числа (через перебор делителей).

Попробуйте решить эту же задачу,
применив алгоритм "Решето эратосфена" (https://younglinux.info/algorithm/sieve)

Подсказка:
Сравните алгоритмы по времени на разных порядковых номерах чисел:
10, 100, 1000
Опишите результаты, сделайте выводы, где и какой алгоритм эффективнее
Подумайте и по возможности определите сложность каждого алгоритма
"""
from timeit import timeit
from random import randint


def simple(i):
    """Без использования «Решета Эратосфена»"""
    count = 1
    n = 2
    while count <= i:
        t = 1
        is_simple = True
        while t <= n:
            if n % t == 0 and t != 1 and t != n:
                is_simple = False
                break
            t += 1
        if is_simple:
            if count == i:
                break
            count += 1
        n += 1
    return n


# i = int(input('Введите порядковый номер искомого простого числа: '))
# print(simple(i))


def eratosthenes(n):     # n - число, до которого хотим найти простые числа
    sieve = list(range(1000))
    sieve[1] = 0    # без этой строки итоговый список будет содержать единицу
    for i in sieve:
        if i > 1:
            for j in range(i + i, len(sieve), i):
                sieve[j] = 0
    sieve1 = [x for x in sieve if x != 0]
    return sieve1[n-1]


i = randint(1,100)
print (f'{i} простое число - {simple(i)}')
print (f'{i} простое число - {eratosthenes(i)} - найдено с решетом Эрастосфена')

print ('Результаты замеров:')
print (timeit('simple(i)','from __main__ import simple,i', number=10000))
print ('C применением решета Эрастосфена')
print (timeit('eratosthenes(i)','from __main__ import eratosthenes,i', number=10000))


"""
Выводы:
Реализована функция рассчета простого числа с использованием решета Эрастосфена
Чем больше рассчетное число, тем значительнее выигрывает алгоритм с использованием
решета Эрастосфена. Времы выполнения второго алгоритма в данном случае константно, т к 
идет составления списка всех простых чисел до 1000 и взятие числа по индексу
        
    Результаты:
        68 простое число - 337
        68 простое число - 337 - найдено с решетом Эрастосфена
        Результаты замеров:
        7.670069675
        C применением решета Эрастосфена
        1.8394738290000001
"""