"""
Задание 4.

Приведены два алгоритма. В них определяется число,
которое встречается в массиве чаще всего.

Сделайте профилировку каждого алгоритма через timeit

Попытайтесь написать третью версию, которая будет самой быстрой.
Сделайте замеры и опишите, получилось ли у вас ускорить задачу.
"""

from timeit import timeit
from statistics import mode


array = [1, 3, 1, 3, 4, 5, 1]


def func_1():
    m = 0
    num = 0
    for i in array:
        count = array.count(i)
        if count > m:
            m = count
            num = i
    return f'Чаще всего встречается число {num}, ' \
           f'оно появилось в массиве {m} раз(а)'


def func_2():
    new_array = []
    for el in array:
        count2 = array.count(el)
        new_array.append(count2)

    max_2 = max(new_array)
    elem = array[new_array.index(max_2)]
    return f'Чаще всего встречается число {elem}, ' \
           f'оно появилось в массиве {max_2} раз(а)'


"""
Первый вариант наиболее быстрый.
К сожалению, у меня не получилось ускорить.
Нужно было пересмотреть запись лекции, но приступил к выполнению поздно.
Не хватило времени, возможно получилось-бы)
"""


print('Результаты замеров алгоритма функции func_1:')
print(timeit('func_1()', globals=globals()))
print('Результаты замеров алгоритма функции func_2:')
print(timeit('func_2()', globals=globals()))
print('Результаты замеров алгоритма функции func_3:')
