"""
Задание 1.

Приведен код, который позволяет сохранить в
массиве индексы четных элементов другого массива

Сделайте замеры времени выполнения кода с помощью модуля timeit

Попробуйте оптимизировать код, чтобы снизить время выполнения
Проведите повторные замеры

Добавьте аналитику: что вы сделали и почему
"""
########################################################################################################################

from timeit import timeit


print(timeit("""

def func_1(nums):
    new_arr = []
    for i in range(len(nums)):
        if nums[i] % 2 == 0:
            new_arr.append(i)
    return new_arr

"""))


print(timeit("""

def better_func(nums):
    new_arr = [i for i in nums if i % 2 == 0]
    return new_arr

"""))

"""
     Уменьшил количество команд в итерации, заменил цикл на генератор, 
     что, в свою очередь, слегка увеличило скорость программы.    

"""
