"""
Задание 1.

Приведен код, который позволяет сохранить в
массиве индексы четных элементов другого массива

Сделайте замеры времени выполнения кода с помощью модуля timeit

Попробуйте оптимизировать код, чтобы снизить время выполнения
Проведите повторные замеры

Добавьте аналитику: что вы сделали и почему
"""
import timeit


def func_1(nums):
    new_arr = []
    for i in range(len(nums)):
        if nums[i] % 2 == 0:
            new_arr.append(i)
    return new_arr


def func_2(nums):
    new_arr = [i for i in nums if i % 2 == 0]
    return new_arr


print(timeit.timeit('func_1', setup='from __main__ import func_1', number=1000))
print(timeit.timeit('func_2', setup='from __main__ import func_2', number=1000))

'''
Я преобразовал код через использование генератора, так как он работает быстрее, чeм функция append
'''
