"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""
from collections import namedtuple

company = namedtuple('Company', 'company_name money')

comp_ = {}

total_profit = 0
num_comp = int(input('Введите количество фирм для расчета прибыли: '))
for i in range(num_comp):
    comp = company(
        company_name=input('Введите название фирмы: '),
        money=sum(map(int, input(f'Введите через пробел прибыль фирмы поквартально: ').split(' ')))
    )
    total_profit += comp.money
    comp_[comp.company_name] = comp.money
avg = total_profit / num_comp
print(f'Общая среднегодовая прибыль = {avg}')
for n, m in comp_.items():
    if m > avg:
        print(f'Прибыль {n}, выше среднего = {n}')
    else:
        print(f'Прибыль {n}, ниже среднего = {n}')

"""
Если можно на лекции привести реальный пример, когда работа с этой коллекцией была востребована.
"""