"""
2.	Написать программу сложения и умножения двух шестнадцатеричных чисел.
При этом каждое число представляется как массив, элементы которого это цифры числа.
Например, пользователь ввёл A2 и C4F. Сохранить их как [‘A’, ‘2’] и [‘C’, ‘4’, ‘F’] соответственно.
Сумма чисел из примера: [‘C’, ‘F’, ‘1’], произведение - [‘7’, ‘C’, ‘9’, ‘F’, ‘E’].

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections
Также попробуйте решить задачу вообще без collections и применить только ваши знания по ООП
(в частности по перегрузке методов)
"""
from collections import defaultdict
from functools import reduce

loc_dict = defaultdict(list)
num_1 = input('Введите первое значение: ').upper()
num_2 = input('Введите второе значение: ').upper()

loc_dict = num_1, num_2

print(loc_dict)
hex_int = [int(''.join(i), 16) for i in loc_dict]

sum_ = sum(hex_int)
mul = reduce(lambda x, y:  x * y, hex_int)

print(hex(sum_).upper()[2:])
print(hex(mul).upper()[2:])