"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""

from collections import namedtuple

Company = namedtuple('company', ['quarter_1', 'quarter_2', 'quarter_3', 'quarter_4'])
base_company = {}

n = int(input("Введите количество предприятий: "))
for i in range(n):
   name = input('Введите наименование предприятия: ')
   base_company[name] = Company(
       quarter_1=int(input('Введите объем продаж за 1 квартал: ')),
       quarter_2=int(input('Введите объем продаж за 2 квартал: ')),
       quarter_3=int(input('Введите объем продаж за 3 квартал: ')),
       quarter_4=int(input('Введите объем продаж за 4 квартал: '))
   )

profit_total = ()
for name, profit in base_company.items():
    profit_total += profit
print(f'Средняя прибыль всех предприятий за год = {sum(profit_total)/n}')

for name, profit in base_company.items():
    if sum(profit) > sum(profit_total)/n:
        print(f'Предприятие {name} имеет среднегодовую выручку выше среднего ')
    elif sum(profit) < sum(profit_total)/n:
        print(f'Предприятие {name} имеет среднегодовую выручку ниже среднего')








