"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""

from collections import namedtuple

def inp():
    a = int(input('Введите количество предприятий для расчета прибыли: '))
    data = dict()
    company = namedtuple('company', 'name income')
    for i in range(a):
        companies = company(name=input('Введите название предприятия: '),
                            income=sum(list(map(int, input('Через пробел введите прибыль данного предприятияза каждый квартал(Всего 4 квартала): ').split())))/4)
        data[companies.name] = companies.income

    average = sum(data.values())/2

    for key, value in data.items():
        if value > average:
            print(f'Капитализация {key} выше среднего - {value} vs {average}')
        elif value < average:
            print(f'Капитализация {key} ниже среднего - {value} vs {average}')
        else:
            print(f'Капитализация {key} равна среднему - {value} vs {average}')

inp()

