"""
1.	Пользователь вводит данные о количестве предприятий, их наименования
и прибыль за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля
collections
Для лучшее освоения материала можете даже сделать несколько решений этого
задания, применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""

from collections import namedtuple

try:
    amount = int(input("Введите количество предприятий для расчета прибыли: "))
except Exception as exc:
    print(exc)
else:
    new_firm = namedtuple('company', 'name average_profit')

    companies = []

    for i in range(1, amount + 1):
        name = input(f'Введите название {i} компании: ')
        q1, q2, q3, q4 = input('Введите прибыль компании за каждый квартал '
                               'через пробел: ').split(' ')
        average_profit = (float(q1) + float(q2) + float(q3) + float(q4)) / 4
        company = new_firm(name, average_profit)
        companies.append(company)
    average_profit_all = sum(c[1] for c in companies) / len(companies)
    print(f'Средняя годовая прибыль всех предприятий: {average_profit_all}')
    high_profit = [c[0] for c in companies if c[1] > average_profit_all]
    print(f'Предприятия, с прибылью выше среднего значения: {high_profit}')
    low_profit = [c[0] for c in companies if c[1] < average_profit_all]
    print(f'Предприятия, с прибылью ниже среднего значения: {low_profit}')

# я сделала одну проверку на введенные значения. По хорошему, нужно было бы
# сделать на все места, где должны быть числа, а не буквы, но это бы сильно
# раздуло код, поэтому я не стала - суть задания была не в этом
