"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""
from collections import namedtuple

COMP = namedtuple('Company', 'id name profit')
company_qty = int(input('Введите количество предприятий для расчета прибыли: '))
company_list = []

for i in range(company_qty):
    name = input(f'Введите название предприятия {i + 1}: ')
    profit = list(map(int, input('Через пробел введите прибыль данного '
                                 'предприятия за каждый квартал(Всего 4 квартала): ').split(' ')))
    company_list.append(COMP(
        id=i,
        name=name,
        profit=profit
    ))

sum_all = 0
for company in company_list:
    sum_all += sum(company.profit)

avarage_profit = sum_all / len(company_list)
upper_companies = list(filter(lambda x: sum(x.profit) > avarage_profit, company_list))
lower_companies = list(filter(lambda x: sum(x.profit) < avarage_profit, company_list))

print(f"Средняя годовая прибыль всех предприятий: {avarage_profit}")
print(f"Предприятия, с прибылью выше среднего значения: {', '.join([x.name for x in upper_companies])}")
print(f"Предприятия, с прибылью ниже среднего значения: {', '.join([x.name for x in lower_companies])}")
