"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""
from collections import namedtuple, Counter, defaultdict


def check(i):
    s = i.split()
    if len(s) != 4:
        return True
    return False


company = defaultdict(str)
attr = "first second third fourth"
h = Counter()

while True:
    company_name = input('Название предприятия: ')
    amount = input('Через пробел введите прибыль предприятия по каждому из кварталов: ')
    if check(amount):
        print('Вы ввели не все данные')
        continue
    s = namedtuple(company_name, attr)
    company[company_name] = s(*list(map(int, amount.split())))
    go = input('Для подсчета введите любой символ. Для продолжения заполнения "enter"')
    if len(go) > 0:
        break

for i in company:
    h[i] = company[i].first + company[i].second + company[i].third + company[i].fourth

res: float = sum(h.values()) / len(h.keys())

print(f'Средняя годовая прибыль всех предприятий: {res}')
for i in h:
    if h[i] >= res:
        print(f'Предприятия, с прибылью выше среднего: {i}')
    else:
        print(f'Предприятия, с прибылью ниже среднего: {i}')
