"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""
import collections as coll
base = coll.defaultdict(int)


def user_input():
    firm = input('Введите название фирмы или exit для выхода: ')
    if not base[firm]:
        if firm == 'exit':
            del base['exit']
            analyze()
        else:
            firm_val_str = input('Введите показатели прибыли через пробел: ').split()
            try:
                base[firm] = sum([int(x) for x in firm_val_str])
            except TypeError:
                print('Ошибка ввода!')
                user_input()
            user_input()
    else:
        print('Такая фирма уже занесена!')
        user_input()


def analyze():
    temp_list = [val for key, val in base.items()]
    avg_income = sum(temp_list) / len(temp_list)
    print(f'Средняя прибыль - {avg_income}')
    winners = [key for key, val in base.items() if val >= avg_income]
    losers = [key for key, val in base.items() if val < avg_income]
    print(f'Прибыль выше средней у {winners}')
    print(f'Прибыль ниже средней у {losers}')


user_input()