"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""
from collections import namedtuple


Company = namedtuple('Company', 'name profit')
count = int(input('Введите количество предприятий для расчета прибыли: '))
profit = {}
avgprofit = 0
for i in range(count):
    firm = Company(
        name=input('Введите название предприятия: '),
        profit=input('через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 квартала): '))
    temp = [int(x) for x in firm.profit.split()]
    avgprofit += sum(temp)
    profit[firm.name] = sum(temp)
avgprofit = avgprofit / count
print(profit, avgprofit)

upavg_profit = ''
lowavg_profit = ''
for key, value in profit.items():
    if value > avgprofit:
        upavg_profit += key + ' '
    else:
        lowavg_profit += key + ' '
print(f'Средняя годовая прибыль всех предприятий: {avgprofit}')
print(f'Предприятия, с прибылью выше среднего значения: {upavg_profit}')
print(f'Предприятия, с прибылью ниже среднего значения: {lowavg_profit}')
