"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""
from collections import namedtuple

QUARTERS = 4
companies = namedtuple('company', ['name', 'quarters', 'profit'])
all_companies = set()

qty_comp = int(input('Введите количество предприятий для расчета прибыли: '))
total_profit = 0

for i in range(1, qty_comp + 1):
    profit = 0
    quarters = []
    name = input(f'Введите название предприятия {i}: ')

    for j in range(QUARTERS):
        quarters.append(int(input(f'введите прибыль данного предприятия за {j + 1} квартал: ')))
        profit += quarters[j]

    plants = companies(name=name, quarters=tuple(quarters), profit=profit)

    all_companies.add(plants)
    total_profit += profit

average = total_profit / qty_comp

print(f'Средняя годовая прибыль всех предприятий: {average}')


print(f'\nПредприятия с прибылью выше среднего:')
for plants in all_companies:
    if plants.profit > average:
        print(f'{plants.name} заработала {plants.profit}')

print(f'\nПредприятия с прибылью ниже среднего:')
for plants in all_companies:
    if plants.profit < average:
        print(f'{plants.name} заработала {plants.profit}')

