"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""
from collections import namedtuple


def firms():
    n = int(input("Введите количество предприятий для расчета прибыли: "))

    coll_list = namedtuple("company",
                           "name quarter_1 quarter_2 quarter_3 quarter_4")

    average = {}

    for i in range(n):
        company = coll_list(
            name=input("Введите название предприятия:"),
            quarter_1=int(input("прибыль за 1ый квартал: ")),
            quarter_2=int(input("прибыль за 2ый квартал: ")),
            quarter_3=int(input("прибыль за 3ый квартал: ")),
            quarter_4=int(input("прибыль за 4ый квартал: ")),
        )
        average[company.name] = (company.quarter_1 + company.quarter_2
                                 + company.quarter_3 + company.quarter_4) / 4
    result_average = 0

    for i in average.values():
        result_average += i
    result_average = result_average / n

    for key, value in average.items():
        if value > result_average:
            print(f'{key}  - средняя прибыль предприятия за год '
                  f'{value} - выше среднего')

        elif value < result_average:
            print(f'{key}  - средняя прибыль предприятия за год '
                  f'{value} - ниже среднего')
        else:
            print(f'{key}  - средняя прибыль предприятия за год '
                  f'{value} - средняя прибыль ')


firms()
