"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""
from collections import namedtuple

base = namedtuple('firm_base', 'name profit_1 profit_2 profit_3 profit_4')
average_profit = {}
count = int(input('Введите количество предприятий: '))
for i in range(count):
    firm = base(
        name=input('Введите название компании: '),
        profit_1=int(input('Введите прибыль за 1 квартал: ')),
        profit_2=int(input('Введите прибыль за 2 квартал: ')),
        profit_3=int(input('Введите прибыль за 3 квартал: ')),
        profit_4=int(input('Введите прибыль за 4 квартал: '))
    )
    average_profit[firm.name] = (firm.profit_1 + firm.profit_2 + firm.profit_3 + firm.profit_4) / 4
total_profit = 0
for val in average_profit.values():
    total_profit += val
total_profit = total_profit / count
print(f'Средняя прибыль - {total_profit}')
for key, val in average_profit.items():
    if val > total_profit:
        print(f'Компания {key} имеет среднюю прибыль выше седнего')
    elif val < total_profit:
        print(f'Компания {key} имеет среднюю прибыль ниже седнего')
    elif val == total_profit:
        print(f'Компания {key} имеет среднюю прибыль')

