"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""
def set_org(data: str):
    from collections import namedtuple

    org_template = namedtuple('Organisation', 'name qrt_1 qrt_2 qrt_3 qrt_4')
    data = data.split()
    if len(data) != 5:
        print('Введённые данные некорректны.')
        return
    try:
        org = org_template(name=data[0], qrt_1=int(data[1]), qrt_2=int(data[2]),
                           qrt_3=int(data[3]), qrt_4=int(data[4]))
        return org
    except ValueError:
        print('Введённые данные некорректны.')
        return

def stat(org_list: list):
    print(org_list)
    if not org_list:
        print('Нет предприятий для обработки.')
        return
    orgs = {org.name: (org.qrt_1 + org.qrt_2 + org.qrt_3 + org.qrt_4)
            for org in org_list}
    avg = sum(orgs.values()) / len(orgs)
    print(f'Средняя годовая прибыль всех предприятий: {avg}.')
    print('Предприятия, с прибылью выше среднего значения:')
    for k,v in orgs.items():
        if v < avg:
            print(k, end=' ')
    print()
    print('Предприятия, с прибылью ниже среднего значения:')
    for k,v in orgs.items():
        if v > avg:
            print(k, end=' ')

if __name__ == '__main__':
    org_list = []
    while True:
        data = input('Введите через пробел название предприятия и прибыль за '
                     'каждый квартал года данного предприятия.\nЕсли хотите '
                     'прекратить ввод, напишите "stop": ')
        if data == 'stop':
            break
        elif set_org(data):
            org_list.append(set_org(data))
    stat(org_list)