"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""

import collections
import random

company_count = '5'
companies = collections.defaultdict(list)
for i in range(int(company_count)):
    name = f'Company_{i}'
    profit = [random.randint(0, 100) for i_2 in range(4)]
    # print(profit)
    companies[name] = profit

# print(companies)

total_profit = 0
for p in companies.values():
    for i in p:
        total_profit += int(i)

print(f'Средняя прибыль компаний составила {total_profit / int(company_count)}')
companies_max = []
companies_min = []
for n, p in companies.items():
    if sum(p) > total_profit / int(company_count):
        companies_max.append(n)
        # print(sum(p))
    else:
        companies_min.append(n)
        # print(sum(p))

print(f'У компаний {companies_min} прибыль ниже среднего')
print(f'У компаний {companies_max} прибыль выше среднего')

