"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""

from collections import namedtuple

firm = namedtuple('Firms', 'firm_name quart_1 quart_2 quart_3 quart_4 total')
firms = []

n = int(input('Введите количество предприятий для расчета прибыли: '))


for _ in range(n):
    firm_name = input('Введите название предприятия: ')
    profit = input('через пробел введите прибыль данного предприятия за каждый квартал: ').split()
    profit = list(map(int, profit))
    firms.append(firm(firm_name, profit[0], profit[1], profit[2], profit[3], sum(profit)))

total_profit = 0
for i in firms:
    total_profit += i.total
avg_profit = round(total_profit / len(firms), 2)
print(f'Средняя годовая прибыль всех предприятий: {avg_profit}')
print('Предприятия, с прибылью выше среднего значения: ', end='')
for i in firms:
    if i.total > avg_profit:
        print(i.firm_name, end=' ')
print('\nПредприятия, с прибылью ниже среднего значения: ', end='')
for i in firms:
    if i.total < avg_profit:
        print(i.firm_name, end=' ')
