"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""

from collections import namedtuple


def resume_1():
    resume = namedtuple('resume', 'name values profit')
    n = int(input("Введите количество предприятий "))
    list_resume = []
    for j in range(n):
        name = input("Введите название предприятия ")
        l = input("Введите доходность поквартально, через пробел ")
        # l = f'{(j+1)*10} {(j+1)*10} {(j+1)*10} {(j+1)*10}'
        while l:
            try:
                list_resume.append(resume._make([name, l, sum(map(int, l.split())) / 4]))
                l = False
            except ValueError:
                print("Доходность должна содержать 4 цифры через пробел\nПожалуйста еще раз")
                l = input("Введите доходность поквартально, через пробел ")

    average_profit = sum(i.profit for i in list_resume) / len(list_resume)
    print("\nСредняя годовая прибыль всех предприятий: ", average_profit)
    print("Предприятия, с прибылью выше среднего значения: ",
          *[i.name for i in list_resume if i.profit > average_profit])
    print("Предприятия, с прибылью ниже среднего значения: ",
          *[i.name for i in list_resume if i.profit < average_profit])


resume_1()


"""
Работа resume_1():
Введите количество предприятий 3
Введите название предприятия a
Введите доходность поквартально, через пробел 4 4 4 4
Введите название предприятия b
Введите доходность поквартально, через пробел 5 5 5 5
Введите название предприятия c
Введите доходность поквартально, через пробел 6 6 6 6

Средняя годовая прибыль всех предприятий:  5.0
Предприятия, с прибылью выше среднего значения:  c
Предприятия, с прибылью ниже среднего значения:  a

"""