"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""

from collections import namedtuple


companies = []
company = namedtuple("Company", "name profits average")
while True:
    company_name = input(f"Введите название компании {len(companies) + 1} (или просто нажмите Enter для завершения ввода): ")
    if company_name == '':
        break
    while True:
        try:
            profits_str = input(f"Введите прибыли по-квартально ч-з пробел для компании {company_name}: ").split(' ')
            if len(profits_str) == 4:
                profits = [int(el) for el in profits_str]
                break
            raise Exception
        except:
            print("Не правильный ввод, введите снова!")
    companies.append(company(
        name=company_name,
        profits=profits,
        average=sum(profits)/4
    ))

average_all = sum([c.average for c in companies]) / len(companies)
print(f"Средняя годовая прибыль всех предприятий: {round(average_all, 2)}")
print(f"Предприятия, с прибылью выше или равной среднего значения: {', '.join([c.name for c in companies if c.average >= average_all])}\n")
print(f"Предприятия, с прибылью ниже среднего значения: {', '.join([c.name for c in companies if c.average < average_all])}")
