"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""

from collections import defaultdict


def much_smaller(user_dict, average):
    """
    Функция принимает defaultdict предприятий и среднее годовое значение прибыли всех предприятий
    Возвращает наименования в виде 2ух списков, 1) больше, 2) меньши среднего значения прибыли
    """
    much = []
    smaller = []
    for name_ent, profit in user_dict.items():
        if profit > average:
            much.append(name_ent)
        else:
            smaller.append(name_ent)
    return much, smaller


enterprise_profit = defaultdict(int)
count = int(input('Введите количество предприятий для расчета прибыли: '))
# цикл фо для заполнения словаря предприятие:прибыль
for i in range(count):
    sum_ = 0
    name = input('Введите название предприятия: ')
    p = input("через пробел введите прибыль данного предприятия"
              "\nза каждый квартал(Всего 4 квартала):").split()
    # высчитываем сумму за весь год
    for i in p:
        sum_ += int(i)
    enterprise_profit[name] = sum_

print(enterprise_profit)
# прибль всех предприятий за год
sum_ = 0
for n, p in enterprise_profit.items():
    sum_ += p
print('Средняя годовая прибыль всех предприятий: ', sum_/count)

# функция возвращает больше/меньше
t = much_smaller(enterprise_profit, sum_/count)
print('Предприятия, с прибылью выше среднего значения: ', t[0])
print('Предприятия, с прибылью ниже среднего значения: ', t[1])
