"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""

import collections
from numpy import mean

company = collections.namedtuple('profit', 'company one two three four')

def go_():
    nCompany = input('Введите кол-во предприятий: ')
    all_company = []
    for i in range(int(nCompany)):
        temp_str = input('Через пробел введите: название и квартальные прибыли для каждой: ')
        return_company = company(company = temp_str.split(' ')[0],
                                one=temp_str.split(' ')[1],
                                two=temp_str.split(' ')[2],
                                three=temp_str.split(' ')[3],
                                four=temp_str.split(' ')[4])
        all_company.append(return_company)
    return all_company

def out_():
    list_company = go_()
    profit = []
    for i in list_company:
        for ii in i[1:]:
            profit.append(int(ii))
    return_str = f'средняя годовая прибыль всех компаний = {mean(profit)}; \
    \n меньше годовой: {min(list_company)[0]}; \
    \n больше годовой: {max(list_company)[0]};'
    return return_str

###
print(out_())