"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""
from collections import namedtuple


count = int(input("Введите количество предприятий для расчета прибыли: "))
company = namedtuple('company', 'all_profit_ntuple')
companies = {}

for i in range(count):
    name = input("Введите название предприятия: ")
    year_profit = input("через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 квартала): ")
    year_profit_el = [int(el) for el in year_profit.split()]
    year_profit = sum(year_profit_el)
    companies[name] = company(year_profit)


def avg_profit(profit_dict):
    i = 0
    for el in profit_dict.values():
        i += el.all_profit_ntuple
    return i / len(profit_dict)

all_avg_profit = avg_profit(companies)


print(f'Средняя годовая прибыль всех предприятий: {all_avg_profit}')

for key, value in companies.items():
    if value.all_profit_ntuple > all_avg_profit:
        print(f'{key} - Предприятия, с прибылью выше среднего значения')
    elif value.all_profit_ntuple < all_avg_profit:
        print(f'{key} - Предприятия, с прибылью ниже среднего значения')
    elif value.all_profit_ntuple == all_avg_profit:
        print(f'{key} - средняя прибыль')
