"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""
from collections import namedtuple as nt

COMP = nt('Company', ('name period_1 period_2 period_3 period_4'))

comp_num = int(input('Введите число компаний: '))

companies = {}

for i in range(comp_num):
    company = COMP(name=input('Введите название компании: '),
                   period_1=int(input('Введите прибыль за первый квартал: ')),
                   period_2=int(input('Введите прибыль за второй квартал: ')),
                   period_3=int(input('Введите прибыль за третий квартал: ')),
                   period_4=int(input('Введите прибыль за четвертый квартал: ')))
    companies[company.name] = (company.period_1 + company.period_2 +
                               company.period_3 + company.period_4) / 4

aver_prof = 0
for comp_prof in companies.values():
    aver_prof += comp_prof
aver_prof /= comp_num

for comp, prof in companies.items():
    if prof > aver_prof:
        print(f"Прибыль {comp} выше средней по компаниям")
    elif prof < aver_prof:
        print(f"Прибыль {comp} выше средней по компаниям")
    elif prof == aver_prof:
        print(f"Прибыль {comp} выше средней по компаниям")
