"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""
from collections import Counter, deque

n = int(input('Введите количество предприятий для расчета прибыли: '))
all_profit = deque()
comp = {}
while n != 0:
    company_name = input('Введите название предприятия: ')
    profit_list = input('через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 квартала):').split()
    profit = []
    for el in profit_list:
        profit.append(int(el))
    comp[company_name] = sum(profit)
    all_profit.appendleft(sum(profit))
    n -= 1
average_profit = sum(all_profit) / sum(Counter(all_profit).values())
good_company = deque()
bad_company = deque()
for key in comp:
    if comp[key] > average_profit:
        good_company.appendleft(key)
    else:
        bad_company.appendleft(key)
print(f'Средняя годовая прибыль всех предприятий: {average_profit}')
print(f'Предприятия, с прибылью выше среднего значения: {good_company}')
print(f'Предприятия, с прибылью ниже среднего значения: {bad_company}')
