"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Фирма_1
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Фирма_2
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Фирма_1

Предприятия, с прибылью ниже среднего значения: Фирма_2
"""
from collections import namedtuple


if __name__ == '__main__':
    firm = namedtuple('Firms', 'firm_name i ii iii iv year')
    firms = []
    count = int(input('Введите количество предприятий для расчета прибыли: '))
    for _ in range(count):
        firm_name = input('Введите название предприятия: ')
        profit = input('через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 квартала): ')
        profits = profit.split(' ')
        profits = list(map(int, profits))
        firms.append(firm(firm_name, profits[0], profits[1], profits[2], profits[3], sum(profits)))
    print(firms)
    all_profit = 0
    for i in firms:
        all_profit += i.year
    avg_profit = all_profit / len(firms)
    print(f'Средняя годовая прибыль всех предприятий: {avg_profit}')
    print('Предприятия, с прибылью выше среднего значения: ', end='')
    for i in firms:
        if i.year > avg_profit:
            print(i.firm_name, end=' ')
    print('\nПредприятия, с прибылью ниже среднего значения: ', end='')
    for i in firms:
        if i.year < avg_profit:
            print(i.firm_name, end=' ')
