"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""

from collections import namedtuple


def companies(amount=int(input('Введите количество предприятий для расчета прибыли: '))):
    pull = []
    company = namedtuple('Company', 'name revenue')
    avg_rev = 0
    while amount:
        name = input('Введите название предприятия: ')
        revenue = input('через пробел введите прибыль данного предприятия\n'
                        'за каждый квартал(Всего 4 квартала): ').split(' ')
        revenue = [int(elem) for elem in revenue]
        pull.append(company(name, sum(revenue)))
        amount -= 1
    for elem in pull:
        avg_rev += elem.revenue
    avg_rev = avg_rev/len(pull)
    print(f'Средняя годовая прибыль всех предприятий: {avg_rev}')
    print('Предприятия, с прибылью выше среднего значения: ')
    [print(elem.name) for elem in pull if elem.revenue > avg_rev]
    print('Предприятия, с прибылью ниже среднего значения: ')
    [print(elem.name) for elem in pull if elem.revenue < avg_rev]


companies()
