"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235    346159

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34    956

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""
from collections import namedtuple

tuple_company_info = namedtuple('Company', 'name profit')
comp_num = int(input('Введите количество предприятий для расчета прибыли: '))
list_of_companies = []
profit = []
for i in range(comp_num):
    company_info = tuple_company_info(
        name=input('Введите название предприятия: '),
        profit=sum([int(i) for i in input('Через пробел введите прибыль данного предприятия за 4 квартала: ').split()])
    )
    list_of_companies.append(company_info)
    profit.append(company_info.profit)


average_profit = sum(profit) / comp_num
max_profit = [i for i in list_of_companies if i.profit > average_profit]
min_profit = [i for i in list_of_companies if i.profit < average_profit]

print(f'Средняя годовая прибыль всех предприятий: {average_profit}')
print(f'Предприятия, с прибылью выше среднего значения: {max_profit}')
print(f'Предприятия, с прибылью ниже среднего значения: {min_profit}')
