"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""
# У меня ничего не получилось.. Вы во время урока говорили, что надо делать через именованные кортежи, но я не понимаю,
# как создавать такой кортеж (имя, сумма), если у нас даже количество таких пар не известно...
# Все, что я смогла придумать это список из именнованных кортежей...

from collections import namedtuple


Profit = namedtuple('Profit', 'Name Money')
count = int(input('Введите количество предприятий для расчета прибыли: '))
marks = list()
all_money = 0
for i in range(count):
    name = input('Введите название предприятия: ')
    input_money = input('через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 квартала): ')
    money = (sum(int(num) for num in input_money.split(' ')))
    all_money += money
    marks.append(Profit(name, money))


average_money = all_money / count
print('Средняя годовая прибыль всех предприятий: ', average_money)

# А вот вывод предприятий я вообще не смогла сделать, потому что как-то не так вызываю значение...
# Я запуталась. :( Жду разбор ДЗ

print('Предприятия, с прибылью выше среднего значения: ')
for i in marks:
    if Profit.Money > average_money:
        print(Profit.Name)

print('Предприятия, с прибылью ниже среднего значения: ')
for i in marks:
    if Profit.Money < average_money:
        print(Profit.Name)
