"""
2.	Написать программу сложения и умножения двух шестнадцатеричных чисел.
При этом каждое число представляется как массив, элементы которого это цифры числа.
Например, пользователь ввёл A2 и C4F. Сохранить их как [‘A’, ‘2’] и [‘C’, ‘4’, ‘F’] соответственно.
Сумма чисел из примера: [‘C’, ‘F’, ‘1’], произведение - [‘7’, ‘C’, ‘9’, ‘F’, ‘E’].

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections
Также попробуйте решить задачу вообще без collections и применить только ваши знания по ООП
(в частности по перегрузке методов)
"""
import collections
import functools


def calc_hexadecimal_num(n):
    nums = collections.defaultdict(list)
    for i in range(n):
        val = input(f'Введите {i + 1} шестнадцатиричное число: ')
        nums[f'{i + 1}-{val}'] = list(val)

    gen = [int(''.join(i), 16) for i in nums.values()]
    sum_num = sum(gen)
    product_num = functools.reduce(lambda a, b: a * b, gen)

    print(f'Сумма = {list("%x" % sum_num)}')
    print(f'Произведение =  {list("%x" % product_num)}')


calc_hexadecimal_num(2)
