"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""

from collections import namedtuple

amt = int(input('Введите количество предприятий для расчета прибыли: '))
nmdtpl = namedtuple('companies', 'company profit')
tpl_lst = []
avg_profit = 0

while amt > 0:
    sum = 0
    company = input('Введите название предприятия: ')
    profit = input('через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 квартала): ').split()
    for el in profit:
        sum += int(el)
    tpl_stats = nmdtpl(company, sum)
    tpl_lst.append(tpl_stats)
    avg_profit += tpl_stats.profit/amt
    amt -= 1

print(f'Средняя годовая прибыль всех предприятий: {avg_profit}')
max_profit_companies = []
min_profit_companies = []
for company in tpl_lst:
    if company.profit >= avg_profit:
        max_profit_companies.append(company.company)
    else:
        min_profit_companies.append(company.company)

print(f"Предприятия, с прибылью выше среднего значения: {', '.join(max_profit_companies)}")
print(f"Предприятия, с прибылью ниже среднего значения: {', '.join(min_profit_companies)}")
