"""
Задача 3.
В соответствии с документацией Python,
deque – это обобщение стеков и очередей.
Вот основное правило: если вам нужно что-то быстро дописать или вытащить, используйте deque.
Если вам нужен быстрый случайный доступ, используйте list.

Задача: создайте простой список (list) и очередь (deque).
Выполните различные операции с каждым из объектов.
Сделайте замеры и оцените, насколько информация в документации
соответствует дейстивтельности.
"""

import collections

NEW_DICT = {'a': 1, 'b': 2, 'c': 3}
print(NEW_DICT)
my_key = input(f'Введите ключ из {list(NEW_DICT.keys())} предложенных ==> ')
NEW = NEW_DICT.get(my_key)
print(NEW)

NEW_DICT = collections.OrderedDict([('a', 1), ('b', 2), ('c', 3)])
print(NEW_DICT)
