"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""

from collections import defaultdict


comp_dict = defaultdict(int)
companies = int(input('[?] Введите количество предприятий для расчета прибыли: '))
for numb in range(companies):
    name = input(f'\n[{numb + 1}] Введите название предприятия: ')
    for one_profit in input(f'[?] Введите прибыль за 4 квартала: ').split():
        comp_dict[name] += int(one_profit)
        comp_dict['common_profit'] += int(one_profit)

average_profit = comp_dict["common_profit"] / companies
print(f'\n[=] Средняя годовая прибыль всех предприятий: {round(average_profit, 2)}')

top_companies = [name for name in comp_dict if name != "common_profit" and comp_dict[name] > average_profit]
print(f'[>] Предприятия, с прибылью выше среднего значения: {", ".join(top_companies)}')

worst_companies = [name for name in comp_dict if name != "common_profit" and comp_dict[name] < average_profit]
print(f'[>] Предприятия, с прибылью ниже среднего значения: {", ".join(worst_companies)}')
