"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""

from collections import namedtuple

Companies = namedtuple('Companies', 'name profit')
companies_total = int(input('Сколько всего предприятий:'))
total_profit = 0
companies_info = []

for i in range(companies_total):
    name = input(f'Введите название компании под номером {i + 1}: ')
    quarter_1 = float(input('Введите её прибыль за 1-ый квартал: '))
    quarter_2 = float(input('Введите её прибыль за 2-ой квартал: '))
    quarter_3 = float(input('Введите её прибыль за 3-ий квартал: '))
    quarter_4 = float(input('Введите её прибыль за 4-ый квартал: '))
    profit = (quarter_1 + quarter_2 + quarter_3 + quarter_4)
    companies_info.append(Companies(name, profit))
    total_profit += profit

avg_profit = total_profit / companies_total

print('Компании с годовой прибылью выше среднего: ')

for i in range(companies_total):
    if avg_profit < companies_info[i].profit:
        print(companies_info[i].name)

print('Компании с годовой прибылью выше среднего: ')

for i in range(companies_total):
    print('Компании с годовой прибылью ниже среднего: ')
    if avg_profit > companies_info[i].profit:
        print(companies_info[i].name)
