"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""
from collections import defaultdict

if __name__ == '__main__':
    q = int(input('Введите количество предприятий: '))
    my_dic = defaultdict(list)
    while q > 0:
        st_name = input('Введите наименование предприятия: ')
        st_s = [int(el) for el in input('Через пробел введите прибыль за каждый квартал года (всего 4): ').split()]
        my_dic[st_name] = st_s
        q -= 1
    my_dic_mid = defaultdict(int)
    mid_all = 0
    for k, v in my_dic.items():
        my_dic_mid[k] = sum(v)
        mid_all += sum(v)
    mid_all = sum(my_dic_mid.values()) / len(my_dic_mid.keys())
    print(f'Средняя годовая прибыль всех предприятий: {mid_all}')
    print(f'Предприятия, с прибылью выше среднего значения: {" ".join([k for k, v in my_dic.items() if sum(v) > mid_all])}')
    print(f'Предприятия, с прибылью ниже среднего значения: {" ".join([k for k, v in my_dic.items() if sum(v) < mid_all])}')
