"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""


"""Видимо, я тупой, но совсем не понимаю, как тут можно применить модуль collections так, чтобы сделать проще. 
Решил по старинке, стандартным словарём."""

company_number = int(input("Введите количество компаний: "))
companies = {}
max_proseed = 0
for i in range(company_number):
    cname = input("Введите название компании: ")
    cproseed_one = int(input("Введите выручку за первый квартал: "))
    cproseed_two = int(input("Введите выручку за второй квартал: "))
    cproseed_three = int(input("Введите выручку за третий квартал: "))
    cproseed_four = int(input("Введите выручку за четвертый квартал: "))
    companies[cname] = (cproseed_one, cproseed_two, cproseed_three, cproseed_four)
    cmax = (cproseed_one + cproseed_two + cproseed_three + cproseed_four) / 4
    companies[cname] = cmax
b = companies.values()
for j in b:
    if max_proseed <= j:
        max_proseed = j
for k, v in companies.items():
    if v == max_proseed:
        print(f' лучший показатель у компании {k}!')
