"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""
from collections import namedtuple
from numpy import mean
company_card = namedtuple('company_card', 'name profit_1 profit_2 profit_3 profit_4')
companies = [company_card('Рога', 235, 345634, 55, 235), company_card('Копыта', 345, 34, 543, 34)]
average_global = mean([mean([company.profit_1, company.profit_2, company.profit_3, company.profit_4])
                  for company in companies])
for company in companies:
    in_total = mean([company.profit_1, company.profit_2, company.profit_3, company.profit_4])
    if in_total > average_global:
        print(f'у {company.name} результат выше среднего')
    elif in_total < average_global:
        print(f'у {company.name} результат ниже среднего')
    else:
        print(f'у {company.name} средние результаты')
