"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.
Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections
Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235
Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34
Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога
Предприятия, с прибылью ниже среднего значения: Копыта
"""

from collections import namedtuple

n = int(input('Введите количество предприятий для расчета прибыли: '))
count = n
tpl = namedtuple('companies', 'company profit')
tpl_lst = []
average_profit = 0

while count > 0:
    sum = 0
    company = input('Введите название предприятия: ')
    profit = input(
        'через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 квартала): '
    ).split()
    for el in profit:
        sum += int(el)
    tpl_parts = tpl(company, sum)
    print(tpl_parts)
    tpl_lst.append(tpl_parts)
    average_profit += tpl_parts.profit / n
    count -= 1

print(f'Средняя годовая прибыль всех предприятий: {average_profit}')
max_profit_companies = []
min_profit_companies = []
for company in tpl_lst:
    if company.profit >= average_profit:
        max_profit_companies.append(company.company)
    else:
        min_profit_companies.append(company.company)

print(
    f"Предприятия, с прибылью выше среднего значения: {', '.join(max_profit_companies)}"
)
print(
    f"Предприятия, с прибылью ниже среднего значения: {', '.join(min_profit_companies)}"
)