"""
2.	Написать программу сложения и умножения двух шестнадцатеричных чисел.
При этом каждое число представляется как массив, элементы которого это цифры числа.
Например, пользователь ввёл A2 и C4F. Сохранить их как [‘A’, ‘2’] и [‘C’, ‘4’, ‘F’] соответственно.
Сумма чисел из примера: [‘C’, ‘F’, ‘1’], произведение - [‘7’, ‘C’, ‘9’, ‘F’, ‘E’].

Подсказка:
a Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
b Для лучшее освоения материала !можете! даже сделать несколько решений этого задания,
  применив несколько коллекций из модуля collections
c Также попробуйте решить задачу вообще без collections и применить только ваши знания по ООП
  (в частности по перегрузке методов)
"""

from collections import deque, namedtuple


def hexadecimal():
    nums1 = deque(input('Введите шестнадцатеричное число, '
                        '(шестнадцатеричное число состоит из цифр от 0 до 9 и букв A, B, C, D, E, F):\n').upper())
    nums2 = deque(input('Введите второе шестнадцатеричное число, '
                        '(шестнадцатеричное число состоит из цифр от 0 до 9 и букв A, B, C, D, E, F):\n').upper())
    o = '0x'
    nums1.appendleft(o)
    nums2.appendleft(o)
    try:
        ten_nums1 = int(''.join(nums1), 16)
        ten_nums2 = int(''.join(nums2), 16)
    except ValueError:
        return 'шестнадцатеричное число может содержать только цифры от 0 до 9 и буквы A, B, C, D, E, F'
    nums1.popleft()
    nums2.popleft()
    sum_result = hex(ten_nums1 + ten_nums2).upper()
    m_result = hex(ten_nums1 * ten_nums2).upper()
    return f'Первое шестнадцатеричное число: {list(nums1)}\n' \
           f'Второе шестнадцатеричное число: {list(nums2)}\n' \
           f'Сумма чисел равна: {list(deque(sum_result[2:]))}\n' \
           f'Произведение чисел: {list(deque(m_result[2:]))}'


print(hexadecimal())
"""
результат работы программы:

Введите шестнадцатеричное число, (шестнадцатеричное число состоит из цифр от 0 до 9 и букв A, B, C, D, E, F):
a2s
Введите второе шестнадцатеричное число, (шестнадцатеричное число состоит из цифр от 0 до 9 и букв A, B, C, D, E, F):
a2g
шестнадцатеричное число может содержать только цифры от 0 до 9 и буквы A, B, C, D, E, 

Введите шестнадцатеричное число, (шестнадцатеричное число состоит из цифр от 0 до 9 и букв A, B, C, D, E, F):
a2
Введите второе шестнадцатеричное число, (шестнадцатеричное число состоит из цифр от 0 до 9 и букв A, B, C, D, E, F):
c4f
Первое шестнадцатеричное число: ['A', '2']
Второе шестнадцатеричное число: ['C', '4', 'F']
Сумма чисел равна: ['C', 'F', '1']
Произведение чисел: ['7', 'C', '9', 'F', 'E']
"""

