"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""
from collections import namedtuple

total_profits = {}
infra_average = []
supra_average = []
# название кортежа, значения
companies = namedtuple('company', 'profit1 profit2 profit3 profit4')
n = int(input('Введите количество предприятий для расчета прибыли '))
# Создаем шаблон  именнованного кортежа
for i in range(n):
    name = input('Введите название компании ')
    profit = input('Введите прибыль за 4 квартала через пробел ')
    company = companies(profit1=int(profit.split()[0]), profit2=int(profit.split()[1]), profit3=int(
        profit.split()[2]), profit4=int(profit.split()[3]))
    total_profits[name] = (company.profit1 + company.profit2 +
                           company.profit3 + company.profit4) / 4  # Ключ н/компании : значение/среднее/ариф.

average_profit = sum(total_profits.values()) / len(total_profits.values())
# средняя годовая прибыль всех к.
print(f'Средняя прибыль всех компаний за 4 квартала - {average_profit}')

for key, value in total_profits.items():  # ключ,значение выбираем value
    if value < average_profit:
        infra_average.append(key)  # добавляем ключи(имена)
    else:
        supra_average.append(key)

print(f'Предприятия с прибылью ниже среднего - {", ".join(infra_average)}')
print(f'Предприятия с прибылью выше среднего - {", ".join(supra_average)}')
