"""
Задача 3.
В соответствии с документацией Python,
deque – это обобщение стеков и очередей.
Вот основное правило: если вам нужно что-то быстро дописать или вытащить, используйте deque.
Если вам нужен быстрый случайный доступ, используйте list.

Задача: создайте простой список (list) и очередь (deque).
Выполните различные операции с каждым из объектов.
Сделайте замеры и оцените, насколько информация в документации
соответствует дейстивтельности.
"""

from collections import deque
import cProfile


def l(i):
    l = ['0', '1', '2', '3', '4', '5', '6']
    while i:
        l.insert(0, '9')
        i -= 1


def d(i):
    l = deque('0123456')
    while i:
        l.appendleft('9')
        i -= 1


cProfile.run('l(100000)')

cProfile.run('d(100000)')
"""
здесь лист выполняется 
1.560 seconds
а декуе выполняется
 0.027 seconds


"""