"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""
from collections import namedtuple

def averageprofit():
    count_companies = int(input('Введите количество предприятий для расчета прибыли: '))
    t = {}
    c = namedtuple('Companies', 'company cost1 cost2 cost3 cost4')
    for i  in range(count_companies):
        company = input('Введите название организации: ')
        costs = input('Введите через пробел прибыль данной организации за каждый квартал(Всего 4 квартала): ').split(' ')
        if len(costs) == 4:
            comp = c(company=company, cost1=int(costs[0]), cost2=int(costs[1]), cost3=int(costs[2]), cost4=int(costs[3]))
            t[comp.company] = (comp.cost1 + comp.cost2 + comp.cost3 + comp.cost4) / 4
        else:
            print("Вы ввели неверное количество значений")

    all_costs = 0
    for value in t.values():
        all_costs += value
    all_costs /= count_companies
    print(f'Средняя годовая прибыль всех предприятий равна {all_costs}')

    for key, value in t.items():
        if value > all_costs:
            print(f'Предприятия, с прибылью выше среднего значения: {key}')
        elif value < all_costs:
            print(f'Предприятия, с прибылью ниже среднего значения: {key}')

averageprofit()


