"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""
from collections import namedtuple

def class_nametuple(id):
    name = input('Введите название предприятия: ')
    profit = input('Через пробел введите прибыль данного предприятия за каждый квартал '
                '(Всего 4 квартала): ')
    aver = sum([int(el) for el in profit.split()]) / len([int(el) for el in profit.split()])
    Company = namedtuple('Company', 'id name_company profit_company aver_company')
    COMPANY = Company(id, name, profit, aver)
    return COMPANY

num = int(input('Введите количество предприятий для расчета прибыли: '))

# Формируем словарь из компаний
sum_profit = 0
company_dict = {}
for i in range(1, num+1):
    company = class_nametuple(i)
    company_dict[i] = company
    sum_profit += company.aver_company

#  Определяем компании с прибылью выше /ниже среднего
high_aver = []
low_aver = []
for i in range(1, num+1):
    if company_dict[i].aver_company > sum_profit / num:
        high_aver.append(company_dict[i].name_company)
    else:
        low_aver.append(company_dict[i].name_company)

print(f'Средняя годовая прибыль всех предприятий: {sum_profit / num}')
print(f'Предприятия, с прибылью выше среднего значения: {high_aver}')
print(f'Предприятия, с прибылью ниже среднего значения: {low_aver}')

