"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""
from collections import namedtuple

comp_info = namedtuple('Company', 'comp_name profit')
comp_num = int(input('Введите количество предприятий для расчета прибыли: '))
comp_list = []
avg_profit = 0
i = 1
while i <= comp_num:
    company_info = comp_info(
        comp_name=input('Введите название предприятия: '),
        profit=sum([int(i) for i in input('Через пробел введите прибыль данного предприятия за 4 квартала: ').split()])
    )
    comp_list.append(company_info)
    avg_profit += (company_info.profit / 4)
    i += 1

max_profit = []
min_profit = []
for i in comp_list:
    if i.profit > avg_profit:
        max_profit.append(i.comp_name)
    else:
        min_profit.append(i.comp_name)

print(comp_list)
print(f'Средняя годовая прибыль всех предприятий: {avg_profit}')
print(f'Предприятия, с прибылью выше среднего значения: {", ".join(max_profit)}')
print(f'Предприятия, с прибылью ниже среднего значения: {", ".join(min_profit)}')
