"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""
from collections import namedtuple

n = int(input('Введите количество компаний: '))
company = namedtuple('Company', 'name quarter_1 quarter_2 quarter_3 quarter_4')
list_company = {}

for i in range(n):
    name = str(input('Введите название предприятия: '))
    company_profit = input('через пробел введите прибыль данного предприятия '
                           'за каждый квартал: ').split()
    quarter_1, quarter_2, quarter_3, quarter_4 = company_profit
    profit = sum(int(i) for i in company_profit)
    list_company[name] = profit
    company_parts = company(
        name=name,
        quarter_1=quarter_1,
        quarter_2=quarter_2,
        quarter_3=quarter_3,
        quarter_4=quarter_4
    )

total_avg = 0
for value in list_company.values():
    total_avg += value
total_avg /= n

print(f'Средняя годовая прибыль всех предприятий: {total_avg}')

for key, value in list_company.items():
    if value > total_avg:
        print(f'Предприятие {key} имеет прибыль выше среднего')
    else:
        print(f'Предприятие {key} имеет прибыль ниже среднего')
