"""
2.	Написать программу сложения и умножения двух шестнадцатеричных чисел.
При этом каждое число представляется как массив, элементы которого это цифры числа.
Например, пользователь ввёл A2 и C4F. Сохранить их как [‘A’, ‘2’] и [‘C’, ‘4’, ‘F’] соответственно.
Сумма чисел из примера: [‘C’, ‘F’, ‘1’], произведение - [‘7’, ‘C’, ‘9’, ‘F’, ‘E’].

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections
Также попробуйте решить задачу вообще без collections и применить только ваши знания по ООП
(в частности по перегрузке методов)
"""

import collections

translate = {'0': 0,
             '1': 1,
             '2': 2,
             '3': 3,
             '4': 4,
             '5': 5,
             '6': 6,
             '7': 7,
             '8': 8,
             '9': 9,
             'A': 10,
             'B': 11,
             'C': 12,
             'D': 13,
             'E': 14,
             'F': 15,
             0: '0',
             1: '1',
             2: '2',
             3: '3',
             4: '4',
             5: '5',
             6: '6',
             7: '7',
             8: '8',
             9: '9',
             10: 'A',
             11: 'B',
             12: 'C',
             13: 'D',
             14: 'E',
             15: 'F'}


def add(l1, l2):
    l1_ = l1[::-1]
    l2_ = l2[::-1]

    res = []
    p = 0
    for i in range(max(len(l1_), len(l2_))):
        el1 = translate[l1_[i]] if i < len(l1_) else 0
        el2 = translate[l2_[i]] if i < len(l2_) else 0
        sum = el1 + el2 + p
        p = 0 if sum < 16 else 1
        res.append(translate[sum % 16])
    if p:
        res.append(translate[p])
    return res[::-1]


l1 = list(input('Введите первое шестнадцатиричное число: '))
l2 = list(input('Введите второе шестнадцатиричное число: '))

print(add(l1, l2))
