"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""

from collections import namedtuple

n = int(input('Введите количество предприятий для расчета прибыли: '))
firms = {}
comm_p = 0
for i in range(n):
    name = input('Введите название предприятия: ')
    profit = input('через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 квартала): ')
    dat = namedtuple('manuf', 'name profit')
    manufs = dat(name, profit)
    each_prof = sum([int(item) for item in manufs.profit.split()])
    comm_p = comm_p + each_prof
    firms[name] = each_prof
aver = comm_p / n
print(f'Средняя прибыль предприятий: {aver}')
print(f'Предприятия и их годовая прибыль: {firms}')
a = [key for key in firms if firms[key] < aver]
b = [key for key in firms if firms[key] > aver]
print(f'Предприятия, чья прибыль ниже среднего: {a}')
print(f'Предприятия, чья прибыль выше среднего: {b}')
