"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""
from collections import namedtuple
import numpy as np

comp = namedtuple('company', 'name profit')

def create_data(n):
    avg_profit_data = []
    company_list = []
    for i in range(n):
        i = comp(
            name=input('Введите название предприятия '),
            profit=np.mean(list(map(int, input('через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 квартала): ').split())))
        )
        avg_profit_data.append(i.profit)
        company_list.append(i)
    avg = np.mean(avg_profit_data)
    max_name = ''
    min_name = ''
    for comp_count in company_list:
        if comp_count.profit > avg:
            max_name = comp_count.name
        elif comp_count.profit < avg:
            min_name = comp_count.name
    return f'Средняя годовая прибыль всех предприятий: {avg} \n' \
           f'Предприятия, с прибылью выше среднего значения: {max_name} \n' \
           f'Предприятия, с прибылью ниже среднего значения: {min_name}'



a = int(input('Введите количество предприятий '))
print(create_data(a))