"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""

from collections import defaultdict, namedtuple, Counter


def check_inputs_amount(i):
    s = i.split()
    if len(s) != 4:
        return True
    return False


comp_dict = defaultdict(str)
attr = "first second third fourth"
C = Counter()

while True:
    company_name = input('Введите название предприятия: ')
    print('через пробел введите прибыль данного предприятия')
    amount = input('за каждый квартал(Всего 4 квартала): ')
    if check_inputs_amount(amount):
        print('Введено недостаточное кол-во данных. Перезаполните форму')
        continue
    s = namedtuple(company_name, attr)
    comp_dict[company_name] = s(*list(map(int, amount.split())))
    ex = input('Для подсчета и выхода введите любой символ или enter для продолжения')
    if len(ex) > 0:
        break

for i in comp_dict:
    C[i] = comp_dict[i].first + comp_dict[i].second + comp_dict[i].third + comp_dict[i].fourth

morja: float = sum(C.values()) / len(C.keys())

print(f'Средняя годовая прибыль всех предприятий: {morja}')
for i in C:
    if C[i] >= morja:
        print(f'Предприятия, с прибылью выше среднего значения: {i}')
    else:
        print(f'Предприятия, с прибылью ниже среднего значения: {i}')
