"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""

from collections import defaultdict


def input_profit():
    text = 'через пробел введите прибыль  предприятия каждый квартал(Всего 4 квартала): '
    lst = [int(i) for i in input(text).split()]
    if len(lst) == 4:
        return lst
    else:
        if len(lst) > 4:
            return lst[0:3]
        else:
            for j in range(4 - len(lst), 4):
                lst.append(0)
            return lst


def average_annual_profit(dd):
    count = 0
    summ = 0
    for k, v in dd.items():
        count += 1
        summ += sum(v)
    print(summ)
    return summ / count


def sort_firm(dd, average):
    text1 = ''
    text2 = ''
    for key, val in dd.items():
        if sum(val) >= average:
            text1 += (key + ' ')
        else:
            text2 += (key + ' ')

    return f'Предприятия,  прибыль выше среднего: {text1}\n' \
           f'Предприятия, прибылью ниже среднего: {text2}'


if __name__ == '__main__':
    value = defaultdict(list)
    for i in range(int(input('Введите количество предприятий для расчета прибыли: '))):
        firm = input('Введите название предприятия: ')
        value[firm] = input_profit()

    average_profit = average_annual_profit(value)
    print(f'Средняя годовая прибыль всех предприятий: {average_profit}')

    print(sort_firm(value, average_profit))
