"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""

from collections import namedtuple

RES = namedtuple('Company', 'quarter1 quarter2 quarter3 quarter4')
# заполняем шаблон данными
RESUME_PARTS1 = RES(
    quarter1='1',
    quarter2='Ivan',
    quarter3='Ivan',
    quarter4='Ivanov'
)
RESUME_PARTS2 = RES(
    quarter1='2',
    quarter2='45',
    quarter3='Iv455an',
    quarter4='Ivano4545v'
)
print(RESUME_PARTS1)  # -> Resume(id='1', first_name='Ivan', second_name='Ivanov')
print(RESUME_PARTS2)  # -> Resume(id='1', first_name='Ivan', second_name='Ivanov')
print(RESUME_PARTS2.quarter2)  # -> 1


def company_data(count_comp, count=0):
    if count_comp == count:
        print(RES)
        return
    print(count)
    RES(
        Company=input("Введите название предприятия: "),
        quarter1=int(input("введите прибыль данного предприятия за 1 квартал: ")),
        quarter2=int(input("введите прибыль данного предприятия за 2 квартал: ")),
        quarter3=int(input("введите прибыль данного предприятия за 3 квартал: ")),
        quarter4=int(input("введите прибыль данного предприятия за 4 квартал: "))
    )
    company_data(count_comp, count + 1)


# company_data(int(input("Введите количество предприятий для расчета прибыли: ")))
# print(RES)
