"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""

from collections import namedtuple

currdata = []
aver_data = {}
comp_info = namedtuple("Firm", "name income")
ncomp = int(input("Введите количество предприятий для расчета прибыли: "))
for i in range(ncomp):
    name = input("Введите название предприятия: ")
    income = input(
        "через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 квартала):"
    ).split()
    currdata = comp_info(name, income)
    aver_data[currdata.name] = sum(map(int, currdata.income)) / 4
avg_income = sum(aver_data.values()) / len(aver_data)
print(f"Средняя годовая прибыль всех предприятий: {avg_income}")

print("Предприятия, с прибылью выше среднего значения: ", end="")
print(*[i for i in aver_data if aver_data[i] > avg_income], sep=",")
print("Предприятия, с прибылью ниже среднего значения: ", end="")
print(*[i for i in aver_data if aver_data[i] < avg_income], sep=",")
