"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""

from collections import defaultdict

number_of_enterprises = int(input('Введите количество компаний: '))
company = defaultdict(int)
for el in range(number_of_enterprises):
    company_name = input(f'Введите название предприятия: ')
    profit_4_quarters = input('Введите прибыль за 4 квартала через пробел: ').split()
    profit_4_quarters = list(map(int, profit_4_quarters))   # перевод полученных значений в int
    profit_4_quarters = sum(profit_4_quarters)  # сумма прибыли за все 4 квартала каждого предприятия по отдельности
    # print(f'Сумма прибыли за год предприятия {company_name}: {profit_4_quarters}')
    company[company_name] = profit_4_quarters
print(company)
average_profit = 0
for val in company.values():
    average_profit += val / number_of_enterprises   # подсчет средней прибыли за год
above_average = [key for key, val in company.items() if val > average_profit]  # предприятия с прибылью выше среднего
below_average = [key for key, val in company.items() if val < average_profit]  # предприятия с прибылью ниже среднего
print(f'Средняя прибыль за год всех предприятий: {average_profit}')
print(f'Предприятия с прибылью выше среднего: {above_average}')
print(f'Предприятия с прибылью ниже среднего: {below_average}')
