"""
Задача 4.
Поработайте с обычным словарем и OrderedDict.
Выполните различные операции с каждым из объектов и сделайте замеры.
Опишите полученные результаты, сделайте выводы.
"""

'''Даже не производя действий, могу уверенно сказать, что использование OrderedDict неуместно, поскольку в нынешней вер-
сии питона обычный словарь и так упорядочен по ключам. А единственное нововведением OrderedDict оно и было, так как
раньше словарь упорядоченным не был(замеры проведу на выходных, чтобы в этом убедиться, сейчас отправляю, чтобы успеть
до начала вебинара.'''
