"""
Задание 4.

Для этой задачи:
1) придумайте 2-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""


def check_user(user_data):
    """
    Сложность O(N)
    """
    login = user_data['login']
    if login in data.keys():
        if (user_data['password'] == data[login]['password']) and (data[login]['is_active'] is True):
            return 'Пользователь зарегистрирован в системе и его учетная запись активна'
        elif (user_data['password'] == data[login]['password']) and (data[login]['is_active'] is False):
            return 'Пользователь зарегистрирован в системе, но его учетная запись не активна'
        return 'Пользователь не зарегистрирован в системе'
    return 'Пользователь не зарегистрирован в системе'


def check_user1(user_data):
    """
    Сложность O(1)
    """
    login = user_data['login']
    if data.get(login) is not None:
        if (user_data['password'] == data[login]['password']) and (data[login]['is_active'] is True):
            return 'Пользователь зарегистрирован в системе и его учетная запись активна'
        elif (user_data['password'] == data[login]['password']) and (data[login]['is_active'] is False):
            return 'Пользователь зарегистрирован в системе, но его учетная запись не активна'
        return 'Пользователь не зарегистрирован в системе'
    return 'Пользователь не зарегистрирован в системе'


data = {
    'one': {
        'password': 'qw12sa',
        'is_active': True
    },
    'two': {
        'password': 'password',
        'is_active': False
    },
    'three': {
        'password': '1234',
        'is_active': True
    }

}
print(check_user1({'login': 'one', 'password': 'qw12sa'}))
