"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через списковое включение.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""


def check_min_n2(lst_obj):
    for i in range(len(lst_obj)):
        min_val = lst_obj[i]
        for j in range(len(lst_obj)):
            if lst_obj[j] < min_val:
                min_val = lst_obj[j]
    return min_val


def check_min_n(lst_obj):
    min_val = lst_obj[0]
    for i in range(1, len(lst_obj)):
        if lst_obj[i] < min_val:
            min_val = lst_obj[i]
    return min_val


print(check_min_n([-5, 0, 6, 9, 12, 7, -2]))
