"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Подсказка:
Базовый случай здесь - угадали число или закончились попытки
"""
from random import randint


def puzzle(num, attempt=10):
    choice = int(input(f"Угадайте число от 0 до 100. Количество попыток - {attempt}: "))
    if choice == num:
        print(f'Число отгадано. Поздравляем!')
        return
    if choice < num:
        if attempt == 1:
            print(f'Число не отгадано. Правильное число = {num}')
            return
        print(f'Ваше число меньше загаданного. Скорректируйте его.')
        puzzle(num, attempt - 1)
    else:
        if attempt == 1:
            print(f'Число не отгадано. Правильное число = {num}')
            return
        print(f'Ваше число больше загаданного. Скорректируйте его.')
        puzzle(num, attempt - 1)


puzzle(randint(0, 100), 5)
