"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.

Пример:
для n = 5
1+2+3+4+5 = 5(5+1)/2

Подсказка:
В ф-цию принимаются два элемент - это левая и правая части

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def test(end, beg=1):
    if beg == end:
        return beg
    return beg + test(end, beg + 1)


num = int(input("Введите до какого числа проводить проверку: "))
print(f'По рекурсии для n = {num} получилось {test(num)}. По формуле получилось {num * (num + 1) / 2}.')
