"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
import random


def first_min_value(user_lst):  # O(n**2)
    for i in user_lst:  # O(n)
        if i < user_lst[0]:  # O(n) + O(n)
            user_lst[0] = i
    return user_lst[0]


def second_min_value(user_lst):  # O(n)
    return min(user_lst)  # O(n)


check_list = [i for i in range(random.randint(1, 98), 99)]

print(first_min_value(check_list))
print(second_min_value(check_list))
