"""
Задание 2.
Реализуйте два алгоритма.
Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми элементами списка.
Сложность такого алгоритма: O (n ^ 2) - квадратичная.
Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O (n) - линейная.
Примечание:
Построить список можно через генератор списка.
Если у вас возникла сложность, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен использовать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
import random

my_list = [random.randint(0, 100) for el in range(0, 15)]
print(my_list)


# O(n^2)
def min_value_1(lst):
    flag = lst[0]
    for el in range(len(lst)-1):
        for elem in range(len(lst)):
            if lst[el] < flag:
                flag = lst[el]
    return flag


print(min_value_1(my_list))


# O(n)
def min_value_2(lst):
    min_value = lst[0]
    for el in range(1, len(lst)):
        if lst[el] < min_value:
            min_value = lst[el]
    return min_value


print(min_value_2(my_list))

