
"""
Задание 4.
Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективное и почему
Примечание:
Без выполнения 2 и 3 считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникла сложность, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен использовать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.
Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.
Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""

info_user = {'login': 'ivan', 'password': '12345qwer', 'status': True}  # O(len(..))
login_user = input('Введите логин:')  # O(1)
password_user = input('Введите паролль:')


def activation(users, login, password):
    j = 1  # O(1)
    while True:  # O(n)
        if login != users['login'] or users['password'] != password: # O(1)
            print('Неверный логин или пароль, если вы не проходили регистрацию, перейдите по этой ссылке www.qwe.ru '
                  'для прохождения регистрации ')
            login = input(f'или попробуйте еще раз, осталось попыток: {3 - j}\nЛогин: ') # O(1)
            password = input('Пароль: ')  # O(1)
            j += 1 # O(1)
            users['status'] = False  # O(1)
        if login == users['login'] and users['password'] == password: # O(1) + O(1)
            users['status'] = True # O(1)
            return 'Добро пожаловать!'

        elif j == 3: # O(1)
            return 'Использовано максимальное количество попыток входа, обратитесь в поддержку по номеру 123456'


# O(n)
print(activation(info_user, login_user, password_user))


