"""
Задание 4.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""


user = {
	'user_1': [12345, 'no'],
	'user_2': [10000, 'no'],
	'user_3': [54321, 'no']
}

# Сложность: O(N)
def log_in_1(login, password):
	if login in user:
		if password == user[login][0]:
			user[login][1] = 'yes'
			print(f'{login} успешно прошол аутентификацию')
		else:
			print('Не верный пароль')
	else:
		print(f'Пользователя с логином {login} не существует')

# Сложность: O(N)
def log_in_2(login, password):
	for k, v in user.items():
		if login == k and password == v[0]:
			user[k][1] = 'yes'
			print(f'{login} успешно прошол аутентификацию')
			break
	else:
		print(f'Не верный логин или пароль')


if __name__ == '__main__':
	
	log_in_1('user_1', 12345)
	print(user['user_1'])
	log_in_1('user_2', 15987)
	print(user['user_2'])
	
	log_in_2('user_2', 10000)
	print(user['user_2'])
	log_in_2('user_3', 15987)
	print(user['user_3'])

"""
Сложно оценить какой метод эффективней, так как я не смог принципиально по другому реализовать второй метод
возможно потому что не до конца понял задание
"""
