"""
Задание 4.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему



Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""
user_1 = {'name': 'ilia',
          'password': 'secret',
          'is_activated': True}

user_2 = {'name': 'andrey',
          'password': 'secret',
          'is_activated': False}


def user_check(a):
    attempt = 0
    password = input('ur password: ').lower()
    while password != a['password']:
        print('неверный пароль')
        attempt += 1
        if attempt == 3:
            return (print('Вы превысили кол-во попыток'))
        password = input('ur password: ').lower()
    if a['is_activated'] == False:
        return ('Ваша учетка не активирована')
    return print('вы вошли в систему')


name = input('ur name: ').lower()
if name == user_1['name']:
    user_check(user_1)
elif name == user_2['name']:
    user_check(user_2)
else:
    print('пользователя не существует')
    
    
# сложность О(1), других решений не придумал, но и это не самое лучшее)немного подзабыл пайтон т.к работал с базами данных.
# на мой взгляд решении доволь эффективно, потому что используются только ветвления.

