"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

lst = [15, 4, 7, 9, 344, 14, 676, 435, 789, 55, 443, -5, 462, 658, 2356, 345, 235, 865, 32, 456, 67, -20, 7478, 34]


# вариант 1 O(n^2)
def check1(x):
    m = x[0]
    for i in x:
        for j in x:
            if j < m:
                m = i
    print(m)


# вариант 2 O(n)
def check2(x):
    m = x[0]
    for i in x:
        if i < m:
            m = i
    print(m)


check1(lst)
check2(lst)
