"""
Задание 3.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""


def three_richest_1(companies: dict):
    """ сложность O(n log n)"""
    sorted_comps = sorted(companies.items(), key=lambda x: x[1], reverse=True)
    # O(n log n)
    result = {}
    for i in range(3):
        result[sorted_comps[i][0]] = sorted_comps[i][1]  # O(n)
    return result


if __name__ == '__main__':
    test_dict = {'alfa': 1000, 'beta': 500, 'gamma': 1500, 'delta': 1600,
                 'epsilon': 400}

    print(three_richest_1(test_dict))
