"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
import random
def getMin_1(b_list):
    min_num = b_list[0]
    for i in b_list:
        if i < min_num:
            min_num = i
            for j in b_list[i + 1:]:
                if j < min_num:
                    min_num = j
    return min_num
def getMin_2(a_list):
    min_num = a_list[0]
    for i in a_list:
        if i < min_num:
            min_num = i
    return min_num
el = []
for i in range(10):
    el.append(random.randint(0, 100))
print(el)
print(getMin_1(el))
el = []
for i in range(10):
    el.append(random.randint(0, 100))
print(el)
print(getMin_2(el))