"""
Задание 3.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""
company_dic = {}
values_list = []

company_dic['compA'] = 1000000
company_dic['compB'] = 50000
company_dic['compC'] = 500000
company_dic['compD'] = 200000
company_dic['compF'] = 100000
company_dic['compG'] = 10000

print(company_dic)
print(len(company_dic))

sorted_values = sorted(company_dic.values()) # Sort the values
sorted_dict = {}

for i in sorted_values:
    for k in company_dic.keys():
        if company_dic[k] == i:
            sorted_dict[k] = company_dic[k]
            break

print(sorted_dict)

