"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
import random


def find_min_numb_list1(lst1):
    """Функция возвращает минимальное число из списка.
    Алгоритм 1:
    присваиваем переменной result первый элемент списка, далее перебираем в цикле весь список
    сравниваем текущий элемент c result, если элемент меньше, то перебираем весь список еще раз и сравниваем элемент
    с каждым числом списка и если элемент меньше очередного числа в списке, записываем результат.
    По итогу переборов возвращаем результат
    Сложность: O(N^2) - квадратичная
    """
    result = lst1[0]             # O(1) - константа
    for el in lst1:              # O(N) - линейная
        if result > el:          # O(1) - константа, если выполнится условие
            for numb in lst1:    # O(1) - константа
                if el < numb:    # O(N) - линейная
                    result = el  # O(1) - константа, если выполнится условие
    return result                # O(1) - константа


def find_min_numb_list2(lst2):
    """Функция возвращает минимальное число из списка.
    Алгоритм 2:
    присваиваем переменной result первый элемент списка, далее перебираем в цикле весь список
    сравниваем поэлементно все элементы списка, если текущий элемент списка меньше, чем значение в result, присваиваем
    в result текущее значение. После перебора всего списка возвращаем результат
    Сложность: O(N) - линейная
    """
    result = lst2[0]        # O(1) - константа
    for el in lst2:         # O(N) - линейная
        if el < result:     # O(1) - константа
            result = el     # O(1) - константа, если выполнится условие
    return result           # O(1) - константа


lst = [10 * random.randint(5, 1500) for i in range(100)]

print(find_min_numb_list1(lst))
print(find_min_numb_list2(lst))
