Но могут быть и такие палиндромы, как 'молоко делили ледоколом'

Вам нужно доработать программу так, чтобы она могла выполнить проверку на палиндром
и в таких строках (включающих пробелы)
'''


def palindrome(string):

    _str = [char for char in string.lower() if char.isalnum()] # Убираем все знаки препинания,кавычки, пробелы  и пр.
    _str = ''.join(_str)
    if _str == _str[::-1]: # это самый прстой способ, мыс сравниаем стрку с ней же перевернутой
                           #  хотя можно и сравнивать левую половину с перевернутой правой
                           # или даже брать элемены  посимвольно с начали и конца и сравнивать их.
        return True
    else:
        return False

print( palindrome('молоко делили ледоколом.'))
print( palindrome('Кот, сука, за кусток.'))
print( palindrome('Потенция - яиц нет, оп.'))
print( palindrome('Hello World!'))
