"""
Задание 3.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""

org_dict = {
    'ПАО "РОК"': 91003,
    'ОАО "ПРЫГ"': 683085,
    'ООО "СКОК"': 465929,
    'Фирма "ТРЕСК"': 952579,
    'АйтиКорпорейшн': 860223,
    'ЗАО "ВЕНИК"': 466458,
    'ТК "СУСАНИН"': 249509
}

# V-1
income_list = []
for key, value in org_dict.items():  # O(n)
    income_list.append(value)        # O(1)

a = max(income_list)                 # O(n)
income_list.remove(a)                # O(n)
b = max(income_list)                 # O(n)
income_list.remove(b)                # O(n)
c = max(income_list)                 # O(n)

three_max_org = {}
for key, value in org_dict.items():  # O(n)
    if value == a or value == b or value == c:  # O(n)
        three_max_org[key] = value   # O(n)

print(three_max_org)
"""Сложность O(n**2).
Решение нельзя назвать оптимальным.
"""

# V-2



