"""
Задание 3.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.

Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""
company = {
    'apple': 2000,
    'samsung': 3000,
    'sony': 15000,
    'LG': 50000,
    'HTC': 300
}
# 0(Nlog N)
porog = 3
def search2(comp, p):
    res = sorted(comp, key=comp.get, reverse=True)[:p]
    print(res)

search2(company, porog)

# O(n)
def search(company):
    for i in range(3):
        max_key = max(company, key = company.get)
        max_value = max(company.values())
        del company[max_key]
        print(max_key + ' - '+ str(max_value))

search(company)

