"""
Задание 4.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""
'''Сложность O(n)'''


def checker1(data):
    login = input('login: ')
    password = input('password: ')
    finish = False
    for i in data.items():  # O(n)
        if login == i[0] and password == i[1][0]:
            if i[1][1]:
                print('Вход выполнен успешно!')
                finish = True
            else:
                print('Пожалуйста пройдите процедуру активации аккаунта')
                finish = True

    if not finish:
        print('Неверный логин или пароль')


'''Сложность: O(1) - самое эффективное т.к. ассимптотическая сложность наименьшая'''


def checker2(data):
    login = input('login: ')
    password = input('password: ')
    try:
        if password == data[login][0]:
            if data[login][1]:
                print('Вход выполнен успешно!')
            else:
                print('Пожалуйста пройдите процедуру активации аккаунта')
        else:
            print('Неверный логин или пароль')
    except KeyError:
        print('Неверный логин или пароль')


users = {'Вася Пупкин': ['12345', True], 'Коновалова Елизавета': ['131324', False]}
print(users)
checker1(users)
print('*'*100)
checker2(users)
