"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
from random import randint

my_list = [randint(1, 100) for el in range(10)]


# O(n**2)
def min_list(lst):
    min_el = lst[0]
    for i in lst:
        for j in lst:
            if j < i and j < min_el:
                min_el = j
    return min_el


# O(n)
def min_list_optim(lst):
    min_el = lst[0]
    for i in lst:
        if i < min_el:
            min_el = i
    return min_el


print(my_list)
print(min_list(my_list))
print(min_list_optim(my_list))
