"""
Задание 3.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""

dict = {
    'Horns&Hoofs': 10000,
    'Google': 100,
    'Yandex': 50,
    'Mail': 50,
    'Pyaterochka': 400,
    'Shesterochka': 300
 }

# вариант 1
def maxProfit (dict):

    keysList = sorted( list((dict.values())), reverse=True) [:3]
    resultDict = {}

    for i in dict:
        if dict[i] in keysList:
            resultDict[i] = dict[i]
    return resultDict

# вариант 2
def maxProfit2 (dict):
    return sorted(dict.items(), key=lambda x: x[1], reverse=True) [:3]

print(maxProfit(dict))
print(maxProfit2(dict))


# вариант 2 лучше, т.к количество действий минимально, отсутствуют лишние переменные

