"""
Задание 4.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""
# первое решение. Сложность линейная O(n), так как перебираем все элементы словаря:
data_users = {'user': {'password': '123', 'activ': True}, 'user2': {'password': '456', 'activ': False}}

login = input('login: ')
password = input('password: ')


def access(users, name, pswd):
    for key, val in users.items():
        if key == name:
            if val['password'] == pswd and val['activ']:
                return print('Доступ разрешен')
            elif val['password'] == pswd and not val['activ']:
                return print('Пройдите активацию')
    return print("В доступе отказано")


access(data_users, login, password)

# второе решение Сложность константная, т.к. мы непосредственно обращаемся к ключу, без перебора.


def access2(users, name, pswd):
    if users.get(name):
        val = users[name]
        if val['password'] == pswd and val['activ']:
            return print('Доступ разрешен')
        elif val['password'] == pswd and not val['activ']:
            return print('Пройдите активацию')
    return print("В доступе отказано")


access2(data_users, login, password)
