"""
Задание 3.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""


def most_common(coll, num):
    res = {}

    for k, w in sorted(coll.items(), key=lambda item: item[1], reverse=True): # O(n) + O(n)
        res[k] = w
        num -=1
        if num == 0:
            break
    return res


profits = {'test1': 340000,
           'test2': 400000,
           'test3': 600000,
           'test4': 456767}

# Сложность O(n) где n - размер словаря profits
print(most_common(profits, 3))