"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
import random as r


def find_min_n2(x_list):  # O(n**2)
    my_min = x_list[1]
    for el in x_list:
        for i in x_list:
            if el < my_min and el < i:
                my_min = el
    return my_min, x_list
    # в первом приближении как-то так


def find_min_lin(x_list): # O(n)
    my_min = x_list[1]
    for el in x_list:
        if el < my_min:
            my_min = el
    return my_min, x_list


test_list = [r.randint(0, 100) for i in range(1, 15)]
print(find_min_n2(test_list))
print(find_min_lin(test_list))
