"""
Задание 5.
Задание на закрепление навыков работы с деком

В рассмотренном на уроке листинге есть один недостаток
Приведенный код способен "обработать" только строку без пробелов, например, 'топот'

Но могут быть и такие палиндромы, как 'молоко делили ледоколом'

Вам нужно доработать программу так, чтобы она могла выполнить проверку на палиндром
и в таких строках (включающих пробелы)
"""

str = 'молоко делили ледоколом'
str = 'аргентина манит негра'
str = 'а роза упала на лапу азора'
str = 'оно'

str = str.replace(' ', '')

print(str)
i = 0
j = len(str) - 1
while i < j:
    if str[i] == str[j]:
        i += 1
        j -= 1
        print(i, j)
    else:
        print("Это был не палиндром!!!")
        exit()
