"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
import random

lst_obj = []

for el in range(100):
    el = random.randint(0, 3000)
    lst_obj.append(el)
print(lst_obj)

def min_search(lst_obj):
    for el in lst_obj:
        min_num = el
        for i in lst_obj:
            if i < min_num:
                min_num = i
    return min_num           #сравнение каждого числа с каждым квадратичная сложность вложенность одного цикла в другой

def min_search1(lst_obj):    #сравнение одного числа с остальными в списке с переназначением переменной линейная сложность
    min_num = lst_obj[0]
    for i in lst_obj:
        if i < min_num:
            min_num = i
    return min_num

print(min_search(lst_obj))
print(min_search1(lst_obj))




