"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через списковое включение.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
from random import randint

# var 1

# def list(lst):
#     for i in lst:
#         min = True
#         for j in lst:
#             if i > j:
#                 min = False
#         if min:
#             return i


# var 2

def list (lst):
    min = lst[0]
    for i in lst:
        if i < min:
            min = i
    return min
#
#
list1 = [randint(0, 100) for i in range(20)]
print(list1)
print(list(list1))

