"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

def search_min_linear(l: list):  # итоговая сложность: линейная (n)
    min_value = l[0]  # сложность: константная (1)
    for x in l[1:]:  # сложность: линейная (n)
        if x < min_value:  # сложность: константная (1)
            min_value = x  # сложность: константная (1)
    return min_value  # сложность: константная (1)

def search_min_q(l: list):  # итоговая сложность: квадратичная n^2
    min_value = l[0]  # сложность: константная (1)
    for x in l[:-1]:  # сложность: линейная (n)
        for y in l[1:]:  # сложность: линейная (n)
            if y < min_value:  # сложность: константная (1)
                min_value = y  # сложность: константная (1)
    return min_value  # сложность: константная (1)