"""
Задание 3.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""

""" Вариант 1
    Сложность: n + n log n + 1 +3, т.е. O(n log n)
"""
data = {'UKOS': 150000000, 'LUKOIL': 250000000, 'GAZPROM': 300000000, 'TATNEFT': 50000000, 'BP': 270000000, 'SHELL': 350000000, 'ROSNEFT': 220000000}
list_data = list(data.items()) # n
list_data.sort(key=lambda i: i[1], reverse=True) # n log n
print("Топ-3 компаний по прибыли:") #1
for i in range(3): # 3
    print(f'{i+1}-место: компания {list_data[i][0]} с прибылью {list_data[i][1]}') #1

""" Вариант 2
Сложность: 1+ 5 + 9n, т.е. O(n)
"""
data = {'UKOS': 150000000, 'LUKOIL': 250000000, 'GAZPROM': 300000000, 'TATNEFT': 50000000, 'BP': 270000000, 'SHELL': 350000000, 'ROSNEFT': 220000000}
print("Топ-3 компаний по прибыли:") #1
for i in range(3): #3*(1+3n)+1+1=5 + 9n
    max_value = 0 #1
    for key in data: # 3n
        if data[key] > max_value: #1
            max_value = data[key] #1
            temp_key = key #1
    print(f'{i+1}-место: компания {temp_key} с прибылью {max_value}') #1
    data.pop(temp_key) #1

""" Получается что при небольших количествах данных количество выполняемых операций отличается
 незначительно, но с их ростом варинат 2 становится предпочтительней, т.к. имеет меньшую сложность О-нотации,
 соответственно вариант 2 эфективнее
"""