"""
Задание 3.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""

companys = {
    'google': 15000,
    'rosseti': 10000,
    'nornikel': 40000,
    'apple': 100000,
    'severstal': 25000,
    'amazon': 250000,
    'netflix': 150000,
    'okko': 100000 
}

#O(n) - лучший вариант, т.к. нет лишних сортировок
def max_profit(list):
    new_list = {}
    list1 = dict(list)
    for x in range(3):
        maximum = max(list1.items(), key=lambda k_v: k_v[1])
        del list1[maximum[0]]
        new_list[maximum[0]] = maximum[1]
    return new_list

print (max_profit(companys))


#O(nlogn) 
sorted_list = list(companys.items())
sorted_list.sort(key = lambda i: i[1], reverse = True)
for x in range(3):
    print(sorted_list[x][0], ':', sorted_list[x][1])
    