"""
Задание 4.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""

user_info = {'login':'olya', 'pass':'123', 'activated': True}

def test_1(my_login, my_pass, my_activated):
    if my_activated == True:
        if my_login != user_info.get('login') or my_pass != user_info.get('pass'):
            print('Невнрный логин или пароль!')
        else:
            print('Вы вошли в систему!')
    else:
        print('Активируйте профиль!')


# test_1('olya', '123', True)
# test_1('olyaO', '123', True)
# test_1('olya', '1234', True)
# test_1('olya', '1234', False)


def test_2(my_info):
    if my_info == user_info and my_info.get('activated') is not False:
        print('Вы вошли в систему!')
    elif my_info.get('activated') is False:
        print('Активируйте профиль!')
    else:
        print('Невнрный логин или пароль!')


# my_info = {'login': 'olya', 'pass': '123', 'activated': True}
# test_2(my_info)
# my_info = {'login': 'olya0', 'pass': '123', 'activated': True}
# test_2(my_info)
# my_info = {'login': 'olya', 'pass': '1234', 'activated': True}
# test_2(my_info)
# my_info = {'login': 'olya', 'pass': '123', 'activated': False}
# test_2(my_info)