"""
Задание 3.
Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему
Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""

company_dict = {
    'ozon': 10000,
    'wildberries': 20000,
    'yandex_market': 7000,
    'goods': 2000,
    'aliexpress': 500000,
    'lamoda': 6000,
}

#  алгоритм №1
#  Сложность: O(n**2)

company_lst = company_dict.values()

top_val = []

for i in company_lst:
    count = 0
    for j in company_lst:
        if j > i:
            count += 1
    if count < 3:
        top_val.append(i)

top_company = []

for key, value in company_dict.items():
    for name in top_val:
        if value == name:
            top_company.append(key)

print(top_company)

#  алгоритм №2
#  Сложность:O(n log n)

top_company = sorted(company_dict.values(), reverse=True)[:3]
for key, value in company_dict.items():
    if value in top_company:
        print(f'{key}')






