"""
Задание 3.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""

company_dict = {"Tesla": 100, "Gazprom": 103, "Google": 105, "Amazon": 98, "Yandex": 78, "Microsoft": 101}

company_list = company_dict.values()

top_3 = []

for company in company_list:
    count = 0
    for x in company_list:
        if x > company:
            count += 1
    if count < 3:
        top_3.append(company)

top_3_name = []

for key, value in company_dict.items():
    for income in top_3:
        if value == income:
            top_3_name.append(key)

print(top_3_name)

#Сложность алгоритма квадратичная


'''_________________________________________________________________'''

company_dict = {"Tesla": 100, "Gazprom": 99, "Google": 105, "Amazon": 98, "Yandex": 78, "Microsoft": 101}

top_3 = []
top_3_name = []

for company, income in company_dict.items():
    top_3.append([income, company])

top_3.sort()
top_3 = top_3[-1:-4:-1]

for company in top_3:
    top_3_name.append(company[1])

print(top_3_name)

#Сложность алгоритма линейная


"""Выберу вариант с линейной сложностью"""
