"""
Задание 4.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""

users = {
    'Ivan': 'qwerty',
    'Gena': 'abc',
    'Masha': 'faq',
    'Ann': 'fifa'
}

active_users = {
    'Ivan': True,
    'Gena': True,
    'Masha': False,
    'Ann': False
}

input_name = input('Введите имя:  ')
input_keyword = input('Введите пароль:  ')

# Вариант 1 Сложность O(1)
def auth():
    keyword = users.get(input_name)
    if keyword != input_keyword:
        print('Неверный пароль')
    else:
        print('Вы авторизованы')
        active = active_users.get(input_name)
        if active == True:
            print('Учетная запись активирована!')
        else:
            print('Активируйе учетную запись!')

auth()

# Вар 2 Сложность O(n)
def auth_var2():
    names = users.keys()
    for name in names:
        if name == input_name:
            print('Имя найдено')
            break
        else:
            continue

    keywords = users.values()
    for keyword in keywords:
        if keyword == input_keyword:
            print('Пароль верный')
            break
        else:
            continue

    active = active_users.get(input_name)
    if active == True:
        print('Учетная запись активирована!')
    else:
        print('Активируйе учетную запись!')


auth_var2()

# Вариант 1 более эффективен поскольку имеет меньшую сложность
