"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""


def min_1(var_list):
    x = var_list[0]
    for item_1 in var_list:
        for item_2 in var_list:
            if item_1 < item_2 and item_1 < x:
                x = item_1
    return x


def min_2(var_list):
    x = var_list[0]
    for item_1 in var_list:
        if item_1 < x:
            x = item_1
    return x


var_list = [7, -6, 5, -4, 3, 2, 1, -7]
print(min_1(var_list))
print(min_2(var_list))
