"""
Задание 4.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""
# 1 вариант сложность O(1)
# Информацию о пользователе храним в словаре, на вход функции отправляем конкретного юзера
user_1 = {
    'login': 'Max',
    'password': 'Qwerty',
    "is_active": False
}


def check_user(user):
    password = input('Введите пароль: ')
    if password == user['password']:
        if user['is_active']:
            print("Вход разрешен")
        else:
            print("Ваша учетная запись не активна")
    else:
        print('Вы ввели неправильный пароль')


check_user(user_1)

# 2 вариант Сложность O(1)
users = {"login_1": {'password': "123", 'is_active': True},
         "login_2": {'password': "123", 'is_active': False}
         }


def check_user_2(users, user, password):
    check_user = users.get(user)
    if check_user['password'] == password:
        if check_user["is_active"]:
            print("Все ок")
        else:
            print("Учетная запись не активна")
    else:
        print("Неправильный пароль")


check_user_2(users, "login_2", "123")
