"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

# Вар 1 O(n**2)
import random
list = [random.randint(0, 100) for i in range(1,20)]
print(list)

def search_min(list):
    min = list[0]
    for i in list:
        if i < min:
            min = i
    return min
print(search_min(list))

# Вар 2 O(n)
import random
list = [random.randint(0, 100) for i in range(1,20)]
print(list)

def search_min(list):
    min_digit = min(list)
    return min_digit

print(search_min(list))