"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
import sys
def min_1(user_list):
    """
    поиск минимального числа из списка путем сравнения каждого числа с каждым,
    Сложность: O(n**2)
    """
    for i in user_list:
        for j in range(0, len(user_list)):
            if i < user_list[j]:
                res = i
            else:
                res = user_list[j]
            i = res
    return res

def min_2(x):
    """
    Сложность: O(n)
    """
    return min(x)



foo = [111,2,3,4,5,6]

print(min_1(foo))
print(min_2(foo))
