"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
import random

test_lst = random.sample(range(-100000, 100000), 10)


def list_min1(lst):
    min_number = lst[0]
    for checking_number in lst:
        if checking_number < min_number:
            min_number = checking_number
        else:
            continue
    return min_number


def list_min2(lst):
    return min(lst)


print(test_lst)
min_in_list1 = list_min1(test_lst)
print(min_in_list1)
min_in_list2 = list_min2(test_lst)
print(min_in_list1)
