"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
from random import randint


# O(n^2)
def first_func(obj_list):
    for i in obj_list:      # O(n)
        min = i             # O(1)
        for j in obj_list:  # O(n)
            if j < min:     # O(1)
                min = j     # O(1)
    return min              # O(1)


# O(n)
def second_func(obj_list):
    min = obj_list[0]   # O(1)
    for i in obj_list:  # O(n)
        if i < min:     # O(1)
            min = i     # O(1)
    return min          # O(1)


raw_list = [randint(-i, i) for i in range(randint(2,10))]
print(raw_list)
print(first_func(raw_list))
print(second_func(raw_list))
