"""
Задание 3.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""

# O(N), не самое эффективное решение потому что создается новый словарь и используется сортирование.
company_info = {'Microsoft': 1250000,
                'Apple': 1034000,
                'Boeing': 120000,
                'BOA': 42000,
                'Toyota': 133000,
                'Camry': 220000,
                'HP': 55000,
                'Dell': 138000,
                'Asos': 146000,
                'ViewSonic': 11000
                }

sorted_values = sorted(company_info.values())
sorted_dict = {}

for i in sorted_values:
    for k in company_info.keys():
        if company_info[k] == i:
            sorted_dict[k] = company_info[k]
            break

new_list = list(sorted_dict.keys())[-3:]
new_list.reverse()
print(new_list)

