"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

my_list = [6, 8, 3, 7, 1, 34, 3, 7]


def find_min_1(my_list_1):
    for el in my_list_1:
        flag = True
        for i in my_list_1:
            if i < el:
                flag = False
        if flag:
            return el


def find_min_2(my_list_1):
    minimum = my_list_1[0]
    for el in my_list_1[1:]:
        if el < minimum:
            minimum = el
    return minimum

print(find_min_1(my_list))
