"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

### список ###

from random import randrange

new_list = []
i = 0
while i <= 15:
    new_list == new_list.append(randrange(-5000, 5000, 1))
    i += 1

print(new_list)

#### 1 ####

min_el = new_list[0]

for el in new_list:
    if el < min_el:
        min_el = el

print(min_el)

#### 2 ####

min_el = min(new_list)
print(min_el)
