# """
# Задание 2.
#
# Реализуйте два алгоритма.
#
# Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
# В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
# Сложность такого алгоритма: O(n^2) - квадратичная.
#
# Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
# Сложность такого алгоритма: O(n) - линейная.
#
# Примечание:
# Построить список можно через генератор списка.
# Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
# а не писать "мы это не проходили)".
# Алгоритмизатор должен развивать мышление, а это прежде всего практика.
# А без столкновения со сложностями его не развить.

numbers = [i for i in range(1, 11)]
print(numbers)


def my_min(a):
    min_n = a[0]
    for i in a:
        if i < min_n:
            min_n = i
    return min_n


print(my_min(numbers))


def my_min_2(a):
    for i in range(0, len(a) - 1):
        for j in range(len(a)):
            if a[i] < a[j]:
                return a[i]


print(my_min_2(numbers))
