"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

from random import randint
# Сложность O(n**2)
def min_1 (lst):
    for i in range(len(lst)):
        min = lst[i]
        for k in range(len(lst)):
            if lst[k] < lst[i]:
                min = False
        if min:
            return min

# Сложность O(n)
def min_2(lst):
    min = lst[0]
    for i in range(len(lst)):
        if lst[i]< min:
            min = lst[i]
    return min

test_list = [randint(0,100) for i in range(10)]
print(test_list)
print(min_1(test_list))
print(min_2(test_list))