Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""

#########################################################################################################
log = input("Введите ваш логин ")
pas = input("Введите ваш пароль ")
login = ['admin', 'user_1', 'user_2', 'user_3']
password = ['admin', 1111, 2222, 3333]
for i in login:
    for j in password:

        if log == login[0] == pas == password[0]:
            print('Доступ разрешен.')
        else:
            print('Кто Вы?')

print('Пройдите регистрацию.')
new_log = input('Введите ваш логин: ')
new_pas = input('Введите ваш пароль: ')

'''
Принамает только admin, остальных не узнает.
Добавление нового пользователя через добавление в существующий словарь.
Почему выводит на печать вопрос больше одного раза (16 раз, что является двойной длине login +  password)? 
Добавление в словарь не реализовано из-за непонятной ошибки.
'''
