"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""


# 1й вариант. Сложность: O(n^2)
def min_lst_1(lst_obj):
    for n in lst_obj:
        is_min = True
        for m in lst_obj:
            if n > m:
                is_min = False
        if is_min:
            return n


# 1й вариант. Сложность: O(n)
def min_lst_2(lst_obj):
    return min(lst_obj)


lst = [i for i in range(1, 10)]  # создаем список
print(lst)
print(min_lst_1(lst))
print(min_lst_2(lst))
