"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
import random


test_list = [random.randint(-10, 10) for i in range(10)]
print(test_list)


def find_min_1(my_list):  # Сложность O(n^2).
    for i in my_list:
        for j in my_list:
            if i > j:
                break
            num = i
    return num


print(find_min_1(test_list))
# Почему-то функция работает правильно не каждый раз, не понимаю, почему...(


def find_min_2(my_list):  # Сложность O(n)
    num = 11
    for i in my_list:
        if i < num:
            num = i
    return num


print(find_min_2(test_list))
