"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

import random


def find_min_1(lst_obj):
    """Функция возвращает минимальный элемент списка.

        Алгоритм 1:
        Сравниваем каждый элемент списка со всеми остальными элементами,
        если он больше какого-то из них - прекращаем сравнение и переходим к
        следующему, если он "не больше" всех элементов, то он является
        минимальным, и мы его возвращаем.

        Сложность: N^2
        """
    for el in lst_obj:                  # O(N)
        for i in range(len(lst) - 1):   # O(N)
            if el > lst[i]:             # O(1)
                is_min = False          # O(1)
                break
            is_min = True               # O(1)
        if is_min:                      # O(1)
            return el                   # O(1)


def find_min_2(lst_obj):
    """Функция возвращает минимальный элемент списка.

        Алгоритм 2:
        Присваиваем переменной min_number значение первого элемента списка.
        Сравниваем все элементы списка начиная со второго по очереди с
        переменной min_number. Если какой-то элемент имеет меньшее значение,
        присваиваем переменной min_number это значение.
        В результате в переменной min_number остается минимальный элемент
        списка, который мы и возвращаем.

        Сложность: N
        """
    min_number = lst_obj[0]             # O(1)
    for i in range(1,len(lst_obj) - 1): # O(N)
        if lst_obj[i] < min_number:     # O(1)
            min_number = lst_obj[i]     # O(1)
    return min_number                   # O(1)


lst = [i for i in random.sample(range(0,1000), 100)]
print(find_min_1(lst))
print(find_min_2(lst))
