"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

from random import randint

#-----------------------first-----------------------------------
# def list(lst):
#     for i in lst:
#         min = True
#         for j in lst:
#             if i > j:
#                 min = False
#         if min:
#             return i

#----------------------second-------------------------------------
def list (lst):
    min = lst[0]
    for i in lst:
        if i < min:
            min = i
    return min

lst1 = [randint(0, 100) for i in range(20)]
print (lst1)
print (list(lst1))