"""
Задание 5.
Задание на закрепление навыков работы с деком

В рассмотренном на уроке листинге есть один недостаток
Приведенный код способен "обработать" только строку без пробелов, например, 'топот'

Но могут быть и такие палиндромы, как 'молоко делили ледоколом'

Вам нужно доработать программу так, чтобы она могла выполнить проверку на палиндром
и в таких строках (включающих пробелы)
"""

# Palindrome
def val1(str1):
    str_new = str1.replace(' ', '')
    print(str_new)
    if str_new[:] == str_new[::-1]:
        print("This is palindrome")
    else:
        print("Not palindrome")


val1('молоко делили ледоколом')

