"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
import random

rand_list = [random.randrange(1, 500) for el in range(30)]

# Вариант 1
def var_1(lst):
    for elem in lst:
        minimum = True
        for el in lst:
            if elem > el:
                minimum = False
        if minimum == True:
            return elem


# Вариант 2


def var_2(lst):
    minimum = lst[0]
    for elem in lst:
        if elem >= minimum:
            continue
        else:
            minimum = elem
    return minimum