"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

import random


# Первый алгоритм
def min1(lst):
    minimum = lst[0]

    for i in lst:
        if i < minimum:
            minimum = i
    return minimum


# Второй алгоритм
def min2(lst):
    return min(lst)


my_list = [random.randint(-1000, 1000) for a in range(random.randint(10, 100))]

min1(my_list)
min2(my_list)
