"""
Задание 3.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""
dict = {
	'Apple': 2000000,
	'Google': 1000000,
	'Amazon': 1950000,
	'Microsoft': 1500000,
	'Netflix': 1350000 

}


list = list(dict.items())
list.sort(key=lambda i: i[1], reverse=True)
for i in range(3):
	print(list[i][0], ':', list[i][1]) #Здесь алгоритм средней сложности O(n*log n), проще будет O(n), O(log n) и О(1)
