"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
from random import randrange


# 1ый с O(n^2)
def search1(m_list):
    v_min = m_list[0]
    for i in m_list:
        for k in m_list:
            if i < k and i < v_min:
                v_min = i
    return v_min


# 2ой с O(n)
def search2(m_list):
    v_min = m_list[0]
    for el in m_list:
        if el < v_min:
            v_min = el
    return v_min


input_list = [randrange(100) for x in range(1, 10)]
print(input_list)
print(search1(input_list))
print(search2(input_list))
