"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

import random

# 1 очень непрактично и неестественно получилось


def find_min(lst):
    min_val = lst.pop(0)
    min_val_iter = 100
    for i in lst:
        for j in lst:
            if i < j:
                min_val_iter = i
        if min_val_iter < min_val:
            min_val = min_val_iter
    return min_val


# 2


def find_min2(lst):
    min_val = lst.pop(0)
    for i in lst:
        if i < min_val:
            min_val = i
    return min_val


############################

some_list = random.sample(range(0, 100), 5)
print(some_list)
print(find_min(some_list.copy()))
print(find_min2(some_list.copy()))