"""
Задание 4.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""

import random


# 1: O(n)
def auth_v1(users_db, username, password):
    for key, value in users_db.items():
        if key == username:
            if value['is_active']:
                if value['password'] == password:
                    return "Доступ предоставлен!"
                else:
                    return "Не верный пароль!"
            else:
                return "Необходимо активировать учетную запись!"
    return "Пользователя с таким именем не существует!"


# 2: O(1)
def auth_v2(users_db, username, password):
    if users_db.get(username):
        if users_db[username]['is_active']:
            if users_db[username]['password'] == password:
                return "Доступ предоставлен!"
            else:
                return "Не верный пароль!"
        else:
            return "Необходимо активировать учетную запись!"
    else:
        return "Пользователя с таким именем не существует!"


users_db_example = {f'User_{i}': {f'password': f'{i}' * 5, 'is_active': random.choice((True, False))}
                    for i in range(5)}
print(f'Словарь пользователей: {users_db_example}\n'
      f'Результат авторизации: {auth_v1(users_db_example, "User_1", "11111")}\n'
      f'Результат авторизации: {auth_v2(users_db_example, "User_1", "11111")}')
