"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""


def find_min_1(in_list):
    min = 0
    for i in in_list:
        for j in in_list:
            if min > j:
                min = j
    return min


def find_min_2(in_list):
    min = 0
    for item in in_list:
        if item < min:
            min = item
    return min


in_list = [el for el in range(-1000, 1000, 3)]

print(find_min_1(in_list))
print(find_min_2(in_list))
