"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
lst = [15, 2, 34, -5, 4563, 23, -11, 74, 2435, 123]


def quad_search(lst):
    for i in range(0, len(lst) - 1):
        min_num = lst[i]
        for j in range(i + 1, len(lst)):
            if lst[j] < min_num:
                min_num = lst[j]
        return min_num


def simple_search(lst):
    return min(lst)


print(quad_search(lst))
print(simple_search(lst))
