"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""


import random

list = [random.randint(-1, 1000) for el in range(1, 100)]
print(list)


def find2n(list):
    min = list[0]
    for i in list:
        for j in list:
            if min > i < j:
                min = i
    return min


def findN(list):
    min = list[0]
    for num in list:
        if num < min:
            min = num
    return min


print(find2n(list))
print(findN(list))

