"""
Задание 4.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""

users = {('aslan', 'klsdmalkmvnorieeiq'): True, ('fil', 'lkdvurnv'): False,
         ('kayl', 'sadvbtbcc'): True, ('super_lina', 'sdfvvvxxw3'): True,
         ('geo3', 'eeedca5'): True, ('niko', 'sdcvgjtr'): True,
         ('john5', 'wfsssx345'): False, ('will', 'fjgsy6de'): False,
         ('kolya', 'dfvccvres'): True, ('poll', 'sdcafr43eee'): True,
         ('will04', 'rrdfvcxz56'): True, ('nadya', 'fdsfgwe'): True}

# Наиболее эффективное решение, т.к не зависит от количество входящих параметров, сложность О(1)
def check_user_o_1(name, password):
    user_key = (name, password)

    if user_key not in users:
        print('Доступ запрещен')
        return

    if users[user_key]:
        print('Доступ разрешен')
    else:
        print('Вам необходимо активировать учетную запись')

# Сложность О(n)
def check_user_o_n(name, password):
    user_key = (name, password)

    for user, is_active in users.items():
        if user == user_key:
            if is_active:
                print('Доступ разрешен')
            else:
                print('Вам необходимо активировать учетную запись')
            return

    print('Доступ запрещен')


u, p = input('Введите ваш логин: '), input('Введите пароль: ')
check_user_o_1(u, p)
check_user_o_n(u, p)
