"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

list1 = [5, -1, 1, 12, -3, 0, 2]

# O(n**2)
min_value = list1[0]        # O(1)
for i in list1:             # O(n) цикл
    for j in list1:         # O(n) вложенный цикл
        if j < min_value:   # O(1)
            min_value = j   # O(1)
print(min_value)            # O(1)

# О(n)
print(min(list1))  # O(n)
