"""
Задание 4.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""

users = {'Mark': {'password': '45umaU', 'active': True},
             'Tom': {'password': 'vpm5of', 'active': False},
             'Eva': {'password': '78omaU', 'active': True},
             'Max': {'password': 'vg4maU', 'active': True}
             }

# Алгоритм №1- Сложность O(n)

def authentication_1(name, password):
    for key, value in users.items():
        if key == name:
            if value['password'] == password and value['active']:
                return f'{name}, доступ разрешен!'
            elif value['password'] == password and not value['active']:
                return f'{name}, учетная запись не активирована! Хотите пройти активацию?'
            elif value['password'] != password:
                return 'Доступ запрещен!'
    return f"Учетная запись {name} не существует!"

# Алгоритм №2 -Сложность O(1)

def authentication_2(name, password):
    if users.get(name):
        if password == users[name]['password']:
            if users[name]['active']:
                return f'{name}, доступ разрешен!'
            else:
                return f'{name}, учетная запись не активирована! Хотите пройти активацию?'
        else:
            return 'Доступ запрещен!'
    else:
        return f"Учетная запись {name} не существует!"


print(authentication_1('Tom', 'vpm5of'))
print(authentication_1('Tim', 'v77777'))
print(authentication_1('Max', 'vg4maU'))

print(authentication_2('Tom', 'vpm5of'))
print(authentication_2('Tim', 'v77777'))
print(authentication_2('Max', 'vg4maU'))


# Второй вариант O(1) быстрее и лучше.

