"""
Задание 4.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""

# Первое решение, сложность кубическая O(n^3)

users_info = {
    'Vlad': ['jhr43fd', 'true'],
    'Oleg': ['jkn812s', 'false'],
    'Anna': ['12nd9fj', 'true'],
    'Olga': ['2nkf0fd', 'false']
}


def auth_check(info):
    login = input('Введите логин:')
    pwd = input('Введите пароль:')
    for i in info.items():
        if login in i and pwd == str(i[1][0]):
            if i[1][1] == 'true':
                print('Учетная запись активирована')
            else:
                print('Необходимо активировать учетную запись')


auth_check(users_info)

# Второе решение, сложность кубическая O(n^3)

users_info = {
    'Vlad': ['jhr43fd', 'true'],
    'Oleg': ['jkn812s', 'false'],
    'Anna': ['12nd9fj', 'true'],
    'Olga': ['2nkf0fd', 'false']
}


def auth_check_2(info):
    login = input('Введите логин:')
    pwd = input('Введите пароль:')
    if login in info.keys():
        if login == info(login):
            if info(pwd) == 'true':
                print('Учетная запись активирована')
    else:
        print('Необходимо активировать учетную запись')


auth_check_2(users_info)

# Сложность у обоих решений одинаковая, однако, второй код,
# на мой взгляд, читается лучше
