"""
Задание 3.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""

# 1


def take_top(some_dict):
    top_list = []
    # temp_list_val = []
    # top_list_idx = []

    # temp_list_val = [val for key, val in storage]
    # for _ in range(0, 3):
    #     top_list.append(temp_list_val.index(max(temp_list_val)))
    #
    # temp_list_val.index(temp_list_val)


###############

storage = {
    'ООО Ромашка': 120000,
    'ООО Семицветик': 2700000,
    'ООО Сенокос': 4300000,
    'ООО Карусель': 700000,
}