"""
Задание 4.

Для этой задачи:
1) придумайте 2-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""
#O(len(n))

log_data = {'login':'xxx', 'password':'yyy', 'actv':'1'}
def chekin(l, p):
    dict_1 = {'login': l, 'password': p}
    if dict_1['login'] == log_data['login'] and dict_1['password'] == log_data['password']:
        if log_data['actv'] == '1':
            print('Добро пожаловать!')
            return
        print('Необходимо активировать профайл.')
        return
    print('Некоректный логин или пароль')
chekin('xxx', 'yyy')

#O(1)

def chekin_1(l, p):
    if l in log_data.values():
        if log_data['password'] == p:
            if log_data['actv'] == '1':
                print('Добро пожаловать!')
                return
            print('Необходимо активировать профайл.')
            return
        print('Некорректный пароль')
        return
    print('Некорректный логин')
    return
chekin_1('xxx', 'yyy')

#Второе решение менее сложное