"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
from random import randint


def check_min2(obj):
    for i in obj:
        minn = True
        for j in obj:
            if  i > j:
                minn = False
        if minn:
            return i


def check_min(obj):
    minn = obj[0]
    for i in obj:
        if i < minn:
            minn = i
    return minn

lst = [randint(0, 1000) for i in range(40)]
print(lst)
print(check_min2(lst))
print(check_min(lst))
print(sorted(lst))