"""
Задание 3.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""

objects = {"Рога и Копыта": 23587, "СуперИнк": 54754, "Мечта": 254554, "Вера": 3453, "Казино": 3465987}

only_values = list(objects.values())
only_keys = list(objects.keys())

print('Первый вариант - сложность O(n log n):')
sorted_values = sorted(objects.values(), reverse=True)[:3]  # O(n log n)

for el in sorted_values:                    # O(1)
    find_index_1 = only_values.index(el)    # O(n)
    max_key_1 = only_keys[find_index_1]
    print(max_key_1)

print('Второй вариант - сложность O(n):')
only_values_copy = only_values.copy()

for i in range(3):                          # O(1)
    max_val_1 = max(only_values_copy)       # O(n)
    find_index_1 = only_values.index(max_val_1)     # O(n)
    max_key_1 = only_keys[find_index_1]     # O(1)
    print(max_key_1)
    only_values_copy.remove(max_val_1)      # O(n)

