"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
# O(n**2)
import random

my_list = [random.randint(-50, 100) for i in range(15)]


def min_num(my_list):
    minimum = 0
    for i in my_list:
        for j in my_list:
            if (i < j < minimum) and (i != j):
                minimum = i
    return minimum

print(my_list)
print(min_num(my_list))


# O(n)
def min_num2(my_list):
    minimum = 0
    for i in my_list:
        if i < minimum:
            minimum = i
    return minimum
    
print(min_num2(my_list))