"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через списковое включение.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
# 1ый с O(n^2)
def min_search(min_list):
    v_min = min_list[0]
    for el in min_list:
        for el2 in min_list:
            if el < el2 and el < v_min:
                v_min = el
    return v_min

# 2ой с O(n)
def min_search2(min_list):
    v_min = min_list[0]
    for el in min_list:
        if el < v_min:
            v_min = el
    return v_min

l = [2, 3, 4, 5, 6, 1, 11, 44, 5 , 0, -7]

print(min_search(l))
print(min_search2(l))
