"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

from random import randint


def find_min_1(inp_list):
    for i in inp_list:
        less_than = True
        for j in inp_list:
            if i > j:
                less_than = False
        if less_than:
            min = i
    return min


def find_min_2(inp_list):
    min = inp_list[0]
    for i in inp_list:
        if i < min:
            min = i
    return min


lst = [randint(0, 100) for i in range(10)]

print(f'Исходный список: {lst}')
print(f'Минимальное значение, найденное первой функцией: {find_min_1(lst)}')
print(f'Минимальное значение, найденное второй функцией: {find_min_2(lst)}')
