"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

lst = [i for i in range(3, 100, 2)]

print(lst)

def min_num_n2(lst):
    for i in lst:
        min_el = True
        for j in lst:
            if i > j:
                min_el = False
            if min_el:
                return i


def min_num_n(lst):
    min_el = lst[0]

    for i in lst:
        if min_el > i:
            min_el = i
    return min_el


print(min_num_n2(lst))
print(min_num_n(lst))
