"""
Задание 4.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""
# Второй вариант гораздо лучше, т.к. сложность меньше
# Первый вариант: O(n) - присутствует цикл
def auth_1(usr, usr_name, passwd):
    for key, value in usr.items():
        if key == usr_name:
            if value['password'] == passwd and value['status']:
                return 'Успешная авторизация!'
            elif value['password'] == passwd and not value['status']:
                return 'Активируйте учетную запись!'
            else:
                return 'Неверный пароль!'
    return 'Пользователя не существует!'

# Второй вариант: O(1) - выполняется только один проход по функции, нет циклов
def auth_2(usr, usr_name, passwd):
    if usr.get(usr_name):
        if usr[usr_name]['password'] == passwd and usr[usr_name]['status']:
            return 'Успешная авторизация!'
        elif usr[usr_name]['password'] == passwd and not usr[usr_name]['status']:
            return 'Активируйте учетную запись!'
        else:
            return 'Неверный пароль!'
    else:
        return 'Пользователя не существует!'


users = {'ivan': {'password': '123456q', 'status': True},
         'pasha': {'password': '123QWEasd', 'status': True},
         'ded': {'password': 'qwerty', 'status': False}
         }

username = input('Введите логин: ')
password = input('Введите пароль: ')
print(auth_1(users, username, password))
print(auth_2(users, username, password))
