"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через списковое включение.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""


# O(n^2)
def comaprison_1(list_name):
    for i in list_name:
        mini = 1
        for z in list_name:
            if i > z:
                mini = 0
        if mini == 1:
            print(i)


# O(n)
def comparison_2(list_name):
    min_val = list_name[0]
    for i in list_name[1:]:
        if i < min_val:
            min_val = i
    print(min_val)


ll = [199, 2, 343, 1]

comaprison_1(ll)
comparison_2(ll)
