"""
Задание 3.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""

# Решение

sample = {'ford': 50, 'audi': 500, 'bmw': 300, 'mercedes': 400, 'kia': 80}

# 1
sorted_income = sorted(sample.values())      #1
sorted_sample_1 = {}                         #1

for i in sorted_income:                      #n**2
    for k in sample.keys():
        if sample[k] == i:
            sorted_sample_1[k] = sample[k]

print(list(sorted_sample_1.items())[-1])     #1
print(list(sorted_sample_1.items())[-2])     #1
print(list(sorted_sample_1.items())[-3])     #1

#2
sorted_sample_2 = {}                           #1
sorted_keys = sorted(sample, key=sample.get)   #1

for k in sorted_keys:                          #n
    sorted_sample_2[k] = sample[k]

for i in range(-1, -4, -1):                    #n
    print(list(sorted_sample_2.items())[i])

# Решение №2 эффективнее, т.к. сложность n < n**2.
