"""
Задание 3.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""



dict_company = {'Ип Ваня': 23234, 'ООО дынька': 23123,
                'OOO красава': 66666, 'Ип Петя': 43242, 'ИП маша': 43432, 'ооо рога':23132}


sorted(dict_company.items(), key=lambda x: x[1], reverse = True) ##O(nlogn)

from collections import Counter
print(dict(Counter(dict_company).most_common(3)))##O(log n)


import heapq
v = list(dict_company.values())
print(heapq.nlargest(3,v)) ##O(n)


## третий вариант максимально быстрый, делаем из словаря список, и по нему проходимся быстрым поиском