"""
Задание 3.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""

base_company = {
    'yandex': 3000,
    'apple': 2000,
    'gazprom': 4000,
    'rosnano': 6000,
    'adidas': 1500
}

lst_from_dict = list(base_company.items())
lst_from_dict.sort(key=lambda i: i[1], reverse=True)
for i in range(4):
    print(lst_from_dict[i][0], ':', lst_from_dict[i][1])



# 0(n log n)
#не самый предпочтительный вариант - самый быстрый был бы  0(n)
