"""
Задание 3.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""
# Вариант 1 : O(n Log n)
# Вариант не самый удачный за счет повышеной сложности в алгоритме(использование sorted)

var_d = {'Рога и копыта': 5000, 'Пупкин и Со': 15000, 'MMM': 22000, 'Loser&Co': 7000, 'People': 13500}
var_company = sorted(var_d.values(), reverse=True)[:3]
for key, value in var_d.items():
    if value in var_company:
        print(f'{key}')


# Вариант 2 : O(n**2)
# Вариант более оптимален, хоть и использует алгоритм с квадратичной сложностью
for i in range(3):
    max_value = max(var_d.values())
    max_keys = [k for k, v in var_d.items() if v == max_value]
    print(max_value, max_keys)
    del var_d[max_keys[0]]