"""
Задание 4.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""


def var_1(users):
    cor_users = []
    for item in users:
        if 0 in users[item]:
            print('Учетная запись пользователя', item, 'не активна.')
        else:
            cor_users.append(item)
    return cor_users


def var_2(users):
    uncor_users = [item for item in users if 0 in users[item]]
    return uncor_users


users = {'user_1': ['pass1', 1],
         'user_2': ['pass2', 0],
         'user_3': ['pass3', 1],
         'user_4': ['pass4', 0],
         'user_5': ['pass5', 1]}

print(var_1(users), '\n')
print('неактивные учетки пользователей', var_2(users))

# не очень понятна формулировка задачи, т.е. что в итоге требуется.
# по сути делается как и предыдущая; в данном решении реализована проверка активности учетки,
# если был нужен еще и пароль, то это добывляет if и т.д.
# т.к. решения сходны, то проблемы оценки в целом те же
# предположительно генератор и Лямбда эффективнее цикла по причине отсутствия лишнего присваивания
# по моему мнению более правильно использовать лямбду
