"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
from random import randint


def min_list(a: list):
    for i in a:
        flag = True
        for j in a:
            if i > j:
                flag = False
        if flag:
            return i


def min_list_2(a: list):
    min_el = a[0]
    for i in a:
        if i < min_el:
            min_el = i
    return min_el


test_list = [randint(0, 1000) for i in range(100)]
print(min_list(test_list))
print(min_list_2(test_list))

'''
В результате получилось O(n^2) у первого метода, и O(n) у второго!
'''
