"""
Задание 4.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""


def autorisation1(users_data, login, password):
    if users_data.get(login):
        if users_data[login][0] == password:
            if users_data[login][1]:
                print(f"Добро пожаловать, {login} !")
            else:
                print(f"{login}, вам нужно активировать аккаунт.")
        else:
            print("Пароль неверный")
    else:
        print("Пользователь не найден.")


def autorisation2(users_data, login, password):
    for key in users_data:
        if key == login:
            if users_data[login][0] == password:
                if users_data[login][1]:
                    print(f"Добро пожаловать, {login} !")
                    return
                else:
                    print(f"{login}, вам нужно активировать аккаунт.")
                    return
            else:
                print("Пароль неверный")
                return
    print("Пользователь не найден.")


users_data = {"ivan": ["1231", True], "petr": ["11111", False], "ira": ["22222", True]}

autorisation1(users_data, "ira", "22222")
autorisation2(users_data, "petr", "11111")
