"""
Задание 4.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""

#### 1 ####

users = {'Phill12': 'qwerty0022', 'Anna848': '123pass456', 'Ivan8989': 'gusigaga', 'Andrew1122': 'flowerpower', 'PetrFirst': 'firstpetr', 'Maria60': 'mariaMARIA', 'ArthurPirozhkov': 'PirizhokArthurov', 'Helen86': '19911991'}

def check_registration(login):
    for i in users.keys():
        if login == i:
            return True
    return False                        # - O(n^2)

def check_password(pswd, login):
    if pswd == users.get(login):
        return True
    return False                        # - O(n)

user_login = input('Введите логин ')

if check_registration(user_login):
    if check_password(input('Введите пароль '), user_login):
        print('Поздравляю! Вы в системе!')
    else:
        print('Ошибка! Неправильный пароль')
else:   
    print('Ошибка! Вы не зарегистрированы в системе!')                # - O(n^2)

                                                                      # - Общая сложность O(n^2)

#### 2 ####

users = {'Phill12': 'qwerty0022', 'Anna848': '123pass456', 'Ivan8989': 'gusigaga', 'Andrew1122': 'flowerpower', 'PetrFirst': 'firstpetr', 'Maria60': 'mariaMARIA', 'ArthurPirozhkov': 'PirizhokArthurov', 'Helen86': '19911991'}

def check_pswd(login):
    if users.get(login) != None:
        if input('Введите пароль ') == users.get(login):
            print('Поздравляю! Вы в системе!')
        else:
            print('Ошибка! Неправильный пароль')
    else:   
        print('Ошибка! Вы не зарегистрированы в системе!')

check_pswd(input('Введите логин '))                                    # - Общая сложность O(n^2)