"""
Задание 3.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""


companies = {"company_1": 1000,
             "company_2": 2000,
             "company_3": 3000,
             "company_5": 500,
             "company_6": 6000,
             "company_7": 5500,
             "company_8": 550,
             }


# 1 вариант  Сложность - О(n*log n)
list_comp = list(companies.items())

list_comp.sort(key=lambda i: i[1], reverse=True)

for i in range(3):
    print(f'Выручка компании {list_comp[i][0]} составляет {list_comp[i][1]}')


# 2-й вариант Сложность О(n)
dict_comp = companies
for i in range(3):
    maxim = max (dict_comp.items(), key = lambda k_v: k_v[1])
    del dict_comp[maxim[0]]
    print(f"Выручка компании {maxim[0]} составляет -  {maxim[1]} ")


# Второй вариант лучше так как у него меньше сложность

