"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
import random


def min_1(lst_obj):
    for i in range(len(lst_obj)):
        is_min = True
        for j in range(len(lst_obj)):
            if lst_obj[i] > lst_obj[j]:
                is_min = False
        if is_min:
            return lst_obj[i]


def min_2(lst_obj):
    result = lst_obj[0]
    for i in range(1, len(lst_obj)):
        if result > lst_obj[i]:
            result = lst_obj[i]
    return result


num_list = [random.randint(1, 100) for i in range(20)]
print(num_list)
print(min_1(num_list))
print(min_2(num_list))
