"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
from random import randint


def min_by_allcheck(lst):
    res_min = lst[0]
    for i in range(len(lst)):
        for j in range(len(lst)):
            if (lst[i] < lst[j]) and (lst[i] < res_min):
                res_min = lst[i]
    return res_min


def min_by_sort(lst):
    res_min = lst[0]
    for i in lst:
        if i < res_min:
            res_min = i
    return res_min


lst = [i for i in range(randint(-200, -100), randint(100, 200))]
print(min_by_allcheck(lst))
print(min_by_sort(lst))
