"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
#O(n)
from random import randint
list = [randint(0,1000) for i in range(10)]
print(list)

def list_min(list):
    min_value = list[0]
    for i in list:
        if i < min_value:
            min_value = i
    return(min_value)

result = list_min(list)
print(result)

#O(n^2)
def list_min2(list):
    min = list[0]
    for i in list:
        for k in list:
            if i < k and i < min:
                min = i
    return min


print(list_min2(list))
