"""
Задание 5.
Задание на закрепление навыков работы с деком

В рассмотренном на уроке листинге есть один недостаток
Приведенный код способен "обработать" только строку без пробелов, например, 'топот'

Но могут быть и такие палиндромы, как 'молоко делили ледоколом'

Вам нужно доработать программу так, чтобы она могла выполнить проверку на палиндром
и в таких строках (включающих пробелы)
"""

expression = input('Введите выражение: ').replace(' ', '')
if expression == expression[::-1]:
    print('Данное выражение является палиндромом')
else:
    print('Данное выражение не является палиндромом')
    