"""
Задание 3.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""

company_info = {'Macdonalds': 10000,
                'Adidas': 15000,
                'Puma': 20000,
                'Apple': 30000,
                'Coca-Cola': 40000,
                'Nike': 50000,
                'Ikea': 100000,
                'Rebok': 35000,
                'Google': 65000}

# O(n*log n)
dictionary = list(company_info.items())
dictionary.sort(key=lambda i: i[1], reverse=True)
for i in range(3):
    print(dictionary[i][0], ':', dictionary[i][1])


# O(n) самый лучший вариант, хотя более длинный

def max_company(companu_input):
    max_input = {}
    list_d = dict(companu_input)
    for i in range(3):
        maximum = max(list_d.items(), key=lambda k_v: k_v[1])
        del list_d[maximum[0]]
        max_input[maximum[0]] = maximum[1]
    return max_input


print(max_company(company_info))
