"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

import random


# Я знаю только как вторым методом реализовать, но первым через два цикла как то костылево получилось
def find_min1(lst: list):
    min_value = lst[0]
    for i in lst[:]:
        for j in lst[:]:
            if i < j:
                if i < min_value:
                    min_value = i
    return min_value


def find_min2(lst: list):
    min_value = lst[0]
    for i in lst[:]:
        if i < min_value:
            min_value = i
    return min_value


user_list = [random.randint(1, 1000) for val in range(1, 10)]

print(user_list)
print(find_min1(user_list))
print(find_min2(user_list))
