"""
Задание 3.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""
companies = [('lada', 100), ('audi', 56), ('torota', 11), ('uaz', 101), ('mazda', 123)]
print(companies)

res = sorted(companies, key=lambda company: company[1], reverse=True)
print(f'3 most valuable companies: {res[0]}, {res[1]} , {res[2]}')
# O(1) констатное, придумал только одно решение, мне кажется решения эффективнее нет,
# потому, что задействована встроенная функция питона, а они самые быстрые
