"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""


def min_value_On2(lst):
    min_v = 0
    for i in range(len(lst)-1):
        i_min = i
        j = i + 1
        for j in range(len(lst)):
            if lst[j] < lst[i_min]:
                i_min = j
                min_v = lst[i]
                lst[i] = lst[i_min]
                lst[i_min] = min_v
    return min_v


def min_value_On(lst):
    return min(lst)


lst_ = [10, -10, 3, -2, -100, 15]
print(min_value_On(lst_))
print(min_value_On2(lst_))
