"""
Задание 4.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""

users_dict = {
    'Андрей': {'password': '123456', 'activation': True},
    'Иван': {'password': '12346', 'activation': False},
    'Николай': {'password': '122346', 'activation': True}
}

'''Решение № 1'''


# Итоговая сложность О(n)
def check_activation_1(users, user_name, password):
    for key, value in users.items():  # O(n)
        if key == user_name:  # O(1)
            if value['password'] == password and value['activation'] == True:  # O(1)
                return 'Добро пожаловать'
            elif value['password'] != password:  # O(1)
                return 'Вы ввлели не правильный пароль'
            else:
                return 'Ваша учетная запись не активирована. Пожалуйста, активируйте учетную запись'
        else:
            return 'Такого имени не существует'


'''Решение № 2'''


# Итоговая сложность О(1), т.к. нет прохода по циклу. Данное решение более оптимальное
def check_activation_2(users, user_name, password):
    if users.get(user_name):  # O(1)
        if password == users[user_name]['password'] and users[user_name]['activation'] == True:  # O(1)
            return 'Добро пожаловать'
        elif password != users[user_name]['password']:  # O(1)
            return 'Вы ввлели не правильный пароль'
        else:
            return 'Ваша учетная запись не активирована. Пожалуйста, активируйте учетную запись'
    else:
        return 'Такого имени не существует'


name = input('Введите имя: ')
user_password = input('Введите пароль: ')
# print(check_activation_1(users_dict, name, user_password))
print(check_activation_2(users_dict, name, user_password))
