"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

a = [int(item) for item in input().split()]

# Алгоритм второй сложность О(n)


def my_min1(*x):
    m = a[0]
    for i in a:  # сложность О(n)
        if i < m:
            m = i
    return(m)


# Алгоритм второй сложность О(n*2)
def alg2(a):
    m = a[0]
    for i in a:  # сложность О(n)
        if i <= my_min1(a):  # сложность О(n)
            m = i
    return(m)


print(alg2(a))


# Алгоритм второй сложность О(n)
def my_min1(*x):
    m = a[0]
    for i in a:  # сложность О(n)
        if i < m:
            m = i
    return(m)


print(my_min1(a))
