"""
Задание 3.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""

'''Сложность: O(n**2)'''


def finder1(data):
    numbers = []
    for i in data:
        numbers.append(i[1])
    result = []
    for i in range(3):
        index = numbers.index(max(numbers))
        numbers.pop(index)
        result.append(data.pop(index))
    print(result)


'''Сложность: O(n**2)'''


def finder2(data):
    ln = len(data)
    for item in range(ln - 1):
        for j in range(ln - item - 1):
            if data[j][1] < data[j + 1][1]:
                data[j], data[j + 1] = data[j + 1], data[j]
    print(data[:3])


'''Сложность: O(n) - самое эффективное т.к. ассимптотическая сложность наименьшая'''


def finder3(data):
    first, second, third = [None, 0], [None, 0], [None, 0]
    for item in data:
        if item[1] > first[1]:
            first, second, third = item, first, second
        elif item[1] > second[1]:
            second, third = item, second
        elif item[1] > third[1]:
            third = item
    print(first)
    print(second)
    print(third)


company = [["ИП Вася Пупкин", 60000000], ["ООО Мали", 10000000], ["Росатом", 498000000000], ["Сбербанк", 241100000000]]
finder1(company[:])
print('*' * 100)
finder2(company[:])
print('*' * 100)
finder3(company[:])
