"""
Задание 4.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""

d = {'login': ['Ivan', 'Petr', 'Semen'],
    'password': ['123', '231', '321'],
    'bool': [True, True, False]}

# O(N) Тут сложность меньше, наверно. Всего один перебор.
def aut():
    log = input('login ')
    temp = False
    for i in range(len(d['login'])):
        if log == d['login'][i]:
            temp = True
            pas = input('password ')
            if pas == d['password'][i]:
                if d['bool'][i] == True:
                    print('Привет!')
                else:
                    print('Нужно пройти проверку')
            else:
                print('Не тот пароль')
    if temp == False:
        print('Нет доступа')


# Если у меня 2 не вложенных друг в друга перебора, а один за другим,
# то это значимо для сложности?
# O(2N)?
# В уроке число перед N обозначало запись в переменную, тогда как будет правильно записать два цикла?
def aut_two():
    log = input('login ')
    if log in d['login']:
        for i in range(len(d['login'])):
            if log == d['login'][i]:
                pas = input('password ')
                if pas == d['password'][i] and d['bool'][i] == True:
                    print('Привет!')
                    return
                else:
                    print('Пройдите регистрацию')
                    return
            else:
                print('Пройдите регистрацию')
                return