"""
Задание 2.
Реализуйте два алгоритма.
Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.
Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.
Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""
import random

list_1 = [random.randint(0, 100) for el in range(1, 6)]
print(list_1)

#алгоритм 2:
#сложность O(N)


def alg_2():
    el_min = list_1[0]  ## O(1)
    for el in range(1, len(list_1)):  ## O(N)
        if list_1[el] < el_min:  ##O(1)
            el_min = list_1[el]  ## 1
    return el_min  ## 1


print(alg_2())

#алгоритм 1:
#сложность O(N^2)


def alg_1():
    for el in range(1, len(list_1)):  ## O(N)
        el_min = list_1[el]
        for new_el in range(2, len(list_1)):  ##O(N)
            if list_1[new_el] < el_min:  ##O(1)
                el_min = list_1[new_el]  ## 1
        return el_min  ## 1


print(alg_1())