"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""


# 1 пример (Это очень криво, но под условия задачи подходит)

def minimum_search(any_list):
    k = any_list[0]
    for i in range(1, len(any_list)):
        for j in range(1, len(any_list[:])):
            if any_list[i] > any_list[:][j] and any_list[:][j] <= k:
                k = any_list[:][j]
    return k





# 2 пример
def minimum_function(any_list):
    minimum = any_list[0]
    for i in range(1, len(any_list)):
        if any_list[i] < minimum:
            minimum = any_list[i]
    return minimum

first_list = [3, 2, 5, 6, 10, 15]


printer = minimum_function(first_list)
print(printer)
printer = minimum_search(first_list)
print(printer)
