"""
Задание 4.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""
def auth(in_users, in_active): # O(1), так как все используемые операции над словарем имеют сложность О(1)
    print('Please input username:')
    v_user=input()
    print('Please input password:')
    v_pass=input()
    if v_user not in in_users:
        print('Invalid username or password!')
        return
    if v_pass != in_users[v_user]:
        print('Invalid username or password!')
        return
    if in_active[v_user] != 'Y':
        print('Your account is not active, would you like to activate it?(Y/N)')
        v_act = input()
        if v_act.upper() == 'Y':
            in_active[v_user]='Y'
            print('Your account is active now!')
    print('You are logged in.')

if __name__ == '__main__':
    v_users =  {'Ivan':'qwerty',
                'admin':'admin',
                'John':'Doe',
                'Odin':'Wednesday',
                'V':'Silverhand',
                'Jacky':'Afterlife',
                'Test':'Test'}

    v_active =  {'Ivan':'Y',
                'admin':'Y',
                'John':'N',
                'Odin':'N',
                'V':'Y',
                'Jacky':'N',
                'Test':'Y'}

    auth(v_users, v_active)
