"""
Задание 4.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Пользователи веб-ресурса проходят аутентификацию.
В системе хранятся логин, пароль и отметка об активации учетной записи.

Нужно реализовать проверку, может ли пользователь быть допущен к ресурсу.
При этом его учетка должна быть активирована.
А если нет, то польз-лю нужно предложить ее пройти.

Приложение должно давать ответы на эти вопросы и быть реализовано в виде функции.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
"""

"""
auth_2 - оптимальнее исходя из расчета сложности О-большое, потребуется меньше времени 
"""


def auth_1(login, pwd):
    """
    сложность N - линейная
    """
    for key, item in storage.items():
        if key == login and item["password"] == pwd:
            if item["act"] == 1:
                print("Успешный вход")
                return
            else:
                print("Необходимо выполнить активацию")
                return

    print("Неправильный логин/пароль")
    return


def auth_2(login, pwd):
    """
    сложность O(1)
    """
    item = storage.get(login)
    if not (item is None):
        if item["password"] == pwd:
            if item["act"] == 1:
                print("Успешный вход")
                return
            else:
                print("Необходимо выполнить активацию")
                return
        else:
            print("Неправильный логин/пароль")
            return
    else:
        print("Неправильный логин/пароль")
        return

storage = {"login1": {"password": "pass1", "act": 0}, "login2": {"password": "pass2", "act": 1},
           "login3": {"password": "pass3", "act": 1}}

auth_1("login1", "pass2")
auth_1("login1", "pass1")
auth_1("login2", "pass2")
print("--------------------------")
auth_2("login1", "pass2")
auth_2("login1", "pass1")
auth_2("login2", "pass2")
