"""
Задание 3.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""

my_dict = {'Фирма 6': 60000, 'Фирма 5': 50000, 'Фирма 1': 10000, 'Фирма 2': 20000, 'Фирма 3': 30000, 'Фирма 4': 40000}


#  Решение 1
#  O(n log n )

my_dict_copy = list(my_dict.items())         # O(1)
my_dict_copy.sort()                          # O(n log n)
print(f'Решение 1:  {my_dict_copy[(len(my_dict_copy))-3:]}')  # O(1)


#  Решение 2
# O(n)
my_max = {}
my_dict_copy2 = my_dict

for i in range(3):
    max_value = max(my_dict_copy2.items(), key=lambda k_v: k_v[1])
    del my_dict_copy2[max_value[0]]
    my_max[max_value[0]] = max_value[1]
print(f'Решение 2: {my_max}')



