"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

# 1) O(n^2) - квадратичная

def min_value_2(list_obj):
    start = list_obj[1]
    for i in list_obj:
        for j in list_obj:
            if i > j and j < start:
                start = j
    return start

# 2) O(n) - линейная

def min_value(list_obj):
    start = list_obj[0] 
    for i in list_obj: 
        if i < start: 
            start = i
    return start
    
