"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

from random import randint


def number_game(number, user_tries):
    answer = int(input('Ваше предположение: '))
    user_tries -= 1
    if number == answer:
        print('Абсолютно верно!')
        return
    elif user_tries == 0:
        print(f'К сожалению, вы не угадали. Это было число {number}')
        return
    elif number > answer:
        print('Ваш ответ меньше загаданного числа')
    elif number < answer:
        print('Ваш ответ больше загаданного числа')

    return number_game(number, user_tries)


num = randint(0, 100)
number_game(num, 10)
