"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def sum_elements(num, sum_el=0, first_el=1.0):
    if num <= 0:
        return sum_el
    sum_el += first_el
    first_el = -first_el / 2
    num -= 1
    return sum_elements(num, sum_el, first_el)


user_num = int(input('Введите количество элементов: '))
print(f'Количество элементов - {user_num}, их сумма - {sum_elements(user_num)}')
