"""
Задание 1.
Реализуйте заполнение списка и словаря, сделайте замеры и сделайте выводы, обоснуйте результат.
Сделайте несколько операций с каждым из объектов, сделайте замеры и сделайте выводы, обоснуйте результат.
Подсказка: для замеров воспользуйтесь модулем time (см. примеры урока 1)
Примечание: eсли вы уже знаете, что такое декоратор и как его реализовать,
то реализуйте ф-цию-декоратор и пусть она считает время
И примените ее к двум своим функциям.
"""
import time
def get_time(function_decorate):
    def function(a):
        start_time = time.time()
        function_decorate(a)
        print(time.time() - start_time)
    return function

@get_time
def test_list(a):
    list = []
    for i in range(a):
        list.append(i)
    return list

@get_time
def test_dict(a):
    dict = {}
    for i in range(a):
        dict.update({i:i})
    return dict

test_list(100000)
test_dict(100000)

# Заполнение словаря происходит дольше чем заполнение списка так как
# у словоря есть механизм защиты от коллизии, который замедляет вроцесс выполнения.