"""
Задание 3.
Определить количество различных подстрок с использованием хеш-функции.
Дана строка S длиной N, состоящая только из строчных латинских букв.
Подсказка: примените хеши и множества
рара:
рар
ра
ар
ара
р
а
"""
import hashlib
a = input('Введите строку из строчных латинских букв:')
s = set()
l = len(a)
for i in range(l):
    if i == 0:
        l = len(a) - 1
    else:
        l = len(a)
    for j in range(l, i, -1):
        print(a[i:j])
        s.add(hashlib.sha1(a[i:j].encode('utf-8')).hexdigest())

print(s)
print(f'Колличество различных подстрок: {len(s)}')