"""
Задание 3 *.
Сделать профилировку для скриптов с рекурсией и сделать описание,
можно ли так профилировать и есть ли 'подводные камни' в профилировании?
Придумать как это решить!
Есть очень простое решение!
"""

import asyncio
from memory_profiler import profile


@profile
async def sum_1(n1, even=0, odd=0):
    if not n1:
        print(f'чет = {even}, нечет = {odd}')
        return
    else:
        if int(n1[0]) % 2 == 0:
            even += 1
        else:
            odd += 1
        return sum_1(n1[1:], even, odd)


loop = asyncio.get_event_loop()
loop.run_until_complete(sum_1(str(34560)))

sum_1(str(124123543125464364526345356))

"""
В документации к memory_profiler нашел пример "Get rid of unnecessary print"
Реализация через корутины (сопрограммы)
То есть профилирование мы выполняем в отдельном потоке. Этот подход рекомендуется использовать
 в современных приложениях, где нужен одновременный доступ к большому объему данных. 
 
 про 'подводные камни': нет идей
  
"""
