"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def foo(count, i=1, result=0):
    if result == count * (count + 1) / 2:
        return f'kaef'
    return foo(count, i+1, result + i)


print(foo(5))
