"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

import random


def recur_method(shans, number):
    print(f"Попытка {shans}.")
    try:
        answer = int(input("Введите число от 0 до 100: "))
        if shans == 10 or answer == number:
            if answer == number:
                print("Вы отгадали, поздравляю!")
        else:
            if answer > number:
                print(f"Загаданное число меньше чем {answer}.")
            else:
                print(f"Загаданное число больше чем {answer}.")
            recur_method(shans + 1, number)
    except ValueError:
        print("Вы ввели число не по уловиям.")
        recur_method(shans + 1, number)
number = random.randint(0, 100)
recur_method(1, number)
