"""
3.	Сформировать из введенного числа обратное по порядку входящих в него
цифр и вывести на экран. Например, если введено число 3486,
 то надо вывести число 6843.

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число, которое требуется перевернуть: 123
Перевернутое число: 321
"""


def reverse(number, reverse_number=0):
    if number == 0:
        return reverse_number
    else:
        reverse_number = (reverse_number * 10) + (number % 10)
        number = number // 10
        return reverse(number, reverse_number)


try:
    number = int(input("Введите натуральное число: "))
    print(f"Перевернутое число: {reverse(number)}")
except (ValueError, RecursionError):
    print("Ввели не по условию.")
