"""
4.	Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
Количество элементов (n) вводится с клавиатуры.

Пример:
Введите количество элементов: 3
Количество элементов - 3, их сумма - 0.75

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def recur_method(shag, state, elem, sum):
    if shag == elem:
        print(f"Количество элементов - {elem}, их сумма - {sum}")
    elif shag < elem:
        return recur_method(shag + 1, state / 2 * -1, elem, sum + state)


try:
    elem = int(input("Введите количество элементов: "))
    recur_method(0, 1, elem, 0)
except (ValueError, RecursionError):
    print("Ввели не по условию.")
