"""
2.	Посчитать четные и нечетные цифры введенного натурального числа.
Например, если введено число 34560, то у него 3 четные цифры
(4, 6 и 0) и 2 нечетные (3 и 5).

Подсказка:
На каждом шаге вам нужно 'доставать' из числа очередную цифру
и смотреть является ли она четной или нечетной. При этом увеличиваем соответствующий счетчик
Пока все числа не извлечены рекурсивные вызовы продолжаем
Условие завершения рекурсии - все числа извлечены

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7

Пример:
Введите число: 123
Количество четных и нечетных цифр в числе равно: (1, 2)
"""


def chet_nechet(number, chet=0, nechet=0):
    if number == 0:
        return chet, nechet
    else:
        ost = number % 10
        number = number // 10
        if ost % 2 == 0:
            chet = chet + 1
            return chet_nechet(number, chet, nechet)
        else:
            nechet += 1
            return chet_nechet(number, chet, nechet)


try:
    number = int(input("Введите натуральное число: "))
    print(f"Колличество четных и нечетных цифр: {chet_nechet(number)}")
except (ValueError, RecursionError):
    print("Ввели не по условию.")