"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

# чтобы доказать равенство, необходимо написать 2 функции(для левой и для правой частей равенства)
def left_part(n : int):
    if n == 1:
        return 1
    return n + left_part(n-1)

def right_part(n : int):
    return int(n * (n +1) / 2)

print(left_part(235))
print(right_part(235))
# Вывод: обе части равны, а следовательно равенство доказано!