"""
6.	В программе генерируется случайное целое число от 0 до 100.
Пользователь должен его отгадать не более чем за 10 попыток. После каждой
неудачной попытки должно сообщаться больше или меньше введенное пользователем
число, чем то, что загадано. Если за 10 попыток число не отгадано,
то вывести загаданное число.

Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""

import random
numb = random.randint(0, 100)
def take_number(numb : int, try_count : int = 1):
    print(f"Попытка номер {try_count}")
    user_input = int(input("Введите число: "))
    if (try_count == 10):
        print(f"Использовано маклсимальное число попыток. Загаданное число было {numb}")
    else:
        if (user_input == numb):
            print(f"Вы угадали число {numb}!")
        elif (user_input > numb):
            print(f"Введённое число больше загаданного, введите число поменьше")
            take_number(numb, try_count+1)
        else:
            print(f"Введённое число меньше загаданного, введите число побольше")
            take_number(numb, try_count+1)

print(numb)  # для проверки
take_number(numb)


