"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""
from collections import namedtuple

n = input('Введите количество предприятий для расчета средней прибыли: _')
while not n.isdecimal():
    n = input('Вы ошиблись при вводе! Попробуйте снова: _')
    n.isdecimal()
n = int(n)
fin_pr = {}
avg = 0
while n > 0:
    name = input('Введите назнвание фирмы: _')
    pr = input('Введите прибыль фирмы за каждый квартал через пробел: _')
    pr = pr.split(' ')
    pr_check = [str(i).isdecimal() for i in pr]
    while not all(pr_check) or len(pr) != 4:
        pr = input('Вы ошиблись! Введите прибыль фирмы за каждый квартал через пробел: _')
        pr = (pr.split(' '))
        pr_check = [str(i).isdecimal() for i in pr]
    new_pr = list(map(int, pr))
    FIN = namedtuple('firm', 'f_name f_list')
    FIRM = FIN(
        f_name=name,
        f_list=sum(new_pr))
    fin_pr[FIRM.f_name] = FIRM.f_list
    n -= 1
avg = round(sum(fin_pr.values())/len(fin_pr.values()))
print (f'Средняя прибыль фирм равна {avg}')
for k,v in fin_pr.items():
    if fin_pr[k] < avg:
        print(f'Прибыль фирмы {k} равна {fin_pr[k]} и она меньше средней')
    else:
        print(f'Прибыль фирмы {k} равна {fin_pr[k]} и она больше средней')

