"""
1.	Пользователь вводит данные о количестве предприятий, их наименования и прибыль
за 4 квартала (т.е. 4 отдельных числа) для каждого предприятия.
Программа должна определить среднюю прибыль (за год для всех предприятий)
и вывести наименования предприятий, чья прибыль выше среднего и отдельно
вывести наименования предприятий, чья прибыль ниже среднего.

Подсказка:
Для решения задачи обязательно примените какую-нибудь коллекцию из модуля collections
Для лучшее освоения материала можете даже сделать несколько решений этого задания,
применив несколько коллекций из модуля collections

Пример:
Введите количество предприятий для расчета прибыли: 2
Введите название предприятия: Рога
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 235 345634 55 235

Введите название предприятия: Копыта
через пробел введите прибыль данного предприятия
за каждый квартал(Всего 4 квартала): 345 34 543 34

Средняя годовая прибыль всех предприятий: 173557.5
Предприятия, с прибылью выше среднего значения: Рога

Предприятия, с прибылью ниже среднего значения: Копыта
"""

from collections import namedtuple

RES = namedtuple('Companies', 'Name profits')
companies = {}
avarage_profit = 0
companies_profit_less = []
companies_profit_more = []

col = int(input("Введите количество предприятий для расчета прибыли: "))
for i in range(col):
    name = input("Введите название предприятия: ")
    profits = input("через пробел введите прибыль данного предприятия за каждый квартал(Всего 4 квартала): ")
    profitSeparate = [int(i) for i in profits.split()]
    avarage_profit += sum(profitSeparate)
    companies[name] = profitSeparate

avarage_profit = avarage_profit / col
print("Средняя годовая прибыль всех предприятий: ", avarage_profit)

for key, key_value in companies.items():
    profit_sum = sum(key_value)
    if profit_sum > avarage_profit:
        companies_profit_more.append(key)
    elif profit_sum < avarage_profit:
        companies_profit_less.append(key)

print("Предприятия, с прибылью выше среднего значения: ", companies_profit_more)
print("Предприятия, с прибылью ниже среднего значения: ", companies_profit_less)
