"""
3. Массив размером 2m + 1, где m – натуральное число, заполнен случайным образом.
Найдите в массиве медиану. Медианой называется элемент ряда, делящий его на
две равные части: в одной находятся элементы, которые не меньше медианы,
в другой – не больше медианы.

Задачу можно решить без сортировки исходного
массива.

Но если это слишком сложно, то используйте метод сортировки,
который не рассматривался на уроках: Шелла, Гномья, ...

arr[m]
from statistics import median
"""
from random import randint
from statistics import median

nums = int(input('Введите m, для массива 2m + 1: '))
orig_list = [randint(-100, 100) for _ in range(2 * nums + 1)]
print(f'Медиана списка {orig_list} равна {median(orig_list)}')

# Выполнено без сортировки, но с подсказкой (если я кончно правильно понял задание)
