"""
3. Массив размером 2m + 1, где m – натуральное число, заполнен случайным образом.
Найдите в массиве медиану. Медианой называется элемент ряда, делящий его на
две равные части: в одной находятся элементы, которые не меньше медианы,
в другой – не больше медианы.

Задачу можно решить без сортировки исходного
массива.

Но если это слишком сложно, то используйте метод сортировки,
который не рассматривался на уроках: Шелла, Гномья, ...

arr[m]
from statistics import median
"""

from random import randint

m = 5
arr = [randint(0, 100) for _ in range(2 * m + 1)]
print(f'Неотсортированный массив: {arr}')


def gnome(array):
    data = array
    i = 1
    while i < len(data):
        if data[i - 1] <= data[i]:
            i += 1
        else:
            data[i - 1], data[i] = data[i], data[i - 1]
            if i > 1:
                i -= 1
    return data


print(f'Отсортированный массив: {gnome(arr)}')
print(f'Медиана: {arr[m]}')
