"""
2. Отсортируйте по возрастанию методом слияния одномерный вещественный массив,
заданный случайными числами на промежутке [0; 50). Выведите на экран исходный
и отсортированный массивы.

Пример:
Введите число элементов: 5
Исходный - [46.11436617832828, 41.62921998361278, 18.45859540989644, 12.128870723745806, 8.025098788570562]
Отсортированный - [8.025098788570562, 12.128870723745806, 18.45859540989644, 41.62921998361278, 46.11436617832828]
"""
from random import uniform

def merge_sort(lst_obj):
    if len(lst_obj) > 1:
        center = len(lst_obj) // 2
        left = lst_obj[:center]
        right = lst_obj[center:]

        merge_sort(left)
        merge_sort(right)

        # перестали делить
        # выполняем слияние
        i, j, k = 0, 0, 0

        while i < len(left) and j < len(right):
            if left[i] < right[j]:
                lst_obj[k] = left[i]
                i += 1
            else:
                lst_obj[k] = right[j]
                j += 1
            k += 1

        while i < len(left):
            lst_obj[k] = left[i]
            i += 1
            k += 1

        while j < len(right):
            lst_obj[k] = right[j]
            j += 1
            k += 1
        return lst_obj

len_lst = int(input('Введите число элементов: '))
orig_list = [uniform(0, 50) for _ in range(len_lst)]
print(f'Исходный - {orig_list}')
print(f'Отсортированный - {merge_sort(orig_list)}')
'''
Введите число элементов: 5
Исходный - [29.3452355018727, 41.65787228880174, 2.9758119472227063, 0.08461132240559777, 4.742611133017283]
Отсортированный - [0.08461132240559777, 2.9758119472227063, 4.742611133017283, 29.3452355018727, 41.65787228880174]

Понадобилось не мало времени, чтобы понять код с урока.
Примеры кода из интернета были проще для понимания, но все они были реализованны через 2 функции
1я которая делила список пополам и рекурсилась пока не останется 1 элемент и вызывала вторую, 
которая его сортировала и сливала в один
'''
