"""
3. Массив размером 2m + 1, где m – натуральное число, заполнен случайным образом.
Найдите в массиве медиану. Медианой называется элемент ряда, делящий его на
две равные части: в одной находятся элементы, которые не меньше медианы,
в другой – не больше медианы.

Задачу можно решить без сортировки исходного
массива.

Но если это слишком сложно, то используйте метод сортировки,
который не рассматривался на уроках: Шелла, Гномья, ...

arr[m]
from statistics import median
"""
from statistics import median
from random import randint

def sort_lst(lst_obj):
    min = []
    max = []
    i = 0
    while i < len(lst_obj):
        if lst_obj[i] < median(lst_obj):
            min.append(lst_obj[i])
        else:
            max.append(lst_obj[i])
        i +=1
    return f'элементы меньше медианы: {min} \nэлементы больше медианы: {max}\nмедиана {median(lst_obj)}'


orig_list = [randint(-100, 100) for _ in range(int(input('Введите число элементов: ')))]
print(sort_lst(orig_list))
'''
Введите число элементов: 5
элементы меньше медианы: [-84, -100] 
элементы больше медианы: [33, 69, -31]
медиана -31
'''