"""
3. Массив размером 2m + 1, где m – натуральное число, заполнен случайным образом.
Найдите в массиве медиану. Медианой называется элемент ряда, делящий его на
две равные по длине части: в одной находятся элементы, которые не меньше медианы,
в другой – не больше медианы.

Задачу можно решить без сортировки исходного
массива.

Но если это слишком сложно, то используйте метод сортировки,
который не рассматривался на уроках: Шелла, Гномья, Кучей...

[5, 3, 4, 3, 3, 3, 3]

[3, 3, 3, 3, 3, 4, 5]

my_lst
new_lts

arr[m]


from statistics import median

[3, 4, 3, 3, 5, 3, 3]


left.clear()
right.clear()


m = 3
len = 7
i
left = []
right = []

left == right and

for i in
    for
    left == right
    left.clear()
    right.clear()


"""

###############################################################

import statistics

import numpy as np

###############################################################
min = 1
max = 5
m = 7

randnums = list(np.random.randint(min, max, size=2 * m + 1))
# randnums = [5, 5, 5, 5, 1, 7, 7, 7, 7]
print(randnums)
print(f"median = {statistics.median(randnums)}")
randnums.sort(reverse=True)
print(randnums)

###############################################################
'''
Извините, но это задача из курса прикладной математики. Я эту дисциплину давно забыл.
А в питоне медиану можно найти вот так.
Можно было после randnums.sort взять средний элемент массива. Но это уже совсем не интересно.
'''
