"""
2. Отсортируйте по возрастанию методом слияния одномерный вещественный массив,
заданный случайными числами на промежутке [0; 50). Выведите на экран исходный
и отсортированный массивы.

Пример:
Введите число элементов: 5
Исходный - [46.11436617832828, 41.62921998361278, 18.45859540989644, 12.128870723745806, 8.025098788570562]
Отсортированный - [8.025098788570562, 12.128870723745806, 18.45859540989644, 41.62921998361278, 46.11436617832828]
"""
from random import random


def merge(A: list, B: list):
    """Слияние двух списков, сортируя по возрастанию"""
    C = [0] * (len(A) + len(B))  # Создание списка после слияния
    i = k = n = 0
    while i < len(A) and k < len(B):
        if A[i] <= B[
            k]:  # Если элемент А меньше элемента Б, кладем в С элемент А
            C[n] = A[i]
            i += 1  # Сравниваем следующий элемент А с элементов Б
            n += 1  # Переходим на следующий элемент С
        else:
            C[n] = B[k]  # Иначе кладем элемент Б
            k += 1  # Сравниваем следующий элемент А с элементов Б
            n += 1  # Переходим на следующий элемент С
    while i < len(
            A):  # Если списки разной длинны, и в списке А остались значения, заполняем ими С
        C[n] = A[i]
        i += 1
        n += 1
    while k < len(
            B):  # Если списки разной длинны, и в списке Б остались значения, заполняем ими С
        C[n] = B[k]
        k += 1
        n += 1
    return C


def merge_sort(A):
    """Сортирует массив А по возрастанию методом слияния"""
    if len(A) <= 1:
        return
    middle = len(A) // 2  # Делим массив пополам
    L = [A[i] for i in range(0, middle)]  # Определяем левую и правую стороны
    R = [A[i] for i in range(middle, len(A))]
    merge_sort(
        L)  # Рекурсивно делим пополам до минимума, на выходе получаем полностью отсортированный список L
    merge_sort(
        R)  # Рекурсивно делим пополам до минимума, на выходе получаем полностью отсортированный список R
    C = merge(L,
              R)  # Делаем слияние двух частей, сортируя их между собой методом слияния
    for i in range(len(A)):  # записываем результат в массив A
        A[i] = C[i]


a = [random() * 50 for i in range(int(input('Введите число элементов: ')))]
print(a)
merge_sort(a)
print(a)
