"""
2. Отсортируйте по возрастанию методом слияния одномерный вещественный массив,
заданный случайными числами на промежутке [0; 50). Выведите на экран исходный
и отсортированный массивы.

Пример:
Введите число элементов: 5
Исходный - [46.11436617832828, 41.62921998361278, 18.45859540989644, 12.128870723745806, 8.025098788570562]
Отсортированный - [8.025098788570562, 12.128870723745806, 18.45859540989644, 41.62921998361278, 46.11436617832828]
"""
from random import uniform
from timeit import timeit


# Сортировка слиянием
def merge_sort(lst_obj):
    if len(lst_obj) > 1:
        center = len(lst_obj) // 2
        left = lst_obj[:center]
        right = lst_obj[center:]
        merge_sort(left)
        merge_sort(right)
        i, j, k = 0, 0, 0
        while i < len(left) and j < len(right):
            if left[i] < right[j]:
                lst_obj[k] = left[i]
                i += 1
            else:
                lst_obj[k] = right[j]
                j += 1
            k += 1
        while i < len(left):
            lst_obj[k] = left[i]
            i += 1
            k += 1
        while j < len(right):
            lst_obj[k] = right[j]
            j += 1
            k += 1
        return lst_obj


# Стандартная сортировка
def sorted_num(lst_obj):
    lst_obj.sort()
    return lst_obj


n = int(input('Введите число элементов: '))
list_num_float = [uniform(0, 50) for i in range(n)]
print(f'Исходный массив: {list_num_float}')
print(f'Отсортированный массив через сортировку слияния: {merge_sort(list_num_float)}')
print(f'Отсортированный массив через стандартную сортировку: {sorted_num(list_num_float)}')
print(f"Время выполнения сортировки слияния: "
      f"{timeit('merge_sort(list_num_float[:])', 'from __main__ import merge_sort, list_num_float', number=10000)}")
print(f"Время выполнения стандартной сортировки: "
      f"{timeit('sorted_num(list_num_float[:])', 'from __main__ import sorted_num, list_num_float', number=10000)}")

"""
Введите число элементов: 5
Исходный массив: [23.000874938412153, 22.62884888447253, 46.823271306082134, 35.351220084007515, 2.5732543624002013]
Отсортированный массив через сортировку слияния: [2.5732543624002013, 22.62884888447253, 23.000874938412153, 35.351220084007515, 46.823271306082134]
Отсортированный массив через стандартную сортировку: [2.5732543624002013, 22.62884888447253, 23.000874938412153, 35.351220084007515, 46.823271306082134]
Время выполнения сортировки слияния: 0.07602930000000008
Время выполнения стандартной сортировки: 0.0028631000000003404

Как мы видим сортировка слияния медленнее стандартной сортировки, так же сортировка слияния занимает больше памяти,
так как мы храним отдельно разделенные элементы массива в стеке
"""



