"""
2. Отсортируйте по возрастанию методом слияния одномерный вещественный массив,
заданный случайными числами на промежутке [0; 50). Выведите на экран исходный
и отсортированный массивы.

Пример:
Введите число элементов: 5
Исходный - [46.11436617832828, 41.62921998361278, 18.45859540989644, 12.128870723745806, 8.025098788570562]
Отсортированный - [8.025098788570562, 12.128870723745806, 18.45859540989644, 41.62921998361278, 46.11436617832828]
"""

from random import uniform
from timeit import timeit


# Сортировка слиянием
def merge_sort(lst_obj):
    if len(lst_obj) > 1:
        center = len(lst_obj) // 2
        left = lst_obj[:center]
        right = lst_obj[center:]
        merge_sort(left)
        merge_sort(right)
        i, j, k = 0, 0, 0
        while i < len(left) and j < len(right):
            if left[i] < right[j]:
                lst_obj[k] = left[i]
                i += 1
            else:
                lst_obj[k] = right[j]
                j += 1
            k += 1
        while i < len(left):
            lst_obj[k] = left[i]
            i += 1
            k += 1
        while j < len(right):
            lst_obj[k] = right[j]
            j += 1
            k += 1
        return lst_obj


# Стандартная сортировка
def sorted_num(lst_obj):
    lst_obj.sort()
    return lst_obj


n = int(input('Введите число элементов: '))
list_num_float = [uniform(0, 50) for i in range(n)]
print(f'Исходный массив: {list_num_float}')
print(f'Отсортированный массив через сортировку слияния: {merge_sort(list_num_float)}')
print(f'Отсортированный массив через стандартную сортировку: {sorted_num(list_num_float)}')
print(f"Время выполнения сортировки слияния: "
      f"{timeit('merge_sort(list_num_float[:])', 'from __main__ import merge_sort, list_num_float', number=10000)}")
print(f"Время выполнения стандартной сортировки: "
      f"{timeit('sorted_num(list_num_float[:])', 'from __main__ import sorted_num, list_num_float', number=10000)}")

"""
Введите число элементов: 5
Исходный массив: [13.432261531374301, 42.216735741343605, 20.55051263954983, 19.038794500874477, 18.577299967795113]
Отсортированный массив через сортировку слияния: [13.432261531374301, 18.577299967795113, 19.038794500874477, 20.55051263954983, 42.216735741343605]
Отсортированный массив через стандартную сортировку: [13.432261531374301, 18.577299967795113, 19.038794500874477, 20.55051263954983, 42.216735741343605]
Время выполнения сортировки слияния: 0.04438899999999979
Время выполнения стандартной сортировки: 0.0017146000000001216

Сортировка слияния медленнее стандартной сортировки и она занимает больше памяти,
так как мы храним отдельно разделенные элементы массива в стеке.
"""
