"""
2. Отсортируйте по возрастанию методом слияния одномерный вещественный массив,
заданный случайными числами на промежутке [0; 50). Выведите на экран исходный
и отсортированный массивы.

Пример:
Введите число элементов: 5
Исходный - [46.11436617832828, 41.62921998361278, 18.45859540989644, 12.128870723745806, 8.025098788570562]
Отсортированный - [8.025098788570562, 12.128870723745806, 18.45859540989644, 41.62921998361278, 46.11436617832828]
"""

import random


def merge_sort(lst_obj):
    if len(lst_obj) > 1:
        center = len(lst_obj) // 2
        left = lst_obj[:center]
        right = lst_obj[center:]

        merge_sort(left)
        merge_sort(right)

        # перестали делить
        # выполняем слияние
        i, j, k = 0, 0, 0

        while i < len(left) and j < len(right):
            if left[i] < right[j]:
                lst_obj[k] = left[i]
                i += 1
            else:
                lst_obj[k] = right[j]
                j += 1
            k += 1

        while i < len(left):
            lst_obj[k] = left[i]
            i += 1
            k += 1

        while j < len(right):
            lst_obj[k] = right[j]
            j += 1
            k += 1
        return lst_obj


orig_list = [random.randint(0, 50) for _ in range(10)]


num = int(input('Число элементов: '))
our_list = [random.random() * 50 for _ in range(num)]

print(f'Исходный массив {our_list}\n'
      f'Отсортированный {merge_sort(our_list)}')


"""
Результат:
Число элементов: 10
Исходный массив [36.139900844196625, 10.23805198332467, 10.543571871440744, 18.588090186307966, 34.369040934095864, 15.428844963628347, 23.65412875527374, 18.211746251821737, 12.627352404249532, 49.61480098179655]
Отсортированный [10.23805198332467, 10.543571871440744, 12.627352404249532, 15.428844963628347, 18.211746251821737, 18.588090186307966, 23.65412875527374, 34.369040934095864, 36.139900844196625, 49.61480098179655]

"""