"""
1. Отсортируйте по убыванию методом "пузырька" одномерный целочисленный массив,
заданный случайными числами на промежутке [-100; 100). ---- 1
Выведите на экран исходный и отсортированный массивы. ---- 2
Сортировка должна быть реализована в виде функции. ---- !
Обязательно доработайте алгоритм (сделайте его умнее). ---- 3
Идея доработки: если за проход по списку не совершается ни одной сортировки, то завершение
Обязательно сделайте замеры времени обеих реализаций --- 4

Подсказка: обратите внимание, сортируем не по возрастанию, как в примере,
а по убыванию

Подсказка: обратите внимание, сортируем не по возрастанию, как в примере,
а по убыванию
"""
