"""
3. Массив размером 2m + 1, где m – натуральное число, заполнен случайным образом.
Найдите в массиве медиану. Медианой называется элемент ряда, делящий его на
две равные части: в одной находятся элементы, которые не меньше медианы,
в другой – не больше медианы.

Задачу можно решить без сортировки исходного
массива.

Но если это слишком сложно, то используйте метод сортировки,
который не рассматривался на уроках: Шелла, Гномья, ...

arr[m]
from statistics import median
"""
from random import randint


def median_1(lst):
    while len(lst) != 1:
        lst.remove(max(lst))
        lst.remove(min(lst))
    return lst[0]


my_list = [randint(-100, 100) for i in range(11)]
print(f'базовый список {my_list}')
print(f'медиана списка {median_1(my_list)}')
