"""
3. Массив размером 2m + 1, где m – натуральное число, заполнен случайным образом.
Найдите в массиве медиану. Медианой называется элемент ряда, делящий его на
две равные части: в одной находятся элементы, которые не меньше медианы,
в другой – не больше медианы.

Задачу можно решить без сортировки исходного
массива.

Но если это слишком сложно, то используйте метод сортировки,
который не рассматривался на уроках: Шелла, Гномья, ...

arr[m]
from statistics import median
"""

from statistics import median
from random import randint


def median_with_sort(array, middle):
    return sorted(array)[middle]


def median_no_sort(array):
    """ Вычисление медианы списка без сортировки """
    for i in range(len(array)):
        result = 0
        temp = 0
        for j in range(len(array)):  # берём элемент массива
            if j != i:  # кроме самого себя сравниваем с другими элементами
                if array[j] > array[i]:
                    result += 1  # числа больше элемента суммируем с результатом
                elif array[j] < array[i]:
                    result -= 1  # числа меньше элемента вычитаем из результат
                else:
                    temp += 1  # числа равные результату откладываем отдельно

        # Медиана - результат без отклонений либо отклонение должно компенсироваться кол-вом отложенных чисел
        if result == 0 or result == temp:
            return array[i]
        elif temp >= abs(result) and result < temp:
            if result > 0 and (temp - result) % 2 == 0:
                return array[i]
            elif result < 0 and (temp + result) % 2 == 0:
                return array[i]


for k in range(10):
    m = randint(0, 15)
    array = [2 * randint(1, 10) + 1 for x in range(2 * m + 1)]
    print(f'{array}\nМедиана: {median(array)} (median), {median_no_sort(array)} (поиск),'
          f' {median_with_sort(array, m)} (сортировка)\n')

""" [17, 19, 3, 5, 13, 5, 21, 17, 3, 15, 3]
    Медиана: 13 (median), 13 (поиск), 13 (сортировка)

    [7, 5, 9, 13, 17, 5, 13, 15, 17, 5, 15, 3, 7, 3, 13, 13, 15, 9, 17, 9, 9, 13, 3, 3, 11, 15, 19, 5, 17, 13, 19]
    Медиана: 13 (median), 13 (поиск), 13 (сортировка)

    [3, 19, 13, 17, 21, 19, 9, 15, 9, 15, 11, 21, 17, 15, 5, 11, 5, 9, 19, 13, 11]
    Медиана: 13 (median), 13 (поиск), 13 (сортировка)

    [17, 21, 9, 11, 15, 21, 21, 7, 9, 15, 21, 15, 13, 15, 19, 15, 5, 3, 17, 11, 7, 5, 9, 7, 9, 21, 3]
    Медиана: 13 (median), 13 (поиск), 13 (сортировка)

    [19, 9, 3, 17, 9, 13, 11, 19, 7, 19, 11, 19, 11, 17, 5, 19, 15, 15, 9, 11, 21, 7, 7, 15, 3, 7, 21, 9, 5]
    Медиана: 11 (median), 11 (поиск), 11 (сортировка)

    [19, 3, 3, 17, 5, 17, 17, 13, 13, 7, 21, 9, 7, 5, 13, 3, 7, 17, 5, 11, 9, 19, 11, 21, 17, 11, 3, 9, 5]
    Медиана: 11 (median), 11 (поиск), 11 (сортировка)

    [21, 3, 9, 5, 21, 3, 21, 9, 7, 21, 21, 19, 5, 13, 17, 21, 3, 21, 9]
    Медиана: 13 (median), 13 (поиск), 13 (сортировка)

    ...
"""
