"""
7.	Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
 где n - любое натуральное число.

 Решите через рекурсию. Решение через цикл не принимается.
Для оценки Отлично в этом блоке необходимо выполнить 5 заданий из 7
"""


def series(n):
    if n<=0: return 0
    return n+series(n-1)

try:
    Col = int(input("Введите число n: "))
    if Col < 0:
        print("Число должно быть натуральным (целым, больше нуля)!")
    if series(Col) == Col*(Col+1)/2:
        print("Для числа n=", Col, "теория доказана, равенство 1+2+...+n = n(n+1)/2 верное")
    else:
        print("Для числа n=", Col, "теория не верна, равенство 1+2+...+n = n(n+1)/2 не выполняется")

except ValueError:
    print("Введенные данные не являются целым числом")